[ [ "SERVICE_ID", "NUMBER", "<p>Service ID</p>" ], [ "NAME", "VARCHAR2(64)", "<p>Name of the service</p>" ], [ "NAME_HASH", "NUMBER", "<p>Service name hash</p>" ], [ "NETWORK_NAME", "VARCHAR2(512)", "<p>Network name</p>" ], [ "CREATION_DATE", "DATE", "<p>Creation date</p>" ], [ "CREATION_DATE_HASH", "NUMBER", "<p>Creation date hash</p>" ], [ "GOAL", "VARCHAR2(12)", "<p>Runtime Load Balancing Goal being used to create run-time load balancing and connection load balancing advice:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NONE</code></p>\n</li>\n<li>\n<p><code>SERVICE_TIME</code> - Connections are balanced by response time</p>\n</li>\n<li>\n<p><code>THROUGHPUT</code> - Connections are balanced by throughput</p>\n</li>\n</ul>" ], [ "DTP", "VARCHAR2(1)", "<p>Indicates whether or not Distributed Transaction Processing is enabled for this service. When Distributed Transaction Processing is set to <code>Y</code> (YES), it means that the service is offered at exactly one instance at a time for XA affinity. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Y</code> - YES</p>\n</li>\n<li>\n<p><code>N</code> - NO</p>\n</li>\n</ul>" ], [ "BLOCKED", "VARCHAR2(3)", "<p>Indicates whether a service on the specified instance is blocked from accepting new connections altogether (<code>YES</code>) or not (<code>NO</code>). If a service is blocked, then all connections will be directed to other instances (if any) that are hosting the desired service.</p>" ], [ "AQ_HA_NOTIFICATION", "VARCHAR2(3)", "<p>Indicates whether FAN - Fast Application Notification for OCI connections is set (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "CLB_GOAL", "VARCHAR2(5)", "<p>Connection load balancing goal used with statistics that are sent to the listeners to determine how new connections are distributed:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>LONG</code></p>\n</li>\n<li>\n<p><code>SHORT</code></p>\n</li>\n</ul>" ], [ "COMMIT_OUTCOME", "VARCHAR2(3)", "<p>For Transaction Guard, indicates whether the database service associated with the user session has the COMMIT_OUTCOME service attribute enabled (<code>YES</code>) or not (<code>NO</code>).</p>\n<p>When the attribute is enabled:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>The outcome of a COMMIT transaction is durable, which means the status of the last COMMIT executed can be looked up after an outage.</p>\n</li>\n<li>\n<p>A logical transaction ID (LTXID) is set for each user session at session creation and successful commit.</p>\n</li>\n</ul>\n<p><span class=\"bold\">See Also:</span> For information about preserving the commit outcome, see <a class=\"olink ADFNS338\" target=\"_blank\" href=\"../ADFNS/transaction-guard.htm#ADFNS338\"><span class=\"italic\">Oracle Database Development Guide</span></a>. For information about logical transaction IDs, see <a class=\"olink ADFNS324\" target=\"_blank\" href=\"../ADFNS/transaction-guard.htm#ADFNS324\"><span class=\"italic\">Oracle Database Development Guide</span></a></p>" ], [ "RETENTION_TIME", "NUMBER", "<p>For Transaction Guard (<code>COMMIT_OUTCOME</code> set to <code>TRUE</code>), this parameter determines the amount of time (in seconds) that the commit outcome is retained in the database</p>" ], [ "REPLAY_INITIATION_TIMEOUT", "NUMBER", "<p>For Application Continuity, this option specifies the difference between the time (in seconds) of original execution of the first operation of a request and the time that the replay is ready to start after a successful reconnect. Application Continuity will not replay after the specified amount of time has passed. This option is intended to avoid the unintentional execution of a transaction when a system is recovered after a long period of time. The default is 5 minutes (300 seconds).</p>" ], [ "SESSION_STATE_CONSISTENCY", "VARCHAR2(30)", "<p>Describes how non-transactional is changed during a request. This parameter is considered only if <code>failover_type</code> is set to <code>TRANSACTION</code> for Application Continuity. Examples of session state are NLS settings, optimizer preferences, event settings, PL/SQL global variables, temporary tables, advanced queues, LOBs, and result cache. If non-transactional values change after the request starts, the default value of <code>DYNAMIC</code> should be set. Almost all applications should use <code>DYNAMIC</code> mode. If you are unsure, use <code>DYNAMIC</code> mode.</p>" ], [ "GLOBAL", "VARCHAR2(3)", "<p>Indicates whether the service is global. A global service is managed by Global Service Manager (GSM) and can be provided by multiple databases that contain replicated data. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: Indicates the service is global</p>\n</li>\n<li>\n<p><code>NO</code>: Indicates the service is not global</p>\n</li>\n</ul>" ], [ "CON_NAME", "VARCHAR2(30)", "<p>Container name of the object. The value of this column is <code>NULL</code> in non-CDBs.</p>" ], [ "SQL_TRANSLATION_PROFILE", "VARCHAR2(65)", "<p>A non-NULL value specifies the initial SQL translation profile for subsequent database connections that use the service and do not specify a SQL translation profile. A NULL value has no effect.</p>" ], [ "MAX_LAG_TIME", "VARCHAR2(30)", "<p>The maximum replication lag (in seconds) that is acceptable for a data replica to be used for providing the database service. Can only be specified for global services.</p>" ], [ "STOP_OPTION", "VARCHAR2(128)", "<p>Stop option for sessions of this service for planned maintenance</p>" ], [ "FAILOVER_RESTORE", "VARCHAR2(128)", "<p>Indicates whether sessions recover their commonly used session state (like NLS, schema) when they are failed over with TAF</p>" ], [ "DRAIN_TIMEOUT", "NUMBER", "<p>Number of seconds to wait for sessions to be drained</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]