[ [ "GROUP_NUMBER", "NUMBER", "<p>Number of the disk group being used by the database instance (foreign key to the <code>V$ASM_DISKGROUP</code> view). When a client is connected to an Oracle ASM instance, but is not currently using any disk groups, <code>V$ASM_CLIENT.GROUP_NUMBER</code> contains <code>0</code>.</p>\n<p>When the Cluster Ready Services Daemon (CRSD) or Cluster Synchronization Services (OCSSD) connects to the Oracle ASM instance, this will represent the number of the diskgroup used for their OCR and voting files respectively.</p>" ], [ "INSTANCE_NAME", "VARCHAR2(64)", "<p>Identifier for the database instance client</p>\n<p>When CRSD or OCSSD has opened its files in the diskgroup mounted by the Oracle ASM instance, this will contain the node name where CRSD or OCSSD is running.</p>" ], [ "DB_NAME", "VARCHAR2(8)", "<p>Unique database name of the database client instance</p>\n<p>When CRSD has opened the Oracle Cluster Registry (OCR) file in the diskgroup mounted by the Oracle ASM instance, <code>DB_NAME</code> will contain <code>_OCR</code>.</p>\n<p>When OCSSD has opened the voting file in the diskgroup mounted by the Oracle ASM instance, <code>DB_NAME</code> will contain <code>_CSS</code>.</p>" ], [ "CLUSTER_NAME", "VARCHAR2(31)", "<p>Name of the cluster</p>" ], [ "STATUS", "VARCHAR2(12)", "<p>Status of the client connection:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CONNECTED</code> - Database instance client has an active connection to the Oracle ASM instance</p>\n</li>\n<li>\n<p><code>DISCONNECTED</code> - Database instance client normally ended its connection to the Oracle ASM instance</p>\n</li>\n<li>\n<p><code>BROKEN</code> - Connection with the database instance client terminated abnormally</p>\n</li>\n</ul>\n<p>When CRSD or OCSSD has opened its files in the diskgroup mounted by the Oracle ASM instance, it will report <code>Connected</code> as status.</p>" ], [ "SOFTWARE_VERSION", "VARCHAR2(60)", "<p>Software version number of the database or Oracle ASM instance for the selected disk group connection</p>" ], [ "COMPATIBLE_VERSION", "VARCHAR2(60)", "<p>Compatibility setting of the database or Oracle ASM instance for the selected disk group connection</p>\n<p>The value will be <code>-</code> when CRSD or OCSSD has opened its files in the diskgroup mounted by the Oracle ASM instance.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>\n<p>For this view, the value is always <code>0</code>.</p>" ] ]