[ [ "GROUP_NUMBER", "NUMBER", "<p>Number of the disk group containing the disk (foreign key to the <code>V$ASM_DISKGROUP</code> view)</p>" ], [ "DISK_NUMBER", "NUMBER", "<p>Number assigned to the disk within its disk group</p>" ], [ "COMPOUND_INDEX", "NUMBER", "<p>A 32-bit number consisting of a disk group number in the high-order 8 bits and a disk number in the low-order 24 bits (for efficient access to the view)</p>" ], [ "INCARNATION", "NUMBER", "<p>Incarnation number for the disk</p>" ], [ "MOUNT_STATUS", "VARCHAR2(7)", "<p>Per-instance status of the disk relative to group mounts:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>MISSING</code> - Oracle ASM metadata indicates that the disk is known to be part of the Oracle ASM disk group but no disk in the storage system was found with the indicated name</p>\n</li>\n<li>\n<p><code>CLOSED</code> - Disk is present in the storage system but is not being accessed by Oracle ASM</p>\n</li>\n<li>\n<p><code>OPENED</code> - Disk is present in the storage system and is being accessed by Oracle ASM. This is the normal state for disks in a database instance which are part of a disk group being actively used by the instance.</p>\n</li>\n<li>\n<p><code>CACHED</code> - Disk is present in the storage system and is part of a disk group being accessed by the Oracle ASM instance. This is the normal state for disks in an Oracle ASM instance which are part of a mounted disk group.</p>\n</li>\n<li>\n<p><code>IGNORED</code> - Disk is present in the system but is ignored by Oracle ASM because of one of the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>The disk is detected by the system library but is ignored because an Oracle ASM library discovered the same disk</p>\n</li>\n<li>\n<p>Oracle ASM has determined that the membership claimed by the disk header is no longer valid</p>\n</li>\n</ul>\n</li>\n<li>\n<p><code>CLOSING</code> - Oracle ASM is in the process of closing this disk</p>\n</li>\n</ul>" ], [ "HEADER_STATUS", "VARCHAR2(12)", "<p>Per-instance status of the disk as seen by discovery:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>UNKNOWN</code> - Oracle ASM disk header has not been read</p>\n</li>\n<li>\n<p><code>CANDIDATE</code> - Disk is not part of a disk group and may be added to a disk group with the <code>ALTER DISKGROUP</code> statement</p>\n</li>\n<li>\n<p><code>INCOMPATIBLE</code> - Version number in the disk header is not compatible with the Oracle ASM software version</p>\n</li>\n<li>\n<p><code>PROVISIONED</code> - Disk is not part of a disk group and may be added to a disk group with the <code>ALTER DISKGROUP</code> statement. The <code>PROVISIONED</code> header status is different from the <code>CANDIDATE</code> header status in that <code>PROVISIONED</code> implies that an additional platform-specific action has been taken by an administrator to make the disk available for Oracle ASM.</p>\n</li>\n<li>\n<p><code>MEMBER</code> - Disk is a member of an existing disk group. No attempt should be made to add the disk to a different disk group. The <code>ALTER DISKGROUP</code> statement will reject such an addition unless overridden with the <code>FORCE</code> option.</p>\n</li>\n<li>\n<p><code>FORMER</code> - Disk was once part of a disk group but has been dropped cleanly from the group. It may be added to a new disk group with the <code>ALTER DISKGROUP</code> statement.</p>\n</li>\n<li>\n<p><code>CONFLICT</code> - Oracle ASM disk was not mounted due to a conflict</p>\n</li>\n<li>\n<p><code>FOREIGN</code> - Disk contains data created by an Oracle product other than Oracle ASM. This includes data files, logfiles, and OCR disks.</p>\n</li>\n</ul>" ], [ "MODE_STATUS", "VARCHAR2(7)", "<p>Global status about which kinds of I/O requests are allowed to the disk:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>ONLINE</code> - Disk is online and operating normally. Reads and writes are attempted when the disk is mounted. Reads are attempted as part of disk discovery.</p>\n</li>\n<li>\n<p><code>OFFLINE</code> - Disk is offline and access to data is not permitted. Reads and writes are not attempted. An offline disk remains logically part of its disk group.</p>\n</li>\n</ul>" ], [ "STATE", "VARCHAR2(8)", "<p>Global state of the disk with respect to the disk group:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>UNKNOWN</code> - Oracle ASM disk state is not known (typically the disk is not mounted)</p>\n</li>\n<li>\n<p><code>NORMAL</code> - Disk is online and operating normally</p>\n</li>\n<li>\n<p><code>ADDING</code> - Disk is being added to a disk group, and is pending validation by all instances that have the disk group mounted</p>\n</li>\n<li>\n<p><code>DROPPING</code> - Disk has been manually taken offline and space allocation or data access for the disk halts. Rebalancing will commence to relocate data off the disks to other disks in the disk group. Upon completion of the rebalance, the disk is expelled from the group.</p>\n</li>\n<li>\n<p><code>HUNG</code> - Disk drop operation cannot continue because there is insufficient space to relocate the data from the disk being dropped</p>\n</li>\n<li>\n<p><code>FORCING</code> - Disk is being removed from the disk group without attempting to offload its data. The data will be recovered from redundant copies, where possible.</p>\n</li>\n</ul>" ], [ "REDUNDANCY", "VARCHAR2(7)", "<p>Hardware redundancy of the disk:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>UNKNOWN</code></p>\n</li>\n<li>\n<p><code>UNPROT</code></p>\n</li>\n<li>\n<p><code>MIRROR</code></p>\n</li>\n<li>\n<p><code>PARITY</code></p>\n</li>\n</ul>\n<p><span class=\"bold\">Note:</span> This column is valid only if an ASMLIB is present that supports returning hardware redundancy information. This column is not related to the redundancy of the disk group of which the disk is a member.</p>" ], [ "LIBRARY", "VARCHAR2(64)", "<p>Name of the library that discovered the disk</p>" ], [ "OS_MB", "NUMBER", "<p>Size of the disk (in megabytes) as reported by the host operating system</p>" ], [ "TOTAL_MB", "NUMBER", "<p>Total capacity of the disk (in megabytes)</p>" ], [ "FREE_MB", "NUMBER", "<p>Unused capacity of the disk (in megabytes)</p>" ], [ "HOT_USED_MB", "NUMBER", "<p>Number of used megabytes in the hot region</p>" ], [ "COLD_USED_MB", "NUMBER", "<p>Number of used megabytes in the cold region</p>" ], [ "NAME", "VARCHAR2(30)", "<p>Name of the disk</p>" ], [ "FAILGROUP", "VARCHAR2(30)", "<p>Name of the failure group containing the disk</p>" ], [ "LABEL", "VARCHAR2(31)", "<p>Disk label portion of the name returned by discovery</p>" ], [ "PATH", "VARCHAR2(256)", "<p>Operating system path name portion of the name returned by discovery</p>" ], [ "UDID", "VARCHAR2(64)", "<p>Unique Device ID portion of the name returned by discovery</p>" ], [ "PRODUCT", "VARCHAR2(32)", "<p>Name of the manufacturer and the name of the product. All disks with the same product id will have the same performance and reliability characteristics.</p>" ], [ "CREATE_DATE", "DATE", "<p>Date and time when the disk was added to the disk group</p>" ], [ "MOUNT_DATE", "DATE", "<p>Date and time when the disk was mounted by the first instance</p>" ], [ "REPAIR_TIMER", "NUMBER", "<p>Seconds remaining until the disk is automatically dropped (<code>0</code> if not failed)</p>" ], [ "READS", "NUMBER", "<p>Total number of I/O read requests for the disk</p>" ], [ "WRITES", "NUMBER", "<p>Total number of I/O write requests for the disk</p>" ], [ "READ_ERRS", "NUMBER", "<p>Total number of failed I/O read requests for the disk</p>" ], [ "WRITE_ERRS", "NUMBER", "<p>Total number of failed I/O write requests for the disk</p>" ], [ "READ_TIMEOUT", "NUMBER", "<p>Number of read I/Os that are timed out</p>" ], [ "WRITE_TIMEOUT", "NUMBER", "<p>Number of write I/Os that are timed out</p>" ], [ "READ_TIME", "NUMBER", "<p>Total I/O time (in seconds) for read requests for the disk if the <code>TIMED_STATISTICS</code> initialization parameter is set to <code>true</code> (<code>0</code> if set to <code>false</code>)</p>" ], [ "WRITE_TIME", "NUMBER", "<p>Total I/O time (in seconds) for write requests for the disk if the <code>TIMED_STATISTICS</code> initialization parameter is set to <code>true</code> (<code>0</code> if set to <code>false</code>)</p>" ], [ "BYTES_READ", "NUMBER", "<p>Total number of bytes read from the disk</p>" ], [ "BYTES_WRITTEN", "NUMBER", "<p>Total number of bytes written to the disk</p>" ], [ "PREFERRED_READ", "VARCHAR2(1)", "<p>Status of the preferred read failure group:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>U</code> - Disk group has no preferred read failure group</p>\n</li>\n<li>\n<p><code>Y</code> - Disk is a preferred read disk</p>\n</li>\n<li>\n<p><code>N</code> - Disk is not a preferred read disk</p>\n</li>\n</ul>\n<p>For a disk group with one or more preferred read failure groups, if the disk is in one of the preferred read failure groups, the value of this column is <code>Y</code>; otherwise it is <code>N</code>.</p>" ], [ "HASH_VALUE", "NUMBER", "<p>A unique hash value for an Oracle ASM disk, computed using the Oracle ASM disk name (as specified by <code>NAME</code> column in <code>v$asm_disk</code>) and the Oracle ASM disk group name (as specified by <code>NAME</code> column in <code>v$asm_diskgroup</code>).</p>" ], [ "HOT_READS", "NUMBER", "<p>Number of reads from the hot region on disk</p>" ], [ "HOT_WRITES", "NUMBER", "<p>Number of writes to the hot region on disk</p>" ], [ "HOT_BYTES_READ", "NUMBER", "<p>Number of bytes read from the hot region on disk</p>" ], [ "HOT_BYTES_WRITTEN", "NUMBER", "<p>Number of bytes written to the hot region on disk</p>" ], [ "COLD_READS", "NUMBER", "<p>Number of reads from the cold region on disk</p>" ], [ "COLD_WRITES", "NUMBER", "<p>Number of writes to the cold region on disk</p>" ], [ "COLD_BYTES_READ", "NUMBER", "<p>Number of bytes read from the cold region on disk</p>" ], [ "COLD_BYTES_WRITTEN", "NUMBER", "<p>Number of bytes written to the cold region on disk</p>" ], [ "VOTING_FILE", "VARCHAR2(1)", "<p>Indicates whether the disk contains a voting file (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "SECTOR_SIZE", "NUMBER", "<p>Physical block size (in bytes)</p>" ], [ "LOGICAL_SECTOR_SIZE</code><a id=\"GUID-8E2E5721-6D4E-48C2-8DF3-A0EEBD439606__THISCOLUMNISAVAILABLESTARTINGWITHOR-6B47567D\" href=\"#GUID-8E2E5721-6D4E-48C2-8DF3-A0EEBD439606__THISCOLUMNISAVAILABLESTARTINGWITHOR-6B47567D\" onclick='footdisplay(1,\"This column is available starting with Oracle Database 12c Release 2 (12.2.0.1). \")'><sup>Foot&nbsp;1</sup></a><a id=\"fnsrc_d1528249e983\" href=\"#fnsrc_d1528249e983\" onclick='footdisplay(, \\\"This column is available starting with Oracle Database 12c Release 2 (12.2.0.1). \")'><sup>Footref&nbsp;</sup></a></p>\n</td>\n<td class=\"cellalignment3905\" headers=\"d1528249e973 d1528249e171\">\n<p><code>NUMBER</code></p>\n</td>\n<td class=\"cellalignment3908\" headers=\"d1528249e973 d1528249e174\">\n<p>Shows the logical sector size value of the disk in bytes. This is the smallest possible I/O that can be done by the disk.</p>\n<p>If the value of the <code>LOGICAL_SECTOR_SIZE</code> column is <code>512</code>, while the value in the <code>SECTOR_SIZE</code> column is <code>4096</code>, then the disk supports 512 sector size emulation. This means the disk can be used for both 512 native and 4096 native disk groups.</p>\n</td>\n</tr>\n<tr>\n<td class=\"cellalignment3904\" id=\"d1528249e1007\" headers=\"d1528249e168\">\n<p><code>FAILGROUP_TYPE", "VARCHAR2(7)", "<p>Type of the failure group:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>REGULAR</code></p>\n</li>\n<li>\n<p><code>QUORUM</code></p>\n</li>\n</ul>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>\n<p>For this view, the value is always <code>0</code>.</p>" ] ]