[ [ "RECID", "NUMBER", "<p>Record ID for this row; it is an integer that identifies this row</p>" ], [ "STAMP", "NUMBER", "<p>Timestamp used with RECID to uniquely identify this row</p>" ], [ "SET_STAMP", "NUMBER", "<p>One of the foreign keys for the row of the <code>V$BACKUP_SET</code> table that identifies this backup set</p>" ], [ "SET_COUNT", "NUMBER", "<p>One of the foreign keys for the row of the <code>V$BACKUP_SET</code> table that identifies this backup set</p>" ], [ "THREAD#", "NUMBER", "<p>Thread number for the log</p>" ], [ "SEQUENCE#", "NUMBER", "<p>Log sequence number</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p>Change number of the last resetlogs before the log was written</p>" ], [ "RESETLOGS_TIME", "DATE", "<p>Change time of the last resetlogs before the log was written. These will be the same for all logs in a backup set.</p>" ], [ "FIRST_CHANGE#", "NUMBER", "<p>SCN when the log was switched into. The redo in the log is at this SCN and greater.</p>" ], [ "FIRST_TIME", "DATE", "<p>Time allocated when the log was switched into</p>" ], [ "NEXT_CHANGE#", "NUMBER", "<p>SCN when the next log in this thread was switched into. The redo in the log is below this SCN.</p>" ], [ "NEXT_TIME", "DATE", "<p>Time when the next log in this thread was switched into</p>" ], [ "BLOCKS", "NUMBER", "<p>Size of the log in logical blocks including the header block</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Size of the log blocks in bytes</p>" ], [ "TERMINAL", "VARCHAR2(3)", "<p>Indicates whether this record corresponds to a terminal archived redo log, as defined in <code>V$ARCHIVED_LOG</code> (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]