[ [ "SID", "NUMBER", "<p>Oracle SID of the session doing the backup or restore</p>" ], [ "SERIAL", "NUMBER", "<p>Use count for the SID doing the backup or restore</p>" ], [ "USE_COUNT", "NUMBER", "<p>A counter that can be used to identify rows from different backup sets</p>" ], [ "RMAN_STATUS_RECID", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> record ID</p>" ], [ "RMAN_STATUS_STAMP", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> record stamp</p>" ], [ "DEVICE_TYPE", "VARCHAR2(17)", "<p>Device type where the file is located</p>" ], [ "TYPE", "VARCHAR2(9)", "<p><code>INPUT</code>, <code>OUTPUT</code>, or <code>AGGREGATE</code></p>" ], [ "STATUS", "VARCHAR2(11)", "<p><code>NOT STARTED</code>, <code>IN PROGRESS</code>, or <code>FINISHED</code></p>" ], [ "FILENAME", "VARCHAR2(513)", "<p>Name of the backup file being read or written</p>" ], [ "SET_COUNT", "NUMBER", "<p>Set count of the backup set being read or written</p>" ], [ "SET_STAMP", "NUMBER", "<p>Set stamp of the backup set being read or written</p>" ], [ "BUFFER_SIZE", "NUMBER", "<p>Size of the buffers being used to read/write the file, in bytes</p>" ], [ "BUFFER_COUNT", "NUMBER", "<p>Number of buffers being used to read/write the file</p>" ], [ "TOTAL_BYTES", "NUMBER", "<p>Total number of bytes that will be read or written for the file, if known. If not known, this column will be null</p>" ], [ "OPEN_TIME", "DATE", "<p>Time the file was opened. If <code>TYPE</code>='<code>AGGREGATE</code>', then this is the time that the first file in the aggregate was opened</p>" ], [ "CLOSE_TIME", "DATE", "<p>Time the file was closed. If <code>TYPE</code>='<code>AGGREGATE</code>', then this is the time that the last file in the aggregate was closed</p>" ], [ "ELAPSED_TIME", "NUMBER", "<p>Time, in hundredths of a second, that the file was open</p>" ], [ "MAXOPENFILES", "NUMBER", "<p>Number of concurrently open DISK files. This value is only present in rows where <code>TYPE</code>='<code>AGGREGATE</code>'.</p>" ], [ "BYTES", "NUMBER", "<p>Number of bytes read or written so far</p>" ], [ "EFFECTIVE_BYTES_PER_SECOND", "NUMBER", "<p>I/O rate that was achieved with this device during this backup</p>" ], [ "IO_COUNT", "NUMBER", "<p>Number of I/Os that were performed to this file</p>" ], [ "READY", "NUMBER", "<p>Number of asynchronous requests for which a buffer was immediately ready for use</p>" ], [ "SHORT_WAITS", "NUMBER", "<p>Number of times that a buffer was not immediately available, but a buffer became available after doing a nonblocking poll for I/O completion</p>" ], [ "SHORT_WAIT_TIME_TOTAL", "NUMBER", "<p>Total time, in hundredths of a second, taken by nonblocking polls for I/O completion</p>" ], [ "SHORT_WAIT_TIME_MAX", "NUMBER", "<p>Maximum time taken for a nonblocking poll for I/O completion, in hundredths of a second</p>" ], [ "LONG_WAITS", "NUMBER", "<p>The number of times that a buffer was not immediately available, and only became available after a blocking wait was issued</p>" ], [ "LONG_WAIT_TIME_TOTAL", "NUMBER", "<p>The total time, in hundredths of a second, taken by blocking waits for I/O completion</p>" ], [ "LONG_WAIT_TIME_MAX", "NUMBER", "<p>The maximum time taken for a blocking wait for I/O completion, in hundredths of a second</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]