[ [ "CR_REQUESTS", "NUMBER", "<p>Number of CR blocks served due to remote CR block requests</p>" ], [ "CURRENT_REQUESTS", "NUMBER", "<p>Number of current blocks served due to remote CR block requests</p>\n<p><code>CR_REQUESTS</code> + <code>CURRENT_REQUESTS</code> = global cache CR clocks served (from <code>V$SYSSTAT</code>).</p>" ], [ "DATA_REQUESTS", "NUMBER", "<p>Number of current or CR requests for data blocks</p>" ], [ "UNDO_REQUESTS", "NUMBER", "<p>Number of CR requests for undo blocks</p>" ], [ "TX_REQUESTS", "NUMBER", "<p>Number of CR requests for undo segment header blocks</p>" ], [ "OTHER_REQUESTS", "NUMBER", "<p>Number of CR requests for other types of blocks</p>\n<p><code>DATA_REQUESTS</code> + <code>UNDO_REQUESTS</code> + <code>TX_REQUESTS</code> + <code>OTHER_REQUESTS</code> = total number of requests handled by the LMS processes</p>" ], [ "CURRENT_RESULTS", "NUMBER", "<p>Number of requests for which no changes were rolled out of the block returned to the requesting instance</p>" ], [ "PRIVATE_RESULTS", "NUMBER", "<p>Number of requests for which changes were rolled out of the block returned to the requesting instance, and only the requesting transaction can use the resulting CR block</p>" ], [ "ZERO_RESULTS", "NUMBER", "<p>Number of requests for which changes were rolled out of the block returned to the requesting instance. Only zero-XID transactions can use the block.</p>" ], [ "DISK_READ_RESULTS", "NUMBER", "<p>Number of requests for which the requesting instance had to read the requested block from disk</p>" ], [ "FAIL_RESULTS", "NUMBER", "<p>Number of requests that failed; the requesting transaction must reissue the request</p>" ], [ "STALE", "NUMBER", "<p>Number of requests for which the disk read of the requested block was stale</p>" ], [ "FAIRNESS_DOWN_CONVERTS", "NUMBER", "<p>Number of times an instance receiving a request has down-converted an X lock on a block because it was not modifying the block</p>" ], [ "FAIRNESS_CLEARS", "NUMBER", "<p>Number of times the \"fairness counter\" was cleared. This counter tracks the number of times a block was modified after it was served.</p>" ], [ "FREE_GC_ELEMENTS", "NUMBER", "<p>Number of times a request was received from another instance and the X lock had no buffers</p>" ], [ "FLUSHES", "NUMBER", "<p>Number of times the log has been flushed by an LMS process</p>" ], [ "FLUSHES_QUEUED", "NUMBER", "<p>Number of flushes queued by an LMS process</p>" ], [ "FLUSH_QUEUE_FULL", "NUMBER", "<p>Number of times the flush queue was full</p>" ], [ "FLUSH_MAX_TIME", "NUMBER", "<p>Maximum time for flush</p>" ], [ "LIGHT_WORKS", "NUMBER", "<p>Number of times the light-work rule was evoked. This rule prevents the LMS processes from going to disk while responding to CR requests for data, undo, or undo segment header blocks. This rule can prevent the LMS process from completing its response to the CR request.</p>" ], [ "ERRORS", "NUMBER", "<p>Number of times an error was signalled by an LMS process</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]