[ [ "NAME", "VARCHAR2(4)", "<p>Name of the dispatcher process</p>" ], [ "PADDR", "RAW(4 | 8)", "<p>Address of the dispatcher process</p>" ], [ "CUR_LOOP_RATE", "NUMBER", "<p>Rate at which the dispatcher has been iterating through its dispatching loop, reported over the past <code>TTL_LOOPS</code>, in iterations/<code>SCALE_LOOPS</code></p>" ], [ "CUR_EVENT_RATE", "NUMBER", "<p>Rate at which the dispatcher has been processing dispatcher events, reported over the past <code>TTL_LOOPS</code>, in events/<code>SCALE_LOOPS</code>. Such dispatcher events include network events and shared server requests.</p>" ], [ "CUR_EVENTS_PER_LOOP", "NUMBER", "<p>Average number of events the dispatcher has been processing in each iteration through its dispatching loop, reported over the past <code>TTL_LOOPS</code>, in events/iteration</p>" ], [ "CUR_MSG_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying messages between clients and shared servers, reported over the past <code>TTL_MSG</code>, in messages/<code>SCALE_MSG</code></p>" ], [ "CUR_SVR_BUF_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying buffers to shared servers, reported over the past <code>TTL_SVR_BUF</code>, in messages/<code>SCALE_SVR_BUF</code></p>" ], [ "CUR_SVR_BYTE_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying data to shared servers, reported over the past <code>TTL_SVR_BUF</code>, in bytes/<code>SCALE_SVR_BUF</code></p>" ], [ "CUR_SVR_BYTE_PER_BUF", "NUMBER", "<p>Average number of data types in each buffer relayed to shared servers, reported over the past <code>TTL_SVR_BUF</code>, in bytes/buffer</p>" ], [ "CUR_CLT_BUF_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying buffers to clients, reported over the past <code>TTL_CLT_BUF</code>, in buffers/<code>SCALE_CLT_BUF</code></p>" ], [ "CUR_CLT_BYTE_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying data to clients, reported over the past <code>TTL_CLT_BUF</code>, in bytes/<code>SCALE_CLT_BUF</code></p>" ], [ "CUR_CLT_BYTE_PER_BUF", "NUMBER", "<p>Average number of data bytes in each buffer relayed to clients, reported over the past <code>TTL_CLT_BUF</code>, in bytes/buffer</p>" ], [ "CUR_BUF_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying buffers to either clients or shared servers, reported over the past <code>TTL_BUF</code>, in bytes/<code>SCALE_BUF</code></p>" ], [ "CUR_BYTE_RATE", "NUMBER", "<p>Rate at which the dispatcher has been relaying data to either clients or shared servers, reported over the past <code>TTL_BUF</code>, in bytes/<code>SCALE_BUF</code></p>" ], [ "CUR_BYTE_PER_BUF", "NUMBER", "<p>Average number of data bytes in each buffer relayed to either clients or shared servers, reported over the past <code>TTL_BUF</code>, in bytes/buffer</p>" ], [ "CUR_IN_CONNECT_RATE", "NUMBER", "<p>Rate at which the dispatcher has been accepting incoming client connections, reported over the past <code>TTL_IN_CONNECT</code>, in connections/<code>SCALE_IN_CONNECT</code></p>" ], [ "CUR_OUT_CONNECT_RATE", "NUMBER", "<p>Rate at which the dispatcher has been establishing outbound connections, reported over the past <code>TTL_OUT_CONNECT</code>, in connections/<code>SCALE_OUT_CONNECT</code></p>" ], [ "CUR_RECONNECT_RATE", "NUMBER", "<p>In a connection pooling setup, the rate at which clients have been reconnecting to the dispatcher, reported over the past <code>TTL_RECONNECT</code>, in reconnections/<code>SCALE_RECONNECT</code></p>" ], [ "MAX_LOOP_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever iterated through its dispatching loop, reported in iterations/<code>SCALE_LOOPS</code>, over the dispatcher's lifetime excluding the past <code>TTL_LOOPS</code></p>" ], [ "MAX_EVENT_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever processed dispatcher events, reported in events/<code>SCALE_LOOPS</code>, over the dispatcher's lifetime excluding the past <code>TTL_LOOPS</code></p>" ], [ "MAX_EVENTS_PER_LOOP", "NUMBER", "<p>Maximum number of events the dispatcher has ever processed in one iteration through its dispatching loop, reported in events/iteration, over the dispatcher's lifetime</p>" ], [ "MAX_MSG_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed messages between clients and shared servers, reported in messages/<code>SCALE_MSG</code>, over the dispatcher's lifetime excluding the past <code>TTL_MSG</code></p>" ], [ "MAX_SVR_BUF_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed buffers to shared servers, reported in buffers/<code>SCALE_SVR_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_SVR_BUF</code></p>" ], [ "MAX_SVR_BYTE_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed data to shared servers, reported in bytes/<code>SCALE_SVR_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_SVR_BUF</code></p>" ], [ "MAX_SVR_BYTE_PER_BUF", "NUMBER", "<p>Maximum number of data bytes the dispatcher has ever relayed in one buffer to a client, reported in bytes/buffer, over the dispatcher's lifetime</p>" ], [ "MAX_CLT_BUF_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed buffers to either clients or shared servers, reported in buffers/<code>SCALE_CLT_BUF</code>, over the dispatcher's life time excluding the past <code>TTL_CLT_BUF</code></p>" ], [ "MAX_CLT_BYTE_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed buffers to clients, reported in bytes/<code>SCALE_CLT_BUF</code>, over the dispatcher's lifetime excluding the last <code>TTL_CLT_BUF</code></p>" ], [ "MAX_CLT_BYTE_PER_BUF", "NUMBER", "<p>Maximum number of data bytes the dispatcher has ever relayed in one buffer to a client, reported in bytes/buffer, over the dispatcher's lifetime</p>" ], [ "MAX_BUF_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed buffers to either clients or shared servers, reported in buffers/<code>SCALE_BUF</code>, over the dispatcher's lifetime, excluding the past <code>TTL_BUF</code></p>" ], [ "MAX_BYTE_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever relayed data to either clients or shared servers, reported in bytes/<code>SCALE_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_BUF</code></p>" ], [ "MAX_BYTE_PER_BUF", "NUMBER", "<p>Maximum number of data bytes the dispatcher has ever relayed in one buffer to either a client or a shared server, reported in bytes/buffer, over the dispatcher's lifetime</p>" ], [ "MAX_IN_CONNECT_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever accepted incoming client connections, reported in connections/<code>SCALE_IN_CONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_IN_CONNECT</code></p>" ], [ "MAX_OUT_CONNECT_RATE", "NUMBER", "<p>Maximum rate at which the dispatcher has ever established outbound connections, reported in connections/<code>SCALE_OUT_CONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_OUT_CONNECT</code></p>" ], [ "MAX_RECONNECT_RATE", "NUMBER", "<p>In a connection pooling setup, the maximum rate at which clients have ever reconnected to this dispatcher, reported in reconnections/<code>SCALE_RECONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_RECONNECT</code></p>" ], [ "AVG_LOOP_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has iterated through its dispatching loop, reported in iterations/<code>SCALE_LOOPS</code>, over the dispatcher's lifetime excluding the past <code>TTL_LOOPS</code></p>" ], [ "AVG_EVENT_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has processed dispatcher events, reported in events/<code>SCALE_LOOPS</code>, over the dispatcher's lifetime excluding the past <code>TTL_LOOPS</code></p>" ], [ "AVG_EVENTS_PER_LOOP", "NUMBER", "<p>Historical average number of events the dispatcher has processed in one iteration through its dispatching loop, reported in events/iteration, over the dispatcher's lifetime excluding the past <code>TTL_LOOPS</code></p>" ], [ "AVG_MSG_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed messages between clients and shared servers, reported in messages/<code>SCALE_MSG</code>, over the dispatcher's lifetime excluding the past <code>TTL_MSG</code></p>" ], [ "AVG_SVR_BUF_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed buffers to shared servers, reported in buffers/<code>SCALE_SVR_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_SVR_BUF</code></p>" ], [ "AVG_SVR_BYTE_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed data to shared servers, reported in bytes/<code>SCALE_SVR_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_SVR_BUF</code></p>" ], [ "AVG_SVR_BYTE_PER_BUF", "NUMBER", "<p>Historical average number of data bytes per buffer the dispatcher has relayed to shared servers, reported in bytes/buffer, over the dispatcher's lifetime excluding the past <code>TTL_SVR_BUF</code></p>" ], [ "AVG_CLT_BUF_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed buffers to clients, reported in buffers/<code>SCALE_CLT_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_CLT_BUF</code></p>" ], [ "AVG_CLT_BYTE_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed data to clients, reported in bytes/<code>SCALE_CLT_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_CLT_BUF</code></p>" ], [ "AVG_CLT_BYTE_PER_BUF", "NUMBER", "<p>Historical average number of data bytes per buffer the dispatcher has relayed to clients, reported in bytes/buffer, over the dispatcher's lifetime excluding the past <code>TTL_CLT_BUF</code></p>" ], [ "AVG_BUF_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed buffers to either clients or shared servers, reported in buffers/<code>SCALE_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_BUF</code></p>" ], [ "AVG_BYTE_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has relayed data to either clients or shared servers, reported in bytes/<code>SCALE_BUF</code>, over the dispatcher's lifetime excluding the past <code>TTL_BUF</code></p>" ], [ "AVG_BYTE_PER_BUF", "NUMBER", "<p>Historical average number of data bytes per buffer the dispatcher has relayed to either clients or shared servers, reported in bytes/buffer, over the dispatcher's lifetime excluding the past <code>TTL_BUF</code></p>" ], [ "AVG_IN_CONNECT_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has accepted incoming client connections, reported in connections/<code>SCALE_IN_CONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_IN_CONNECT</code></p>" ], [ "AVG_OUT_CONNECT_RATE", "NUMBER", "<p>Historical average rate at which the dispatcher has established outbound connections, reported in connections/<code>SCALE_OUT_CONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_OUT_CONNECT</code></p>" ], [ "AVG_RECONNECT_RATE", "NUMBER", "<p>In a connection pooling setup, the historical average rate at which clients have reconnected to this dispatcher, reported in reconnections/<code>SCALE_RECONNECT</code>, over the dispatcher's lifetime excluding the past <code>TTL_RECONNECT</code></p>" ], [ "TTL_LOOPS", "NUMBER", "<p>Time-to-live for \"loops\" samples, reported in hundredths of a second. Default is <code>10</code> minutes.</p>" ], [ "TTL_MSG", "NUMBER", "<p>Time-to-live for \"messages\" samples, reported in hundredths of a second. Default is <code>10</code> seconds.</p>" ], [ "TTL_SVR_BUF", "NUMBER", "<p>Time-to-live for \"buffers to servers\" samples, reported in hundredths of a second. Default is <code>1</code> second.</p>" ], [ "TTL_CLT_BUF", "NUMBER", "<p>Time-to-live for \"buffers to clients\" samples, reported in hundredths of a second. Default is <code>1</code> second.</p>" ], [ "TTL_BUF", "NUMBER", "<p>Time-to-live for \"buffers to clients/servers\" samples, reported in hundredths of a second. Default is <code>1</code> second.</p>" ], [ "TTL_IN_CONNECT", "NUMBER", "<p>Time-to-live for \"inbound connections\" samples, reported in hundredths of a second. Default is <code>10</code> minutes.</p>" ], [ "TTL_OUT_CONNECT", "NUMBER", "<p>Time-to-live for \"outbound connections\" samples, reported in hundredths of a second. Default is <code>10</code> minutes.</p>" ], [ "TTL_RECONNECT", "NUMBER", "<p>Time-to-live for \"reconnections\" samples, reported in hundredths of a second. Default is <code>10</code> minutes.</p>" ], [ "SCALE_LOOPS", "NUMBER", "<p>Scale for \"loops\" statistics, reported in hundredths of a second. Default is <code>1</code> minute.</p>" ], [ "SCALE_MSG", "NUMBER", "<p>Scale for \"messages\" statistics, reported in hundredths of a second. Default is <code>1</code> second.</p>" ], [ "SCALE_SVR_BUF", "NUMBER", "<p>Scale for \"buffers to servers\" statistics, reported in hundredths of a second. Default is <code>1/10</code> second.</p>" ], [ "SCALE_CLT_BUF", "NUMBER", "<p>Scale for \"buffers to clients\" statistics, reported in hundredths of a second. Default is <code>1/10</code> second.</p>" ], [ "SCALE_BUF", "NUMBER", "<p>Scale for \"buffers to clients/servers\" statistics, reported in hundredths of a second. Default is <code>1/10</code> second.</p>" ], [ "SCALE_IN_CONNECT", "NUMBER", "<p>Scale for \"inbound connections\" statistics, reported in hundredths of a second. Default is <code>1</code> minute.</p>" ], [ "SCALE_OUT_CONNECT", "NUMBER", "<p>Scale for \"outbound connections\" statistics, reported in hundredths of a second. Default is <code>1</code> minute.</p>" ], [ "SCALE_RECONNECT", "NUMBER", "<p>Scale for \"reconnections\" statistics, reported in hundredths of a second. Default is <code>1</code> minute.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]