[ [ "EVENT#", "NUMBER", "<p>Number of the wait event</p>" ], [ "EVENT_ID", "NUMBER", "<p>Identifier of the wait event</p>" ], [ "NAME", "VARCHAR2(64)", "<p>Name of the wait event. Names that appear in this column remain stable across Oracle Database releases, and they can be relied on by customer scripts.</p>" ], [ "PARAMETER1", "VARCHAR2(64)", "<p>Description of the first parameter for the wait event</p>" ], [ "PARAMETER2", "VARCHAR2(64)", "<p>Description of the second parameter for the wait event</p>" ], [ "PARAMETER3", "VARCHAR2(64)", "<p>Description of the third parameter for the wait event</p>" ], [ "WAIT_CLASS_ID", "NUMBER", "<p>Identifier of the class of the wait event</p>" ], [ "WAIT_CLASS#", "NUMBER", "<p>Number of the class of the wait event</p>" ], [ "WAIT_CLASS", "VARCHAR2(64)", "<p>Name of the class of the wait event</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"classes-of-wait-events.htm#GUID-B30B0811-0FDC-40FC-92FC-F6726CE94736\">Classes of Wait Events</a>\"</span> for a description of the different wait event classes</p>" ], [ "DISPLAY_NAME", "VARCHAR2(64)", "<p>A clearer and more descriptive name for the wait event that appears in the <code>NAME</code> column. Names that appear in the <code>DISPLAY_NAME</code> column can change across Oracle Database releases, therefore customer scripts should not rely on names that appear in the <code>DISPLAY_NAME</code> column across releases.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]