[ [ "COMPENSATING_XID", "RAW(8)", "<p>Transaction ID of the compensating transaction</p>" ], [ "COMPENSATING_TXN_NAME", "VARCHAR2(255)", "<p>Name of the compensating transaction</p>" ], [ "XID", "RAW(8)", "<p>Transaction ID of a relevant transaction found in memory</p>" ], [ "TXN_NAME", "VARCHAR2(255)", "<p>Name of the transaction with <code>XID</code> as the transaction ID; NULL if none</p>" ], [ "PARENT_XID", "RAW(8)", "<p>Parent transaction ID (for a PDML transaction)</p>" ], [ "INTERESTING", "NUMBER", "<p>If the transaction is in the transaction dependency graph</p>" ], [ "ORIGINAL", "NUMBER", "<p>If the transaction is part of the input set provided</p>" ], [ "BACKOUT_SEQ", "NUMBER", "<p>Order in which the transaction has been backed out</p>" ], [ "NUM_PREDS", "NUMBER", "<p>Number of predecessors of the transaction specified by <code>XID</code> in the transaction graph</p>" ], [ "NUM_SUCCS", "NUMBER", "<p>Number of successors of the transaction specified by <code>XID</code> in the transaction graph</p>" ], [ "DEP_XID", "RAW(8)", "<p>One dependent transaction ID of the transaction specified by <code>XID</code>. This is a particular child of <code>XID</code>.</p>" ], [ "DEP_TXN_NAME", "VARCHAR2(255)", "<p>Transaction name, if any, for the transaction specified by <code>DEP_XID</code></p>" ], [ "TXN_CONF_SQL_ID", "NUMBER", "<p>SQL ID of undo SQL executed in the context of <code>XID</code> which conflicts with the dependent transaction</p>" ], [ "DEP_TXN_CONF_SQL_ID", "NUMBER", "<p>SQL ID of undo SQL executed in the context of <code>DEP_XID</code> which conflicts with <code>XID</code></p>" ], [ "CONFLICT_TYPE", "VARCHAR2(32)", "<p>The type of conflict that the conflict resolution method is used to resolve: delete, uniqueness, or update</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]