[ [ "RECID", "NUMBER", "<p>Archived log record ID</p>" ], [ "STAMP", "NUMBER", "<p>Archived log record stamp</p>" ], [ "NAME", "VARCHAR2(513)", "<p>Archived log file name. If set to NULL, either the log file was cleared before it was archived or an RMAN <code>BACKUP</code> command with the <code>delete input</code> option was executed to back up archivelog all (<code>RMAN&gt; backup archivelog all delete input;</code>).</p>" ], [ "DEST_ID", "NUMBER", "<p>Original destination from which the archive log was generated. The value is 0 if the destination identifier is not available</p>" ], [ "THREAD#", "NUMBER", "<p>Redo thread number</p>" ], [ "SEQUENCE#", "NUMBER", "<p>Redo log sequence number</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p>Resetlogs change number of the database when the log was written</p>" ], [ "RESETLOGS_TIME", "DATE", "<p>Resetlogs time of the database when the log was written</p>" ], [ "RESETLOGS_ID", "NUMBER", "<p>Resetlogs identifier associated with the archived redo log</p>" ], [ "FIRST_CHANGE#", "NUMBER", "<p>First change number in the archived log</p>" ], [ "FIRST_TIME", "DATE", "<p>Timestamp of the first change</p>" ], [ "NEXT_CHANGE#", "NUMBER", "<p>First change in the next log</p>" ], [ "NEXT_TIME", "DATE", "<p>Timestamp of the next change</p>" ], [ "BLOCKS", "NUMBER", "<p>Size of the archived log (in blocks)</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Redo log block size. This is the logical block size of the archived log, which is the same as the logical block size of the online log from which the archived log was copied. The online log logical block size is a platform-specific value that is not adjustable by the user.</p>" ], [ "CREATOR", "VARCHAR2(7)", "<p>Creator of the archive log:</p>\n<p>ARCH - Archiver process</p>\n<p>FGRD - Foreground process</p>\n<p>RMAN - Recovery Manager</p>\n<p>SRMN - RMAN at standby</p>\n<p>LGWR - Logwriter process</p>" ], [ "REGISTRAR", "VARCHAR2(7)", "<p>Registrar of the entry:</p>\n<p>RFS - Remote File Server process</p>\n<p>ARCH - Archiver process</p>\n<p>FGRD - Foreground process</p>\n<p>RMAN - Recovery Manager</p>\n<p>SRMN - RMAN at standby</p>\n<p>LGWR - Logwriter process</p>" ], [ "ARCHIVED", "VARCHAR2(3)", "<p>Indicates whether the online redo log was archived (<code>YES</code>) or whether RMAN only inspected the log and created a record for future application of redo logs during recovery (<code>NO</code>).</p>" ], [ "APPLIED", "VARCHAR2(3)", "<p>Indicates whether the archivelog has been applied to its corresponding standby database (<code>YES</code>) or not (<code>NO</code>). The value is always <code>NO</code> for local destinations.</p>\n<p>This column is meaningful at the standby site for the <code>ARCHIVED_LOG</code> entries with <code>REGISTRAR='RFS'</code> (which means this log is shipped from the primary to the standby database). If <code>REGISTRAR='RFS'</code> and <code>APPLIED</code> is <code>NO</code>, then the log has arrived at the standby but has not yet been applied. If <code>REGISTRAR='RFS'</code> and <code>APPLIED</code> is <code>YES</code>, the log has arrived and been applied at the standby database.</p>\n<p>You can use this field to identify archivelogs that can be backed up and removed from disk.</p>" ], [ "DELETED", "VARCHAR2(3)", "<p>Indicates whether an RMAN <code>DELETE</code> command has physically deleted the archived log file from disk, as well as logically removing it from the control file of the target database and from the recovery catalog (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "STATUS", "VARCHAR2(1)", "<p>Status of the archived log:</p>\n<p>A - Available</p>\n<p>D - Deleted</p>\n<p>U - Unavailable</p>\n<p>X - Expired</p>" ], [ "COMPLETION_TIME", "DATE", "<p>Time when the archiving completed</p>" ], [ "DICTIONARY_BEGIN", "VARCHAR2(3)", "<p>Indicates whether the log contains the start of a LogMiner dictionary (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "DICTIONARY_END", "VARCHAR2(3)", "<p>Indicates whether the log contains the end of a LogMiner dictionary (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "END_OF_REDO", "VARCHAR2(3)", "<p>Indicates whether the archived redo log contains the end of all redo information from the primary database () or not ()</p>" ], [ "ARCHIVAL_THREAD#", "NUMBER", "<p>Redo thread number of the instance that performed the archival operation. This column differs from the <code>THREAD#</code> column only when a closed thread is archived by another instance.</p>" ], [ "IS_RECOVERY_DEST_FILE", "VARCHAR2(3)", "<p>Indicates whether the file was created in the fast recovery area (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "COMPRESSED", "VARCHAR2(3)", "<p>Reserved for internal use</p>" ], [ "FAL", "VARCHAR2(3)", "<p>Indicates whether the archive log was generated as the result of a FAL request (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "END_OF_REDO_TYPE", "VARCHAR2(10)", "<p>Possible values are as follows:</p>\n<p>SWITCHOVER - Shows archived redo log files that are produced at the end of a switchover</p>\n<p>TERMINAL - Shows archived redo log files produced after a failover</p>\n<p>RESETLOGS - Shows online redo log files archived on the primary database after an <code>ALTER DATABASE OPEN RESETLOGS</code> statement is issued</p>\n<p>ACTIVATION - Shows any log files archived on a physical standby database after an <code>ALTER DATABASE ACTIVATE STANDBY DATABASE</code> statement is issued</p>\n<p>\"empty string\" - Any empty string implies that the log is just a normal archival and was not archived due to any of the other events</p>" ], [ "SOURCE_DBID", "NUMBER", "<p>Database ID of the source database that generated this archived log</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]