[ [ "SID", "NUMBER", "<p>Session ID of the apply server's session</p>" ], [ "SERIAL#", "NUMBER", "<p>Serial number of the apply server's session</p>" ], [ "APPLY#", "NUMBER", "<p>Apply process number. An apply process is an Oracle background process, prefixed by <code>ap</code>.</p>" ], [ "APPLY_NAME", "VARCHAR2(128)", "<p>Name of the apply process</p>" ], [ "SERVER_ID", "NUMBER", "<p>Parallel execution server number of the apply server</p>" ], [ "STATE", "VARCHAR2(20)", "<p>State of the apply server:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code> - Starting up</p>\n</li>\n<li>\n<p><code>IDLE</code> - Performing no work</p>\n</li>\n<li>\n<p><code>RECORD LOW-WATERMARK</code> - Performing an administrative job that maintains information about the apply progress, which is used in the <code>ALL_APPLY_PROGRESS</code> and <code>DBA_APPLY_PROGRESS</code> data dictionary views</p>\n</li>\n<li>\n<p><code>ADD PARTITION</code> - Performing an administrative job that adds a partition that is used for recording information about in-progress transactions</p>\n</li>\n<li>\n<p><code>DROP PARTITION</code> - Performing an administrative job that purges rows that were used to record information about in-progress transactions</p>\n</li>\n<li>\n<p><code>EXECUTE TRANSACTION</code> - Applying a transaction</p>\n</li>\n<li>\n<p><code>WAIT COMMIT</code> - Waiting to commit a transaction until all other transactions with a lower commit SCN are applied. This state is possible only if the <code>COMMIT_SERIALIZATION</code> apply process parameter is set to a value other than <code>DEPENDENT_TRANSACTIONS</code> and the <code>PARALLELISM</code> apply process parameter is set to a value greater than <code>1</code>.</p>\n</li>\n<li>\n<p><code>WAIT DEPENDENCY</code> - Waiting to apply a logical change record (LCR) in a transaction until another transaction, on which it has a dependency, is applied. This state is possible only if the <code>PARALLELISM</code> apply process parameter is set to a value greater than <code>1</code>.</p>\n</li>\n<li>\n<p><code>ROLLBACK TRANSACTION</code> - Rolling back a transaction</p>\n</li>\n<li>\n<p><code>TRANSACTION CLEANUP</code> - Cleaning up an applied transaction, which includes removing LCRs from the apply process's queue</p>\n</li>\n<li>\n<p><code>WAIT</code> <code>FOR</code> <code>CLIENT</code> - Waiting for an XStream client application to request more LCRs</p>\n</li>\n<li>\n<p><code>WAIT</code> <code>FOR</code> <code>NEXT</code> <code>CHUNK</code> - Waiting for the next set of LCRs for a large transaction</p>\n</li>\n</ul>" ], [ "XIDUSN", "NUMBER", "<p>Transaction ID undo segment number of the transaction currently being applied</p>" ], [ "XIDSLT", "NUMBER", "<p>Transaction ID slot number of the transaction currently being applied</p>" ], [ "XIDSQN", "NUMBER", "<p>Transaction ID sequence number of the transaction currently being applied</p>" ], [ "COMMITSCN", "NUMBER", "<p>Commit system change number (SCN) of the transaction currently being applied</p>" ], [ "DEP_XIDUSN", "NUMBER", "<p>Transaction ID undo segment number of a transaction on which the transaction being applied by this apply server depends</p>" ], [ "DEP_XIDSLT", "NUMBER", "<p>Transaction ID slot number of a transaction on which the transaction being applied by this apply server depends</p>" ], [ "DEP_XIDSQN", "NUMBER", "<p>Transaction ID sequence number of a transaction on which the transaction being applied by this apply server depends</p>" ], [ "DEP_COMMITSCN", "NUMBER", "<p>Commit system change number (SCN) of the transaction on which this apply server depends</p>" ], [ "MESSAGE_SEQUENCE", "NUMBER", "<p>Number of the current message being applied by the apply server. This value is reset to <code>1</code> at the beginning of each transaction.</p>" ], [ "TOTAL_ASSIGNED", "NUMBER", "<p>Total number of transactions assigned to the apply server since the apply process was last started</p>" ], [ "TOTAL_ADMIN", "NUMBER", "<p>Total number of administrative jobs done by the apply server since the apply process was last started. See the <code>STATE</code> information in this view for the types of administrative jobs.</p>" ], [ "TOTAL_ROLLBACKS", "NUMBER", "<p>Number of transactions assigned to this server which were rolled back</p>" ], [ "TOTAL_MESSAGES_APPLIED", "NUMBER", "<p>Total number of messages applied by this apply server since the apply process was last started</p>" ], [ "APPLY_TIME", "DATE", "<p>Time the last message was applied</p>" ], [ "ELAPSED_APPLY_TIME", "NUMBER", "<p>Time elapsed (in hundredths of a second) applying messages since the apply process was last started</p>" ], [ "COMMIT_POSITION", "RAW(64)", "<p>Commit position of the transaction. This column is populated only for an apply process that is functioning as a GoldenGate Integrated Replicat.</p>" ], [ "DEP_COMMIT_POSITION", "RAW(64)", "<p>Commit position of the transaction the slave depends on. This column is populated only for an apply process that is functioning as a GoldenGate inbound server.</p>" ], [ "LAST_APPLY_POSITION", "RAW(64)", "<p>For inbound servers, the position of the last message applied; for outbound servers, the position of the last message sent to the XStream client application. This column is populated only for an apply process that is functioning as a GoldenGate outbound server or inbound server.</p>" ], [ "TRANSACTION_ID", "VARCHAR2(128)", "<p>Transaction ID that the slave is applying. This column is populated only for an apply process that is functioning as a GoldenGate inbound server.</p>" ], [ "DEP_TRANSACTION_ID", "VARCHAR2(128)", "<p>Transaction ID of the transaction the slave depends on. This column is populated only for an apply process that is functioning as a GoldenGate inbound server.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "TOTAL_LCRS_RETRIED", "NUMBER", "<p>Total number of LCRs retried by this server</p>" ], [ "LCR_RETRY_ITERATION", "NUMBER", "<p>Retry iteration for this transaction by this server</p>" ], [ "TOTAL_TXNS_RETRIED", "NUMBER", "<p>Total transactions retried by this server</p>" ], [ "TXN_RETRY_ITERATION", "NUMBER", "<p>Retry iteration for this transaction by this server</p>" ], [ "TOTAL_TXNS_RECORDED", "NUMBER", "<p>Total transactions recorded in error queue by this server</p>" ] ]