[ [ "NAMESPACE", "VARCHAR2(64)", "<p>Library cache namespace</p>" ], [ "GETS", "NUMBER", "<p>Number of times a lock was requested for objects of this namespace</p>" ], [ "GETHITS", "NUMBER", "<p>Number of times an object's handle was found in memory</p>" ], [ "GETHITRATIO", "NUMBER", "<p>Ratio of <code>GETHITS</code> to <code>GETS</code></p>" ], [ "PINS", "NUMBER", "<p>Number of times a PIN was requested for objects of this namespace</p>" ], [ "PINHITS", "NUMBER", "<p>Number of times all of the metadata pieces of the library object were found in memory</p>" ], [ "PINHITRATIO", "NUMBER", "<p>Ratio of <code>PINHITS</code> to <code>PINS</code></p>" ], [ "RELOADS", "NUMBER", "<p>Any <code>PIN</code> of an object that is not the first <code>PIN</code> performed since the object handle was created, and which requires loading the object from disk</p>" ], [ "INVALIDATIONS", "NUMBER", "<p>Total number of times objects in this namespace were marked invalid because a dependent object was modified</p>" ], [ "DLM_LOCK_REQUESTS", "NUMBER", "<p>Number of <code>GET</code> requests lock instance locks</p>" ], [ "DLM_PIN_REQUESTS", "NUMBER", "<p>Number of PIN requests lock instance locks</p>" ], [ "DLM_PIN_RELEASES", "NUMBER", "<p>Number of release requests PIN instance locks</p>" ], [ "DLM_INVALIDATION_REQUESTS", "NUMBER", "<p>Number of <code>GET</code> requests for invalidation instance locks</p>" ], [ "DLM_INVALIDATIONS", "NUMBER", "<p>Number of invalidation pings received from other instances</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]