[ [ "SESSION_ID", "NUMBER", "<p>Unique identifier for the LogMiner persistent session</p>" ], [ "SESSION_NAME", "VARCHAR2(32)", "<p>Unique session name</p>" ], [ "SESSION_STATE", "VARCHAR2(9)", "<p>Current state of the LogMiner persistent session:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>READY</code> - Client has created the LogMiner persistent session and added the relevant archived redo log files, but has not loaded the initial LogMiner dictionary</p>\n</li>\n<li>\n<p><code>STARTED</code> - The LogMiner dictionary has been loaded</p>\n</li>\n<li>\n<p><code>ACTIVE</code> - The LogMiner persistent session is mining the redo stream</p>\n</li>\n<li>\n<p><code>DETACHED</code> - The LogMiner persistent session is not currently active, and it is in the process of becoming inactive</p>\n</li>\n<li>\n<p><code>DISCARDED</code> - Client is about to destroy the LogMiner persistent session</p>\n</li>\n</ul>" ], [ "DB_NAME", "VARCHAR2(128)", "<p>Global database name for the source database</p>" ], [ "DB_ID", "NUMBER", "<p>Database identifier of the source database</p>" ], [ "RESET_SCN", "NUMBER", "<p>System change number (SCN) when the session started</p>" ], [ "RESET_TIMESTAMP", "NUMBER", "<p>Time of the <code>RESETLOG</code>s when the LogMiner persistent session started</p>" ], [ "RESET_TIME", "DATE", "<p>The time when the session started</p>" ], [ "NUM_PROCESS", "NUMBER", "<p>Number of processes allocated to this session</p>" ], [ "CHUNK_SIZE", "NUMBER", "<p>Amount of memory allocated for this chunk</p>" ], [ "START_SCN", "NUMBER", "<p>System change number (SCN) at start of the session</p>" ], [ "END_SCN", "NUMBER", "<p>System change number (SCN) at end of the session</p>" ], [ "SPILL_SCN", "NUMBER", "<p>In the event of a restart, redo records with an SCN lower than this will not be read from the archived redo log files</p>" ], [ "PROCESSED_SCN", "NUMBER", "<p>The <code>BUILDER</code> process has successfully mined redo records up to this SCN</p>" ], [ "PROCESSED_TIME", "DATE", "<p>The <code>BUILDER</code> process has successfully mined redo records up to this time</p>" ], [ "PREPARED_SCN", "NUMBER", "<p>The <code>PREPARER</code> processes have successfully transformed all redo records below this SCN into logical change records (LCRs). However the LCRs may not have been grouped into transactions or merged in case they pertain to chained rows or LOB updates.</p>" ], [ "READ_SCN", "NUMBER", "<p>The <code>READER</code> process has read all redo records below this SCN</p>" ], [ "LOW_MARK_SCN", "NUMBER", "<p>LogMiner has delivered all transactions that committed below this SCN to the client</p>" ], [ "CONSUMED_SCN", "NUMBER", "<p>Client has consumed and released all transactions that committed below this SCN.</p>" ], [ "MAX_MEMORY_SIZE", "NUMBER", "<p>Maximum amount of shared memory (in bytes) that LogMiner is allowed to consume</p>" ], [ "USED_MEMORY_SIZE", "NUMBER", "<p>Amount of shared memory (in bytes) actually consumed by LogMiner</p>" ], [ "BUILDER_WORK_SIZE", "NUMBER", "<p>Amount of redo (in bytes) in the current work unit being processed by the BUILDER process.</p>" ], [ "PREPARED_WORK_SIZE", "NUMBER", "<p>Amount of redo (in bytes) that has been prepared by LogMiner</p>" ], [ "AVAILABLE_WORK_SIZE", "NUMBER", "<p>Amount of redo records (in bytes) that are ready, but are yet to be consumed by the client</p>" ], [ "AVAILABLE_TXN", "NUMBER", "<p>Number of transaction chunks ready for consumption</p>" ], [ "AVAILABLE_COMMITTED_TXN", "NUMBER", "<p>Number of committed transactions ready for consumption. This is less than, or equal to, <code>AVAILABLE_TXN</code>.</p>" ], [ "DELIVERED_TXN", "NUMBER", "<p>Number of transaction chunks that the client currently has in its possession</p>" ], [ "DELIVERED_COMMITTED_TXN", "NUMBER", "<p>Number of committed transaction chunks that the client is currently working on. This is less than, or equal to, the value of the <code>DELIVERED_TXN</code> column.</p>" ], [ "PINNED_TXN", "NUMBER", "<p>Number of transactions pinned (the client is actively working on)</p>" ], [ "PINNED_COMMITTED_TXN", "NUMBER", "<p>Number of committed transactions pinned (the client is actively working on)</p>" ], [ "CHECKPOINT_INTERVAL", "NUMBER", "<p>Checkpoint interval</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]