[ [ "SLAVE_NAME", "VARCHAR2(4)", "<p>Name of the parallel execution server</p>" ], [ "STATUS", "VARCHAR2(4)", "<p>Current status of the parallel execution server:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>BUSY</code></p>\n</li>\n<li>\n<p><code>IDLE</code></p>\n</li>\n</ul>" ], [ "SESSIONS", "NUMBER", "<p>Number of sessions that have used this parallel execution server</p>" ], [ "IDLE_TIME_CUR", "NUMBER", "<p>Amount of time spent idle while processing statements in the current session</p>" ], [ "BUSY_TIME_CUR", "NUMBER", "<p>Amount of time spent busy while processing statements in the current session</p>" ], [ "CPU_SECS_CUR", "NUMBER", "<p>Amount of CPU time spent on the current session</p>" ], [ "MSGS_SENT_CUR", "NUMBER", "<p>Number of messages sent while processing statements for the current session</p>" ], [ "MSGS_RCVD_CUR", "NUMBER", "<p>Number of messages received while processing statements for the current session</p>" ], [ "IDLE_TIME_TOTAL", "NUMBER", "<p>Total amount of time this query server has been idle</p>" ], [ "BUSY_TIME_TOTAL", "NUMBER", "<p>Total amount of time this query server has been active</p>" ], [ "CPU_SECS_TOTAL", "NUMBER", "<p>Total amount of CPU time this query server has used to process statements</p>" ], [ "MSGS_SENT_TOTAL", "NUMBER", "<p>Total number of messages this query server has sent</p>" ], [ "MSGS_RCVD_TOTAL", "NUMBER", "<p>Total number of messages this query server has received</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]