[ [ "PID", "NUMBER", "<p>Oracle process identifier</p>" ], [ "SERIAL#", "NUMBER", "<p>Oracle process serial number</p>" ], [ "CATEGORY", "VARCHAR2(15)", "<p>Category name. Categories include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>SQL</code></p>\n</li>\n<li>\n<p><code>PL/SQL</code></p>\n</li>\n<li>\n<p><code>OLAP</code></p>\n</li>\n<li>\n<p><code>JAVA</code></p>\n</li>\n<li>\n<p><code>Freeable</code></p>\n</li>\n<li>\n<p><code>Other</code></p>\n</li>\n</ul>" ], [ "NAME", "VARCHAR2(26)", "<p>PGA memory allocation comment. Small allocations may be grouped together with <code>NAME</code> set to <code>Miscellaneous</code> for performance reasons.</p>" ], [ "HEAP_NAME", "VARCHAR2(15)", "<p>Name of heap or heaps (if same name) containing the allocations</p>" ], [ "BYTES", "NUMBER", "<p>Bytes of PGA memory allocated in the process from heaps with the given heap name and with the given allocation comment</p>" ], [ "ALLOCATION_COUNT", "NUMBER", "<p>Number of allocations with the comment found in the process inside heaps with the given heap name</p>" ], [ "HEAP_DESCRIPTOR", "RAW(4 | 8)", "<p>If all the allocations are from one heap, then this is the address of the heap descriptor for that heap. Otherwise, this column is <code>NULL</code>.</p>" ], [ "PARENT_HEAP_DESCRIPTOR", "RAW(4 | 8)", "<p>If all the allocations are from one heap, then this is the address of the parent heap descriptor for that heap. Otherwise, this column is <code>NULL</code>. If the heap has no parent, the value is zero.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]