[ [ "RECID", "NUMBER", "<p>Proxy copy record ID</p>" ], [ "STAMP", "NUMBER", "<p>Proxy copy record stamp</p>" ], [ "DEVICE_TYPE", "VARCHAR2(17)", "<p>Type of the device on which the copy resides</p>" ], [ "HANDLE", "VARCHAR2(513)", "<p>Proxy copy handle identifies the copy for restore</p>" ], [ "COMMENTS", "VARCHAR2(81)", "<p>Comment returned by the operating system or storage subsystem. This value is informational only. It is not needed for restore.</p>" ], [ "MEDIA", "VARCHAR2(65)", "<p>Name of the media on which the copy resides. This value is informational only. It is not needed for restore.</p>" ], [ "MEDIA_POOL", "NUMBER", "<p>Media pool in which the copy resides. This is the same value that was entered in the <code>POOL</code> operand of the Recovery Manager <code>BACKUP</code> command</p>" ], [ "TAG", "VARCHAR2(32)", "<p>Proxy copy tag</p>" ], [ "STATUS", "VARCHAR2(1)", "<p>Status of the backup set:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>A</code> - Available</p>\n</li>\n<li>\n<p><code>U</code> - Unavailable</p>\n</li>\n<li>\n<p><code>X</code> - Expired</p>\n</li>\n<li>\n<p><code>D</code> - Deleted</p>\n</li>\n</ul>" ], [ "DELETED", "VARCHAR2(3)", "<p>Indicates whether this record has been deleted (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "FILE#", "NUMBER", "<p>Absolute datafile number, or 0 if this is a control file backup</p>" ], [ "CREATION_CHANGE#", "NUMBER", "<p>Datafile creation change number</p>" ], [ "CREATION_TIME", "DATE", "<p>Datafile creation Timestamp</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p>Resetlogs change number of the datafile when the copy was made</p>" ], [ "RESETLOGS_TIME", "DATE", "<p>Resetlogs timestamp of the datafile when the copy was made</p>" ], [ "CHECKPOINT_CHANGE#", "NUMBER", "<p>Checkpoint change number of the datafile when the copy was made</p>" ], [ "CHECKPOINT_TIME", "DATE", "<p>Checkpoint timestamp of the datafile when the copy was made</p>" ], [ "ABSOLUTE_FUZZY_CHANGE#", "NUMBER", "<p>Highest change in any block of the file, if known</p>" ], [ "RECOVERY_FUZZY_CHANGE#", "NUMBER", "<p>Highest change written to the file by media recovery</p>" ], [ "RECOVERY_FUZZY_TIME", "DATE", "<p>Timestamp of the highest change written to the file by media recovery</p>" ], [ "INCREMENTAL_LEVEL", "NUMBER", "<p>If this backup is part of an incremental backup strategy, then 0. Otherwise null.</p>" ], [ "ONLINE_FUZZY", "VARCHAR2(3)", "<p>Indicates whether this copy was made after a crash or offline immediate (or is a copy of a copy which was taken improperly while the database was open) (<code>YES</code>) or not (<code>NO</code>). Recovery will need to apply all redo up to the next crash recovery marker to make the file consistent.</p>" ], [ "BACKUP_FUZZY", "VARCHAR2(3)", "<p>Indicates whether this is a copy taken using the <code>BEGIN BACKUP | END BACKUP</code> technique (<code>YES</code>) or not (<code>NO</code>). The <code>BEGIN BACKUP | END BACKUP</code> technique is used internally when proxy copies of open files are created. Recovery will need to apply all redo up to the end backup marker to make this copy consistent.</p>" ], [ "BLOCKS", "NUMBER", "<p>Size of the copy (in blocks). Also the size of the datafile when the copy was made.</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Block size of the datafile</p>" ], [ "OLDEST_OFFLINE_RANGE", "NUMBER", "<p>If the file number is <code>0</code> (that is, this is a control file backup), the RECID of the oldest offline range record in this control file copy. <code>0</code> for datafile copies.</p>" ], [ "START_TIME", "DATE", "<p>Starting time</p>" ], [ "COMPLETION_TIME", "DATE", "<p>Completion time</p>" ], [ "ELAPSED_SECONDS", "NUMBER", "<p>Number of elapsed seconds</p>" ], [ "CONTROLFILE_TYPE", "VARCHAR2(1)", "<p>Type of control file:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>B</code> - Normal control file</p>\n</li>\n<li>\n<p><code>S</code> - Standby control file</p>\n</li>\n</ul>" ], [ "KEEP", "VARCHAR2(3)", "<p>Indicates whether this backup set has a retention policy that is different than the value for the configure retention policy (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "KEEP_UNTIL", "DATE", "<p>If specified, then this is the date after which the backup becomes obsolete. If this column is NULL, then the backup never expires.</p>" ], [ "KEEP_OPTIONS", "VARCHAR2(11)", "<p>Additional retention options for this backup set:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>LOGS</code> - Indicates a long-term backup made with the <code>LOGS</code> keyword, which is now deprecated</p>\n</li>\n<li>\n<p><code>BACKUP_LOGS</code> - Indicates that the backup was made in open mode, so archived log backups must be applied to make it consistent</p>\n</li>\n<li>\n<p><code>NOLOGS</code> - Indicates a consistent backup made when the database was mounted.</p>\n</li>\n<li>\n<p>NULL - Indicates that this backup has no <code>KEEP</code> options and becomes obsolete based on the retention policy</p>\n</li>\n</ul>" ], [ "RMAN_STATUS_RECID", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> record ID</p>" ], [ "RMAN_STATUS_STAMP", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> stamp</p>" ], [ "FOREIGN_DBID", "NUMBER", "<p>Foreign DBID of the database from which this datafile was transported. The value is <code>0</code> if the file backed up is not a foreign database file.</p>" ], [ "PLUGGED_READONLY", "VARCHAR2(3)", "<p>Indicates whether this is a proxy copy of a transported read-only foreign file (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "PLUGIN_CHANGE#", "NUMBER", "<p>SCN at which the foreign datafile was transported into the database. The value is <code>0</code> if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_CHANGE#", "NUMBER", "<p>SCN of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is <code>0</code> if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_TIME", "DATE", "<p>Time of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is <code>0</code> if this file is not a foreign database file.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "BACKED_BY_PDB", "VARCHAR2(3)", "<p>Recovery Manager (RMAN) allows a PDB to be backed up in two ways. The value in this column indicates how the PDB backup was taken:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: The backup was taken when connected to the PDB</p>\n</li>\n<li>\n<p><code>NO</code>: The backup was taken when connected to the root container</p>\n</li>\n</ul>" ] ]