[ [ "STATISTIC", "VARCHAR2(30)", "<p>Name of the statistic:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Servers In Use</code> - Number of PX servers currently performing parallel operations</p>\n</li>\n<li>\n<p><code>Servers Available</code> - Number of PX servers available to perform parallel operations</p>\n</li>\n<li>\n<p><code>Servers Started</code> - Number of times the system has had to create a PX server process</p>\n</li>\n<li>\n<p><code>Servers Shutdown</code> - Number of times a PX server process has been shut down. A PX server process will be shut down if it has not been used recently.</p>\n<p>If this value is large, then consider increasing the parameter. This will improve performance by avoiding the latency of PX server process creation.</p>\n</li>\n<li>\n<p><code>Servers HWM</code> - Maximum number of concurrent PX server processes</p>\n<p>If this number is equal to the <code>PARALLEL_MAX_SERVERS</code> initialization parameter, then consider increasing the parameter. This could allow you to increase your throughput, especially if your system is under-utilized and the <code>V$SYSSTAT</code> statistic \"Parallel operations downgraded to serial\" is large.</p>\n</li>\n<li>\n<p><code>Servers Cleaned Up</code> - Number of times PMON had to clean up a PX server. This should only happen during abnormal termination of a parallel operation.</p>\n<p>If this number is large, then you should determine the cause.</p>\n</li>\n<li>\n<p>Server Sessions - Total number of sessions created by all PX servers</p>\n</li>\n<li>\n<p><code>Memory Chunks Allocated</code> - Number of large memory chunks allocated by PX servers</p>\n</li>\n<li>\n<p><code>Memory Chunks Freed</code> - Number of large memory chunks freed</p>\n</li>\n<li>\n<p><code>Memory Chunks Current</code> - Number of large memory chunks currently being used</p>\n</li>\n<li>\n<p><code>Memory Chunks HWM</code> - Maximum number of concurrently allocated chunks</p>\n</li>\n<li>\n<p><code>Buffers allocated</code> - Number of times a message buffer has been allocated</p>\n</li>\n<li>\n<p><code>Buffers freed</code> - Number of times a message buffer has been freed</p>\n</li>\n<li>\n<p><code>Buffers Current</code> - Number of message buffers currently being used</p>\n</li>\n<li>\n<p><code>Buffers HWM</code> - Maximum number of concurrently allocated message buffers</p>\n</li>\n</ul>" ], [ "VALUE", "NUMBER", "<p>Value of the statistic</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]