[ [ "SEQUENCE#", "NUMBER", "<p>A sequential counter that uniquely describes a row. When the instance is restarted, this value is reset to zero.</p>" ], [ "ID", "NUMBER", "<p>Resource plan ID; NULL if the Resource Manager was disabled</p>" ], [ "NAME", "VARCHAR2(30)", "<p>Resource plan name; NULL if the Resource Manager was disabled</p>" ], [ "START_TIME", "DATE", "<p>Time that the resource plan was enabled</p>" ], [ "END_TIME", "DATE", "<p>Time that the resource plan was disabled; NULL if the row contains the current resource plan information</p>" ], [ "ENABLED_BY_SCHEDULER", "VARCHAR2(5)", "<p>Indicates whether the plan was enabled by a Job Scheduler window (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "WINDOW_NAME", "VARCHAR2(128)", "<p>Job Scheduler window that triggered the resource plan event; NULL if a user triggered the resource plan event</p>" ], [ "ALLOWED_AUTOMATED_SWITCHES", "VARCHAR2(5)", "<p>Indicates whether automated plan switches were allowed after this resource plan event (<code>TRUE</code>) or whether automated plan switches were disabled after this resource plan event (<code>FALSE</code>)</p>\n<p><span class=\"bold\">See Also:</span> the <code>SWITCH_PLAN</code> procedure</p>" ], [ "CPU_MANAGED", "VARCHAR2(3)", "<p>Indicates whether the resource plan has parameters that specify a policy for how the Resource Manager should schedule sessions to manage CPU usage (<code>ON</code>) or whether Resource Manager is not managing CPU usage (<code>OFF</code>)</p>" ], [ "INSTANCE_CAGING", "VARCHAR2(3)", "<p>Indicates whether instance caging is enabled (<code>ON</code>) or disabled (<code>OFF</code>). Instance caging is enabled if the <code>CPU_COUNT</code> initialization parameter is explicitly modified to a value other than <code>0</code> and Resource Manager is enabled.</p>" ], [ "PARALLEL_EXECUTION_MANAGED", "VARCHAR2(32)", "<p>State of parallel statement queuing:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>OFF</code> - Parallel statement queuing is disabled</p>\n</li>\n<li>\n<p><code>STARTUP</code> - Parallel statement queuing is enabled. This is a temporary state that can occur when an Oracle RAC database is undergoing configuration changes</p>\n</li>\n<li>\n<p><code>FIFO</code> - Parallel statement queuing is enabled. All parallel statements are managed in a single Oracle RAC FIFO queue</p>\n</li>\n<li>\n<p><code>FULL</code> - Parallel statement queuing is enabled. All parallel statements are managed in per-consumer group queues according to the current resource plan. This state is used when a resource plan that contains resource allocation directives (<code>MGMT_P*</code>) is enabled.</p>\n</li>\n<li>\n<p><code>DISABLED</code> - Parallel statement queuing is disabled. This state can occur when memory is unavailable for use by parallel statement queuing in the System Global Area (SGA). Restart the Oracle instance to re-enable parallel statement queuing.</p>\n</li>\n</ul>\n<p>For an Oracle RAC database, only the instance running as master Database Resource Manager (DBRM) shows the correct state of parallel statement queuing. All other instances default to the value <code>FULL</code>. A single instance database always shows the correct value for this field.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]