[ [ "ID", "NUMBER", "<p>Resource plan ID (a unique number, consistent across database shutdowns and startups). This is also the data dictionary object ID.</p>" ], [ "NAME", "VARCHAR2(32)", "<p>Name of the resource plan</p>" ], [ "IS_TOP_PLAN", "VARCHAR2(5)", "<p>Indicates whether the resource plan is the current top plan (<code>TRUE</code>) or whether the resource plan is a subplan of the current top plan (<code>FALSE</code>)</p>" ], [ "CPU_MANAGED", "VARCHAR2(3)", "<p>Indicates whether the resource plan has parameters that specify a policy for how the Resource Manager should schedule sessions to manage CPU usage (<code>ON</code>) or whether Resource Manager is not managing CPU usage (<code>OFF</code>)</p>" ], [ "INSTANCE_CAGING", "VARCHAR2(3)", "<p>Indicates whether instance caging is enabled (<code>ON</code>) or disabled (<code>OFF</code>). Instance caging is enabled if the <code>CPU_COUNT</code> initialization parameter is explicitly modified to a value other than <code>0</code> and Resource Manager is enabled.</p>" ], [ "PARALLEL_SERVERS_ACTIVE", "NUMBER", "<p>Total number of active parallel servers on the instance</p>" ], [ "PARALLEL_SERVERS_TOTAL", "NUMBER", "<p>The value of <code>PARALLEL_SERVERS_TARGET</code> for the instance. Parallel statements are queued if the total number of active parallel servers exceeds this value.</p>" ], [ "PARALLEL_EXECUTION_MANAGED", "VARCHAR2(32)", "<p>State of parallel statement queuing:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>OFF</code> - Parallel statement queuing is disabled</p>\n</li>\n<li>\n<p><code>STARTUP</code> - Parallel statement queuing is enabled. This is a temporary state that can occur when an Oracle RAC database is undergoing configuration changes</p>\n</li>\n<li>\n<p><code>FIFO</code> - Parallel statement queuing is enabled. All parallel statements are managed in a single Oracle RAC FIFO queue</p>\n</li>\n<li>\n<p><code>FULL</code> - Parallel statement queuing is enabled. All parallel statements are managed in per-consumer group queues according to the current resource plan. This state is used when a resource plan that contains resource allocation directives (<code>MGMT_P*</code>) is enabled.</p>\n</li>\n<li>\n<p><code>DISABLED</code> - Parallel statement queuing is disabled. This state can occur when memory is unavailable for use by parallel statement queuing in the System Global Area (SGA). Restart the Oracle instance to re-enable parallel statement queuing.</p>\n</li>\n</ul>\n<p>For an Oracle RAC database, only the instance running as master Database Resource Manager (DBRM) shows the correct state of parallel statement queuing. All other instances default to the value <code>FULL</code>. A single instance database always shows the correct value for this field.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "DIRECTIVE_TYPE", "VARCHAR2(32)", "<p>The type of directive used by this PDB:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>DEFAULT_DIRECTIVE</code>: The default plan directive</p>\n</li>\n<li>\n<p><code>PDB</code>: A PDB directive</p>\n</li>\n<li>\n<p><code>PROFILE</code>: A profile directive</p>\n</li>\n</ul>" ], [ "SHARES", "NUMBER", "<p>Resource allocation for this PDB, expressed in shares</p>" ], [ "UTILIZATION_LIMIT", "NUMBER", "<p>Maximum resource utilization allowed for this PDB, expressed in percentage</p>" ], [ "PARALLEL_SERVER_LIMIT", "NUMBER", "<p>Maximum percentage of the parallel target the PDB can use before queuing subsequent parallel queries</p>" ], [ "MEMORY_MIN", "NUMBER", "<p>Minimum memory guaranteed for this PDB, expressed in a percentage</p>" ], [ "MEMORY_LIMIT", "NUMBER", "<p>Maximum memory allowed for this PDB, expressed in a percentage</p>" ], [ "PROFILE", "VARCHAR2(32)", "<p>The value of the <code>DB_PERFORMANCE_PROFILE</code> initialization parameter for this PDB</p>" ] ]