[ [ "PDB_NAME", "VARCHAR2(32)", "<p>PDB name</p>" ], [ "CPU_WAIT_TIME", "NUMBER", "<p>Cumulative amount of time that sessions waited for CPU because of resource management. This does not include waits due to latch or enqueue contention, I/O waits, and so on. When CPU resources are not being actively managed, this value is set to zero.</p>" ], [ "CPU_WAITS", "NUMBER", "<p>Cumulative number of times all sessions in the consumer group had to wait for CPU because of resource management. This does not include waits due to latch or enqueue contention, I/O waits, and so on. When CPU resources are not being actively managed, this value is set to zero.</p>" ], [ "CONSUMED_CPU_TIME", "NUMBER", "<p>Cumulative amount of CPU time consumed by all sessions in the consumer group (in milliseconds)</p>" ], [ "YIELDS", "NUMBER", "<p>Cumulative number of times that sessions in the consumer group had to yield CPU to other sessions because of quantum expiration. When CPU resources are not being actively managed, this value is set to zero.</p>" ], [ "IO_SERVICE_TIME", "NUMBER", "<p>Cumulative I/O wait time (in milliseconds)</p>" ], [ "IO_SERVICE_WAITS", "NUMBER", "<p>Total number of wait requests</p>" ], [ "SMALL_READ_MEGABYTES", "NUMBER", "<p>Number of single block megabytes read</p>" ], [ "SMALL_WRITE_MEGABYTES", "NUMBER", "<p>Number of single block megabytes written</p>" ], [ "LARGE_READ_MEGABYTES", "NUMBER", "<p>Number of multiblock megabytes read</p>" ], [ "LARGE_WRITE_MEGABYTES", "NUMBER", "<p>Number of multiblock megabytes written</p>" ], [ "SMALL_READ_REQUESTS", "NUMBER", "<p>Number of single block read requests</p>" ], [ "SMALL_WRITE_REQUESTS", "NUMBER", "<p>Number of single block write requests</p>" ], [ "LARGE_READ_REQUESTS", "NUMBER", "<p>Number of multiblock read requests</p>" ], [ "LARGE_WRITE_REQUESTS", "NUMBER", "<p>Number of multiblock write requests</p>" ], [ "PQS_COMPLETED", "NUMBER", "<p>Total number of completed parallel statements in the consumer group</p>" ], [ "PQ_SERVERS_USED", "NUMBER", "<p>Total number of parallel servers used by completed parallel statements in the consumer group</p>" ], [ "PQS_QUEUED", "NUMBER", "<p>Number of times that sessions in the consumer group were queued when trying to run parallel statements</p>" ], [ "PQ_ACTIVE_TIME", "NUMBER", "<p>Cumulative sum of the parallel active times for all completed parallel statements in the consumer group (in milliseconds)</p>" ], [ "PQ_QUEUED_TIME", "NUMBER", "<p>Total amount of time that sessions in the consumer group were queued when trying to run parallel statements (in milliseconds)</p>" ], [ "PQ_QUEUE_TIME_OUTS", "NUMBER", "<p>Number of times that parallel statements from sessions in the consumer group timed out because their queue time exceeded the Resource Manager plan's <code>PARALLEL_QUEUE_TIMEOUT</code> limit</p>" ], [ "CURRENT_PQS_ACTIVE", "NUMBER", "<p>Number of active parallel statements in the consumer group. This value does not include parallel statements that are never queued, such as GV$ queries.</p>" ], [ "CURRENT_PQ_SERVERS_ACTIVE", "NUMBER", "<p>Number of active parallel servers in the consumer group. This value does not include servers running parallel statements that are never queued, such as GV$ queries.</p>" ], [ "CURRENT_PQS_QUEUED", "NUMBER", "<p>Number of sessions in the consumer group that are waiting in the parallel statement queue trying to run parallel statements</p>" ], [ "SGA_BYTES", "NUMBER", "<p>The current SGA usage by this PDB in bytes</p>" ], [ "BUFFER_CACHE_BYTES", "NUMBER", "<p>The current usage of buffer cache by this PDB in bytes</p>" ], [ "SHARED_POOL_BYTES", "NUMBER", "<p>The current usage of shared pool by this PDB in bytes</p>" ], [ "PGA_BYTES", "NUMBER", "<p>The current usage of PGA by this PDB in bytes</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]