[ [ "MAXIMUM_CONNECTIONS", "NUMBER", "<p>Highest number of virtual circuits in use at one time since the instance started. If this value reaches the value set for the <code>CIRCUITS</code> initialization parameter, then consider raising the value of <code>CIRCUITS</code>.</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"CIRCUITS.htm#GUID-42609209-8776-40CB-BB8E-A3D8B292B00D\">CIRCUITS</a>\"</span></p>" ], [ "MAXIMUM_SESSIONS", "NUMBER", "<p>Highest number of shared server sessions in use at one time since the instance started. If this reaches the value set for the <code>SHARED_SERVER_SESSIONS</code> initialization parameter, then consider raising the value of <code>SHARED_SERVER_SESSIONS</code>.</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"SHARED_SERVER_SESSIONS.htm#GUID-585AE4CF-2310-47E0-A8D9-DDECBDE4EF53\">SHARED_SERVER_SESSIONS</a>\"</span></p>" ], [ "SERVERS_STARTED", "NUMBER", "<p>Total number of shared servers started since the instance started (but not including those started during startup)</p>" ], [ "SERVERS_TERMINATED", "NUMBER", "<p>Total number of shared servers stopped by Oracle since the instance started</p>" ], [ "SERVERS_HIGHWATER", "NUMBER", "<p>Highest number of servers running at one time since the instance started. If this value reaches the value set for the <code>MAX_SHARED_SERVERS</code> initialization parameter, then consider raising the value of <code>SHARED_SERVERS</code>.</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"SHARED_SERVERS.htm#GUID-F72C5E13-5264-499A-B5AE-DC9EAE92AFD3\">SHARED_SERVERS</a>\"</span></p>" ], [ "DISPATCHERS_CPU", "NUMBER", "<p>Total CPU time of all dispatchers since the instance started (in millionths of a second)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]