[ [ "SQL_TEXT", "VARCHAR2(1000)", "<p>SQL text of the shared cursor child object for which this row is displaying information</p>" ], [ "SQL_FULLTEXT", "CLOB", "<p>Full text for the SQL statement exposed as a <code>CLOB</code> column. The full text of a SQL statement can be retrieved using this column instead of joining with the <code>V$SQLTEXT</code> dynamic performance view.</p>" ], [ "HASH_VALUE", "NUMBER", "<p>Hash value of the above SQL text in the shared pool</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the above SQL text in the shared pool</p>" ], [ "HEAP_DESC", "RAW(4 | 8)", "<p>Address of the descriptor for the context heap of the child cursor described in this row</p>" ], [ "STRUCTURE", "VARCHAR2(16)", "<p>If the memory chunk described in this row was allocated using a comment of the form \"X : Y\", then this is the \"X\" part of the comment</p>" ], [ "FUNCTION", "VARCHAR2(16)", "<p>Similar to the <code>STRUCTURE</code> column, this is the \"Y\" field of the comment</p>" ], [ "CHUNK_COM", "VARCHAR2(16)", "<p>Whole comment field that was supplied when this memory chunk was allocated</p>" ], [ "CHUNK_PTR", "RAW(4 | 8)", "<p>Starting address of the allocated memory chunk</p>" ], [ "CHUNK_SIZE", "NUMBER", "<p>Amount of memory allocated for this chunk</p>" ], [ "ALLOC_CLASS", "VARCHAR2(8)", "<p>Class of memory that this chunk of memory belongs to. It will usually be either <code>FREEABLE</code> or <code>PERMANENT</code>.</p>" ], [ "CHUNK_TYPE", "NUMBER", "<p>An index into a table of callback functions that tell the server how to re-create this chunk of memory should it need to be removed from the shared pool based on an LRU algorithm</p>" ], [ "SUBHEAP_DESC", "RAW(4 | 8)", "<p>If the parent heap of this context heap is itself a subheap, then this is the address of the descriptor of the parent heap</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]