[ [ "ADDRESS", "RAW(4 | 8)", "<p>Address of the parent cursor handle</p>" ], [ "HASH_VALUE", "NUMBER", "<p>Hash value of the parent statement in the library cache. Two columns <code>PARENT_HANDLE</code> and <code>HASH_VALUE</code> can be used to join with <code>V$SQLAREA</code> to locate the parent cursor.</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the parent statement in the library cache</p>" ], [ "CHILD_NUMBER", "NUMBER", "<p>Number of the child cursor that uses this work area. The columns <code>PARENT_HANDLE</code>, <code>HASH_VALUE</code>, and <code>CHILD_NUMBER</code> can be used to join with <code>V$SQL</code> to locate the child cursor using this area.</p>" ], [ "WORKAREA_ADDRESS", "RAW(4 | 8)", "<p>Address of the work area handle. This is the primary key for the view.</p>" ], [ "OPERATION_TYPE", "VARCHAR2(40)", "<p>Type of operation using the work area. Can include values such as <code>SORT</code>, <code>HASH JOIN</code>, <code>GROUP BY</code>, <code>BUFFER</code>, <code>BITMAP MERGE</code>, and <code>BITMAP CONSTRUCTION</code>.</p>" ], [ "OPERATION_ID", "NUMBER", "<p>A unique number used to identify the operation in the execution plan. This identifier can be joined to <code>V$SQL_PLAN</code> to locate the operation that uses this work area.</p>" ], [ "POLICY", "VARCHAR2(10)", "<p>Sizing policy for this work area (<code>MANUAL</code> or <code>AUTO</code>)</p>" ], [ "ESTIMATED_OPTIMAL_SIZE", "NUMBER", "<p>Estimated size (in bytes) required by this work area to execute the operation completely in memory (optimal execution). Derived from either optimizer statistics or previous executions.</p>" ], [ "ESTIMATED_ONEPASS_SIZE", "NUMBER", "<p>Estimated size (in bytes) required by this work area to execute the operation in a single pass. Derived from either optimizer statistics or previous executions.</p>" ], [ "LAST_MEMORY_USED", "NUMBER", "<p>Memory (in bytes) used by this work area during the last execution of the cursor</p>" ], [ "LAST_EXECUTION", "VARCHAR2(10)", "<p>Indicates whether this work area runs using <code>OPTIMAL, ONE PASS</code>, or <code>ONE PASS</code> memory requirement (or <code>MULTI-PASS</code>), during the last execution of the cursor</p>" ], [ "LAST_DEGREE", "NUMBER", "<p>Degree of parallelism used during the last execution of this operation</p>" ], [ "TOTAL_EXECUTIONS", "NUMBER", "<p>Number of times this work area was active</p>" ], [ "OPTIMAL_EXECUTIONS", "NUMBER", "<p>Number of times this work area ran in optimal mode</p>" ], [ "ONEPASS_EXECUTIONS", "NUMBER", "<p>Number of times this work area ran in one-pass mode</p>" ], [ "MULTIPASSES_EXECUTIONS", "NUMBER", "<p>Number of times this work area ran below the one-pass memory requirement</p>" ], [ "ACTIVE_TIME", "NUMBER", "<p>Average time this work area is active (in hundredths of a second)</p>" ], [ "MAX_TEMPSEG_SIZE", "NUMBER", "<p>Maximum temporary segment size (in bytes) created by an instantiation of this work area. This column is NULL if this work area has never spilled to disk.</p>" ], [ "LAST_TEMPSEG_SIZE", "NUMBER", "<p>Temporary segment size (in bytes) created in the last instantiation of this work area. This column is NULL if the last instantiation of this work area did not spill to disk.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]