[ [ "ADDRESS", "RAW(4 | 8)", "<p>Address of the handle to the parent for this cursor</p>" ], [ "HASH_VALUE", "NUMBER", "<p>Hash value of the parent statement in the library cache. The two columns <code>ADDRESS</code> and <code>HASH_VALUE</code> can be used to join with <code>V$SQLAREA</code> to locate the parent cursor.</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the parent statement in the library cache</p>" ], [ "PLAN_HASH_VALUE", "NUMBER", "<p>Numerical representation of the current SQL plan for this cursor. Comparing one <code>PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line)</p>" ], [ "FULL_PLAN_HASH_VALUE", "NUMBER", "<p>Numeric representation of the complete SQL plan for this cursor. Comparing one <code>FULL_PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line). Note that the <code>FULL_PLAN_HASH_VALUE</code> cannot be compared across databases releases. It is not backward compatible.</p>" ], [ "CHILD_ADDRESS", "RAW(4 | 8)", "<p>Address of the child cursor</p>" ], [ "CHILD_NUMBER", "NUMBER", "<p>Number of the child cursor that uses this work area. The columns <code>ADDRESS</code>, <code>HASH_VALUE</code>, and <code>CHILD_NUMBER</code> can be used to join with <code>V$SQL</code> to locate the child cursor using this area.</p>" ], [ "OPERATION_ID", "NUMBER", "<p>A number assigned to each step in the execution plan</p>" ], [ "EXECUTIONS", "NUMBER", "<p>Number of times this cursor has been executed</p>" ], [ "LAST_STARTS", "NUMBER", "<p>Number of times this operation has been started, during the last execution</p>" ], [ "STARTS", "NUMBER", "<p>Number of times this operation has been started, accumulated over the past executions</p>" ], [ "LAST_OUTPUT_ROWS", "NUMBER", "<p>Number of rows produced by the row source, during the last execution</p>" ], [ "OUTPUT_ROWS", "NUMBER", "<p>Number of rows produced by the row source, accumulated over the past executions</p>" ], [ "LAST_CR_BUFFER_GETS", "NUMBER", "<p>Number of buffers retrieved in consistent mode, during the last execution. Buffers are usually retrieved in consistent mode for queries.</p>" ], [ "CR_BUFFER_GETS", "NUMBER", "<p>Number of buffers retrieved in consistent mode, accumulated over the past executions. Buffers are usually retrieved in consistent mode for queries.</p>" ], [ "LAST_CU_BUFFER_GETS", "NUMBER", "<p>Number of buffers retrieved in current mode, during the last execution. Buffers are retrieved in current mode for statements such as <code>INSERT</code>, <code>UPDATE</code>, and <code>DELETE</code>.</p>" ], [ "CU_BUFFER_GETS", "NUMBER", "<p>Number of buffers retrieved in current mode, accumulated over the past executions. Buffers are retrieved in current mode for statements such as <code>INSERT</code>, <code>UPDATE</code>, and <code>DELETE</code>.</p>" ], [ "LAST_DISK_READS", "NUMBER", "<p>Number of physical disk reads performed by the operation, during the last execution</p>" ], [ "DISK_READS", "NUMBER", "<p>Number of physical disk reads performed by the operation, accumulated over the past executions</p>" ], [ "LAST_DISK_WRITES", "NUMBER", "<p>Number of physical disk writes performed by the operation, during the last execution</p>" ], [ "DISK_WRITES", "NUMBER", "<p>Number of physical disk writes performed by the operation, accumulated over the past executions</p>" ], [ "LAST_ELAPSED_TIME", "NUMBER", "<p>Elapsed time (in microseconds) corresponding to this operation, during the last execution</p>" ], [ "ELAPSED_TIME", "NUMBER", "<p>Elapsed time (in microseconds) corresponding to this operation, accumulated over the past executions</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]