[ [ "ADDRESS", "RAW(4 | 8)", "<p>Address of the parent cursor</p>" ], [ "HASH_VALUE", "NUMBER", "<p>Hash value of the parent cursor in the library cache. The hash value is a fixed index for the view and should always be used to speed up access to the view.</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the parent cursor in the library cache</p>" ], [ "CHILD_ADDRESS", "RAW(4 | 8)", "<p>Address of the child cursor</p>" ], [ "CHILD_NUMBER", "NUMBER", "<p>Child cursor number</p>" ], [ "NAME", "VARCHAR2(30)", "<p>Name of the bind variable</p>" ], [ "POSITION", "NUMBER", "<p>Position of the bind variable in the SQL statement</p>" ], [ "DUP_POSITION", "NUMBER", "<p>If the binding is performed by name and the bind variable is duplicated, then this column gives the position of the primary bind variable.</p>" ], [ "DATATYPE", "NUMBER", "<p>Internal identifier for the bind data type. Beginning in Oracle Database 12<span class=\"italic\">c</span>, a number representing a PL/SQL data type can appear in this column.</p>" ], [ "DATATYPE_STRING", "VARCHAR2(15)", "<p>Textual representation of the bind data type. Beginning in Oracle Database 12<span class=\"italic\">c</span>, a text representation of a PL/SQL-only data type can appear in this column. If the actual data type is a PL/SQL sub type, the name of the data type, not the sub type will be displayed.</p>" ], [ "CHARACTER_SID", "NUMBER", "<p>National character set identifier</p>" ], [ "PRECISION", "NUMBER", "<p>Precision (for numeric binds)</p>" ], [ "SCALE", "NUMBER", "<p>Scale (for numeric binds)</p>" ], [ "MAX_LENGTH", "NUMBER", "<p>Maximum bind length</p>" ], [ "WAS_CAPTURED", "VARCHAR2(3)", "<p>Indicates whether the bind value was captured (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "LAST_CAPTURED", "DATE", "<p>Date when the bind value was captured. Bind values are captured when SQL statements are executed. To limit the overhead, binds are captured at most every 15 minutes for a given cursor.</p>" ], [ "VALUE_STRING", "VARCHAR2(4000)", "<p>Value of the bind represented as a string</p>" ], [ "VALUE_ANYDATA", "ANYDATA", "<p>Value of the bind represented using the <code>ANYDATA</code> data type. This representation is useful to programmatically decode the value of the bind variable. This column is NULL if a PL/SQL-only data type appears in the <code>DATATYPE</code> column.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]