[ [ "STREAMS_NAME", "VARCHAR2(30)", "<p>Name of the Streams process</p>" ], [ "STREAMS_TYPE", "VARCHAR2(20)", "<p>Type of the Streams process:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CAPTURE</code></p>\n</li>\n<li>\n<p><code>APPLY</code></p>\n</li>\n<li>\n<p><code>PROPAGATION_SENDER</code></p>\n</li>\n</ul>" ], [ "XIDUSN", "NUMBER", "<p>Transaction ID undo segment number of the transaction</p>" ], [ "XIDSLT", "NUMBER", "<p>Transaction ID slot number of the transaction</p>" ], [ "XIDSQN", "NUMBER", "<p>Transaction ID sequence number of the transaction</p>" ], [ "CUMULATIVE_MESSAGE_COUNT", "NUMBER", "<p>Number of LCRs processed in the transaction. If the Streams process is restarted while the transaction is being processed, then this column shows the number of LCRs processed in the transaction since the Streams process was started.</p>" ], [ "TOTAL_MESSAGE_COUNT", "NUMBER", "<p>Total Number of LCRs processed in the transaction by an apply process. This column does not pertain to capture processes.</p>" ], [ "FIRST_MESSAGE_TIME", "DATE", "<p>Timestamp of the first LCR processed in the transaction. If a capture process is restarted while the transaction is being processed, then this column shows the timestamp of the first LCR processed after the capture process was started.</p>" ], [ "FIRST_MESSAGE_NUMBER", "NUMBER", "<p>System change number (SCN) of the first message in the transaction. If a capture process is restarted while the transaction is being processed, then this column shows the SCN of the first message processed after the capture process was started.</p>" ], [ "LAST_MESSAGE_TIME", "DATE", "<p>Timestamp of the last LCR processed in the transaction</p>" ], [ "LAST_MESSAGE_NUMBER", "NUMBER", "<p>SCN of the most recent message encountered for the transaction</p>" ], [ "FIRST_MESSAGE_POSITION", "RAW(64)", "<p>Reserved for internal use</p>" ], [ "LAST_MESSAGE_POSITION", "RAW(64)", "<p>Reserved for internal use</p>" ], [ "TRANSACTION_ID", "VARCHAR2(128)", "<p>Transaction ID</p>" ], [ "PURPOSE", "CHAR(7)", "<p>Purpose of the components that are processing the transaction:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Streams</code> - The transaction is being processed in an Oracle Streams configuration</p>\n</li>\n</ul>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]