[ [ "SID", "NUMBER", "<p>Session ID of the outbound server's session</p>" ], [ "SERIAL#", "NUMBER", "<p>Serial number of the outbound server's session</p>" ], [ "SPID", "VARCHAR2(12)", "<p>Process identification number of the operating-system process that sends LCRs to the client application</p>" ], [ "SERVER_NAME", "VARCHAR2(128)", "<p>Name of the outbound server</p>" ], [ "STARTUP_TIME", "DATE", "<p>Time when the client application attached to the outbound server</p>" ], [ "STATE", "VARCHAR2(19)", "<p>State of the outbound server</p>\n<p>When the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>, the following states are possible:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code> - Starting up the outbound server.</p>\n</li>\n<li>\n<p><code>IDLE</code> - Performing no work because there are no LCRs to send to the XStream client application.</p>\n</li>\n<li>\n<p><code>GET</code> <code>TRANSACTIONS</code> - Receiving transactions from the outbound server's apply coordinator.</p>\n</li>\n<li>\n<p><code>SEND</code> <code>TRANSACTION</code> - Sending a transaction to an XStream client application.</p>\n</li>\n<li>\n<p><code>WAIT</code> <code>FOR</code> <code>NEXT</code> <code>CHUNK</code> - Waiting for the next set of LCRs for a large transaction.</p>\n</li>\n<li>\n<p><code>TRANSACTION</code> <code>CLEANUP</code> - Cleaning up an applied transaction, which includes removing LCRs from the outbound server's queue.</p>\n</li>\n<li>\n<p><code>WAIT</code> <code>FOR</code> <code>CLIENT</code> - Waiting for an XStream client application to request more LCRs.</p>\n</li>\n</ul>\n<p>When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, the following states are possible:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code> - Starting up the outbound server.</p>\n</li>\n<li>\n<p><code>INITIALIZING</code> <code>RULE</code> <code>EVALUATION</code> <code>CONTEXT</code> - Initializing the context to evaluate the outbound server's rules.</p>\n</li>\n<li>\n<p><code>IDLE</code> - Performing no work because there is no LCR to send to the XStream client application.</p>\n</li>\n<li>\n<p><code>BROWSING</code> <code>LCR</code> - Browsing the outbound server's queue for next LCR.</p>\n</li>\n<li>\n<p><code>EVALUATING</code> <code>RULES</code> - Evaluating an LCR against a rule set.</p>\n</li>\n<li>\n<p><code>DEQUEUING</code> <code>LCR</code> - Dequeuing an LCR from the outbound server's queue.</p>\n</li>\n<li>\n<p><code>SENDING</code> <code>LCR</code> - Sending an LCR to an XStream client application.</p>\n</li>\n<li>\n<p><code>WAITING</code> <code>FOR</code> <code>CAPTURE</code> <code>TO</code> <code>TERMINATE</code> - Waiting for the capture process to become disabled.</p>\n</li>\n<li>\n<p><code>SUSPENDED</code> <code>DUE</code> <code>TO</code> <code>A</code> <code>DROPPED</code> <code>SUBSCRIBER</code> - Suspended because a connected subscriber was dropped. For example, a subscriber can be dropped during a split or merge operation.</p>\n</li>\n<li>\n<p><code>SUSPENDED</code> <code>FOR</code> <code>AUTO</code> <code>SPLIT</code>/<code>MERGE</code> - Suspended because an automatic split or merge operation is being performed.</p>\n</li>\n<li>\n<p><code>WAITING</code> <code>ON</code> <code>EMPTY</code> <code>QUEUE</code> - Waiting for more LCRs from the capture process.</p>\n</li>\n<li>\n<p><code>WAITING</code> <code>FOR</code> <code>CLIENT</code> - Waiting for the XStream client application to request more LCRs.</p>\n</li>\n<li>\n<p><code>WAITING</code> <code>FOR</code> <code>CAPTURE</code> <code>TO</code> <code>INITIALIZE</code> - Waiting for the capture process to finish the data dictionary build.</p>\n</li>\n<li>\n<p><code>WAITING</code> <code>TO</code> <code>ATTACH</code> <code>TO</code> <code>CAPTURE</code> - Waiting for the outbound server to attach to the capture process.</p>\n</li>\n</ul>\n<p>When a state refers to a capture process, it is the capture process that captures changes for the outbound server. When a state refers to a propagation, it is the outbound server that sends LCRs to the XStream client application.</p>" ], [ "XIDUSN", "NUMBER", "<p>Transaction ID undo segment number of the transaction currently being processed. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "XIDSLT", "NUMBER", "<p>Transaction ID slot number of the transaction currently being processed. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "XIDSQN", "NUMBER", "<p>Transaction ID sequence number of the transaction currently being processed. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "COMMITSCN", "NUMBER", "<p>Commit SCN of the transaction currently being processed. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "TOTAL_TRANSACTIONS_SENT", "NUMBER", "<p>Total number of transactions sent by the outbound server to the XStream client application since the last time the client application attached to the outbound server. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "MESSAGE_SEQUENCE", "NUMBER", "<p>Number of the current LCR being processed by the outbound server. This value is reset to 1 at the beginning of each transaction. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "TOTAL_MESSAGES_SENT", "NUMBER", "<p>Total number of LCRs sent by the outbound server to the XStream client application since the last time the client application attached to the outbound server</p>" ], [ "SEND_TIME", "DATE", "<p>Time the last LCR was sent by the outbound server to the XStream client application</p>" ], [ "LAST_SENT_MESSAGE_NUMBER", "NUMBER", "<p>Message number of the last LCR sent by the outbound server to the XStream client application</p>" ], [ "LAST_SENT_MESSAGE_CREATE_TIME", "DATE", "<p>Creation time at the source database of the last LCR sent by the outbound server to the client application</p>" ], [ "ELAPSED_SEND_TIME", "NUMBER", "<p>Time elapsed (in hundredths of a second) sending LCRs to the XStream client application since the last time the client application attached to the outbound server</p>" ], [ "COMMIT_POSITION", "RAW(64)", "<p>Commit position of the transaction currently being processed. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "LAST_SENT_POSITION", "RAW(64)", "<p>Position of the last LCR sent to the XStream client application. This column is populated only if the <code>COMMITTED_DATA_ONLY</code> column shows <code>YES</code>. When the <code>COMMITTED_DATA_ONLY</code> column shows <code>NO</code>, this column is <code>NULL</code>.</p>" ], [ "BYTES_SENT", "NUMBER", "<p>Total number of bytes sent by the outbound server to the XStream client application since the last time the client application attached to the outbound server</p>" ], [ "COMMITTED_DATA_ONLY", "CHAR(3)", "<p><code>YES</code> if the outbound server can send only LCRs in committed transactions to the XStream client application. A committed transaction is an assembled, noninterleaving transaction with no rollbacks.</p>\n<p><code>NO</code> if the outbound server can send LCRs in transactions that have not yet committed to the XStream client application. This mode is for internal Oracle use only.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]