[ [ "APPLY_NAME", "VARCHAR2(128)", "<p>Name of XStream Out or XStream In process</p>" ], [ "SERVER_ID", "NUMBER", "<p>Parallel apply server slave ID. If the server ID is <code>0</code>, then this is an aggregate of statistics for servers that may have been automatically shutdown due to session inactivity.</p>" ], [ "SOURCE_TABLE_OWNER", "VARCHAR2(128)", "<p>Source owner of the captured or replicated table</p>" ], [ "SOURCE_TABLE_NAME", "VARCHAR2(128)", "<p>Source name of the captured or replicated table</p>" ], [ "DESTINATION_TABLE_OWNER", "VARCHAR2(128)", "<p>Target owner of the captured or replicated table</p>" ], [ "DESTINATION_TABLE_NAME", "VARCHAR2(128)", "<p>Target name of the captured or replicated table</p>" ], [ "LAST_UPDATE", "DATE", "<p>Time of last update</p>" ], [ "TOTAL_INSERTS", "NUMBER", "<p>Number of insert operations on this table processed by this apply server for the current session</p>" ], [ "TOTAL_UPDATES", "NUMBER", "<p>Number of update operations on this table processed by this apply server for the current session</p>" ], [ "TOTAL_DELETES", "NUMBER", "<p>Number of delete operations on this table processed by this apply server for the current session</p>" ], [ "INSERT_COLLISIONS", "NUMBER", "<p>Number of insert collisions on this table encountered by this apply server for the current session</p>" ], [ "UPDATE_COLLISIONS", "NUMBER", "<p>Number of update collisions on this table encountered by this apply server for the current session</p>" ], [ "DELETE_COLLISIONS", "NUMBER", "<p>Number of delete collisions on this table encountered by this apply server for the current session</p>" ], [ "REPERROR_RECORDS", "NUMBER", "<p>Number of change records that were recorded on this table by this apply server for the current session</p>" ], [ "REPERROR_IGNORES", "NUMBER", "<p>Number of ignored change records on this table by this apply server for the current session</p>" ], [ "WAIT_DEPENDENCIES", "NUMBER", "<p>Number of waits for this table due to dependency for the current session</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "CDR_INSERT_ROW_EXISTS", "NUMBER", "<p>Number of conflicts where an insert gets an ORA-00001 error</p>" ], [ "CDR_UPDATE_ROW_EXISTS", "NUMBER", "<p>Number of conflicts where an update gets an ORA-26786 error</p>" ], [ "CDR_UPDATE_ROW_MISSING", "NUMBER", "<p>Number of conflicts where an update gets an ORA-26787 error</p>" ], [ "CDR_DELETE_ROW_EXISTS", "NUMBER", "<p>Number of conflicts where a delete gets an ORA-26786 error</p>" ], [ "CDR_DELETE_ROW_MISSING", "NUMBER", "<p>Number of conflicts where a delete gets an ORA-26787 error</p>" ], [ "CDR_SUCCESSFUL_RESOLUTIONS", "NUMBER", "<p>Number of successfully resolved conflicts</p>" ], [ "CDR_FAILED_RESOLUTIONS", "NUMBER", "<p>Number of conflicts that could not be resolved due to an error during resolution</p>" ], [ "LOB_OPERATIONS", "NUMBER", "<p>The number of LOB updates (LOB writes, LOB trims, and LOB erases) applied by the inbound server.</p>" ] ]