[ [ "SERVICE_ID", "NUMBER", "&nbsp;", "<p>Unique ID for the service</p>" ], [ "NAME", "VARCHAR2(64)", "&nbsp;", "<p>Name describing the workload</p>" ], [ "NAME_HASH", "NUMBER", "&nbsp;", "<p>Hash of the short name for the service</p>" ], [ "NETWORK_NAME", "VARCHAR2(512)", "&nbsp;", "<p>Network name used to connect to the service</p>" ], [ "CREATION_DATE", "DATE", "&nbsp;", "<p>Date the service was created</p>" ], [ "CREATION_DATE_HASH", "NUMBER", "&nbsp;", "<p>Hash of the creation date</p>" ], [ "FAILOVER_METHOD", "VARCHAR2(64)", "&nbsp;", "<p>TAF only for compatibility - <code>BASIC</code> or <code>NONE</code></p>" ], [ "FAILOVER_TYPE", "VARCHAR2(64)", "&nbsp;", "<p>For Application Continuity for Java, <code>TRANSACTION</code>. For TAF, <code>SESSION</code> or <code>SELECT</code>.</p>" ], [ "FAILOVER_RETRIES", "NUMBER(10)", "&nbsp;", "<p>For Application Continuity and TAF, when reconnecting after a failure, number of attempts to re-connect per incident</p>" ], [ "FAILOVER_DELAY", "NUMBER(10)", "&nbsp;", "<p>For Application Continuity and TAF, when reconnecting after a failure, delay between each connection retry (in seconds)</p>" ], [ "MIN_CARDINALITY", "NUMBER", "&nbsp;", "<p>Reserved for internal use</p>" ], [ "MAX_CARDINALITY", "NUMBER", "&nbsp;", "<p>Reserved for internal use</p>" ], [ "GOAL", "VARCHAR2(12)", "&nbsp;", "<p>Runtime Load Balancing Goal being used to create run-time load balancing and connection load balancing advice:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NONE</code></p>\n</li>\n<li>\n<p><code>SERVICE_TIME</code> - Connections are balanced by response time</p>\n</li>\n<li>\n<p><code>THROUGHPUT</code> - Connections are balanced by throughput</p>\n</li>\n</ul>" ], [ "DTP", "VARCHAR2(1)", "&nbsp;", "<p>DTP (distributed transaction processing) enforces all sessions for a service at one instance. This is a requirement for XA before 11<span class=\"italic\">g</span>, and is a requirement if resuming and suspending the same XA branch.</p>" ], [ "ENABLED", "VARCHAR2(3)", "&nbsp;", "<p>Reserved for internal use</p>" ], [ "AQ_HA_NOTIFICATIONS", "VARCHAR2(3)", "&nbsp;", "<p>To enable FAN for OCI connections, set AQ HA Notifications to <code>True</code>. For Oracle Database 12<span class=\"italic\">c</span>, FAN uses ONS (Oracle Notification Service)</p>" ], [ "CLB_GOAL", "VARCHAR2(5)", "&nbsp;", "<p>Connection load balancing goal. When using run-time load balancing, <code>GOAL=SERVICE_TIME</code> or <code>THROUGHPUT</code>, set to <code>SHORT</code>. For a session count per service only, use <code>LONG</code>.</p>" ], [ "EDITION", "VARCHAR2(128)", "&nbsp;", "<p>A non-NULL value specifies the initial session edition for subsequent database connections that use the service and do not specify an edition. A NULL value has no effect.</p>" ], [ "COMMIT_OUTCOME", "VARCHAR2(3)", "&nbsp;", "<p>This attribute is used for Transaction Guard. When <code>COMMIT_OUTCOME</code> is set to <code>TRUE</code>, Transaction Guard manages the commit status for all supported transaction types. The attribute is on a per session basis and is set at connect time.</p>\n<p>When the attribute is enabled:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>The outcome of a COMMIT transaction is known. If there is an outage, the application can use <code>DBMS_APP_CONT.GET_LTXID_OUTCOME</code> to return a reliable status for the last in-flight work.</p>\n</li>\n<li>\n<p>A logical transaction ID (LTXID) is set for each user session at login and at each successful commit.</p>\n</li>\n</ul>\n<p><span class=\"bold\">See Also:</span> For information about preserving the commit outcome, see <a class=\"olink ADFNS338\" target=\"_blank\" href=\"../ADFNS/transaction-guard.htm#ADFNS338\"><span class=\"italic\">Oracle Database Development Guide</span></a>. For information about logical transaction IDs, see <a class=\"olink ADFNS324\" target=\"_blank\" href=\"../ADFNS/transaction-guard.htm#ADFNS324\"><span class=\"italic\">Oracle Database Development Guide</span></a></p>" ], [ "RETENTION_TIMEOUT", "NUMBER", "&nbsp;", "<p>For Transaction Guard (<code>COMMIT_OUTCOME</code> set to <code>TRUE</code>), this parameter determines the amount of time (in seconds) that the commit outcome is retained in the database</p>" ], [ "REPLAY_INITIATION_TIMEOUT", "NUMBER", "&nbsp;", "<p>For Application Continuity, indicates a time period (in seconds) after which the request will not be replayed. The time period starts at the first request submission.</p>\n<p>The default value is 300 seconds, which is 5 minutes.</p>" ], [ "SESSION_STATE_CONSISTENCY", "VARCHAR2(128)", "&nbsp;", "<p>Describes how non-transactional is changed during a request. This parameter is considered only if <code>failover_type</code> is set to <code>TRANSACTION</code> for Application Continuity. Examples of session state are NLS settings, optimizer preferences, event settings, PL/SQL global variables, temporary tables, advanced queues, LOBs and result cache. If non-transactional values change after the request starts, the default value of <code>DYNAMIC</code> should be set. Almost all applications should use <code>DYNAMIC</code> mode. If you are unsure, use <code>DYNAMIC</code> mode.</p>" ], [ "GLOBAL_SERVICE", "VARCHAR2(3)", "&nbsp;", "<p>Indicates whether the service is global. A global service is managed by Global Data Services (GDS) and can be provided by multiple databases that contain replicated data. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: Indicates the service is global</p>\n</li>\n<li>\n<p><code>NO</code>: Indicates the service is not global</p>\n</li>\n</ul>\n<p>This attribute is set when using GDS. It cannot be set by a user.</p>" ], [ "PDB", "VARCHAR2(128)", "&nbsp;", "<p>Name of a PDB associated with a given service. Will contain NULL for a non-CDB or if the service is not associated with a PDB (that is, connecting to a CDB using this service will cause a user to connect to the root.)</p>\n<p>When managing services for a PDB, use SRVCTL for Oracle RAC and Oracle RAC One Node databases, or connect to that PDB if it is a single instance (not RAC). The PDB attribute shows which PDB has the service. It cannot be set or modified explicitly.</p>" ], [ "SQL_TRANSLATION_PROFILE", "VARCHAR2(261)", "&nbsp;", "<p>A non-NULL value specifies the initial SQL translation profile for subsequent database connections that use the service and do not specify a SQL translation profile. A NULL value has no effect.</p>" ], [ "MAX_LAG_TIME", "VARCHAR2(128)", "&nbsp;", "<p>The maximum replication lag (in seconds) that is acceptable for a data replica to be used for providing the database service. Can only be specified for global services using the Global Data Services (GDS) interfaces. It is not supported to change this value at local databases.</p>" ], [ "GSM_FLAGS", "NUMBER", "&nbsp;", "<p>Flags specific to Global Data Services (GDS). Can only be specified for global services using the GDS interfaces. It is not supported to change these values at local databases.</p>" ] ]