[ [ "SCHEDULE_NAME", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>The name of a schedule to be replayed</p>" ], [ "SCHEDULE_CAP_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Identifies a workload capture added to a replay schedule. It starts with <code>1</code>. If the same capture is added multiple times to a schedule, there will be multiple rows with different <code>SCHEDULE_CAP_ID</code> columns and identical <code>CAPTURE_ID</code> columns.</p>" ], [ "CAPTURE_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Points to the capture ID from <code>DBA_WORKLOAD_CAPTURES</code>.</p>" ], [ "CAPTURE_DIR", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Name of the directory object for workload capture</p>" ], [ "OS_SUBDIR", "VARCHAR2(4000)", "<p><code>NOT NULL</code></p>", "<p>Name of the subdirectory under the replay directory for this workload capture</p>" ], [ "MAX_CONCURRENT_SESSIONS", "NUMBER", "&nbsp;", "<p>The maximal number of concurrent sessions that was seen in this workload capture</p>" ], [ "NUM_CLIENTS_ASSIGNED", "NUMBER", "&nbsp;", "<p>Number of clients assigned to this workload capture before replay starts</p>" ], [ "NUM_CLIENTS", "NUMBER", "&nbsp;", "<p>Number of clients that are running for this workload capture during replay</p>" ], [ "NUM_CLIENTS_DONE", "NUMBER", "&nbsp;", "<p>Number of clients that have finished the replay of this workload capture</p>" ], [ "STOP_REPLAY", "VARCHAR2(1)", "<p><code>NOT NULL</code></p>", "<p>Indicates whether the whole replay will stop once the replay of this workload capture is done (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "TAKE_BEGIN_SNAPSHOT", "VARCHAR2(1)", "<p><code>NOT NULL</code></p>", "<p>Indicates whether an AWR snapshot will be taken when the replay of this capture starts (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "TAKE_END_SNAPSHOT", "VARCHAR2(1)", "<p><code>NOT NULL</code></p>", "<p>Indicates whether an AWR snapshot will be taken when the replay of this capture finishes (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "QUERY_ONLY", "VARCHAR2(1)", "<p><code>NOT NULL</code></p>", "<p>Indicates whether only the query-only workload from the current workload capture will be replayed, skipping all the DML/DDL that might update the database (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "START_DELAY_SECS", "NUMBER", "&nbsp;", "<p>Displays the wait time (in seconds) when the replay of a workload capture is ready to start. \"Ready to start\" means the capture does not wait for any other capture, or all the captures for which it should wait have already been replayed. The default value is 0.</p>" ], [ "START_TIME", "DATE", "&nbsp;", "<p>Start time for the replay of this capture</p>" ], [ "END_TIME", "DATE", "&nbsp;", "<p>Finish time for the replay of this capture</p>" ], [ "AWR_DBID", "NUMBER", "&nbsp;", "<p>AWR database ID of the replay</p>" ], [ "AWR_BEGIN_SNAP", "NUMBER", "&nbsp;", "<p>AWR snapshot ID when the replay starts</p>" ], [ "AWR_END_SNAP", "NUMBER", "&nbsp;", "<p>AWR snapshot ID when the replay finishes</p>" ] ]