[ [ "SNAP_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Unique snapshot ID</p>" ], [ "DBID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Database ID for the snapshot</p>" ], [ "INSTANCE_NUMBER", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Instance number for the snapshot</p>" ], [ "JAVA_POOL_SIZE_FOR_ESTIMATE", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Java pool size for the estimate (in megabytes)</p>" ], [ "JAVA_POOL_SIZE_FACTOR", "NUMBER", "&nbsp;", "<p>Size factor with respect to the current Java pool size</p>" ], [ "ESTD_LC_SIZE", "NUMBER", "&nbsp;", "<p>Estimated memory in use by the library cache (in megabytes)</p>" ], [ "ESTD_LC_MEMORY_OBJECTS", "NUMBER", "&nbsp;", "<p>Estimated number of library cache memory objects in the Java pool of the specified size</p>" ], [ "ESTD_LC_TIME_SAVED", "NUMBER", "&nbsp;", "<p>Estimated elapsed parse time saved (in seconds), owing to library cache memory objects being found in a Java pool of the specified size. This is the time that would have been spent in reloading the required objects in the Java pool had they been aged out due to insufficient amount of available free memory.</p>" ], [ "ESTD_LC_TIME_SAVED_FACTOR", "NUMBER", "&nbsp;", "<p>Estimated parse time saved factor with respect to the current Java pool size</p>" ], [ "ESTD_LC_LOAD_TIME", "NUMBER", "&nbsp;", "<p>Estimated elapsed time (in seconds) for parsing in a Java pool of the specified size.</p>" ], [ "ESTD_LC_LOAD_TIME_FACTOR", "NUMBER", "&nbsp;", "<p>Estimated load time factor with respect to the current Java pool size</p>" ], [ "ESTD_LC_MEMORY_OBJECT_HITS", "NUMBER", "&nbsp;", "<p>Estimated number of times a library cache memory object was found in a Java pool of the specified size</p>" ], [ "CON_DBID", "NUMBER", "&nbsp;", "<p>The database ID of the PDB for the sampled session</p>" ], [ "CON_ID", "NUMBER", "&nbsp;", "<p>T.he ID of the container that <code>CON_DBID</code> identifies. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]