[ [ "DBID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Database ID</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p><code>NOT NULL</code></p>", "<p>SQL identifier of the parent cursor in the library cache</p>" ], [ "PLAN_HASH_VALUE", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Numerical representation of the SQL plan for the cursor. Comparing one <code>PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line).</p>" ], [ "ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>A number assigned to each step in the execution plan</p>" ], [ "OPERATION", "VARCHAR2(30)", "&nbsp;", "<p>Name of the internal operation performed in this step (for example, <code>TABLE ACCESS</code>)</p>" ], [ "OPTIONS", "VARCHAR2(30)", "&nbsp;", "<p>A variation on the operation described in the <code>OPERATION</code> column (for example, <code>FULL</code>)</p>" ], [ "OBJECT_NODE", "VARCHAR2(128)", "&nbsp;", "<p>Name of the database link used to reference the object (a table name or view name). For local queries that use parallel execution, this column describes the order in which output from operations is consumed.</p>" ], [ "OBJECT#", "NUMBER", "&nbsp;", "<p>Object number of the table or the index</p>" ], [ "OBJECT_OWNER", "VARCHAR2(128)", "&nbsp;", "<p>Name of the user who owns the schema containing the table or index</p>" ], [ "OBJECT_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the table or index</p>" ], [ "OBJECT_ALIAS", "VARCHAR2(261)", "&nbsp;", "<p>Alias for the object</p>" ], [ "OBJECT_TYPE", "VARCHAR2(20)", "&nbsp;", "<p>Type of the object</p>" ], [ "OPTIMIZER", "VARCHAR2(20)", "&nbsp;", "<p>Current mode of the optimizer for the first row in the plan (statement line), for example, <code>CHOOSE</code>. When the operation is a database access (for example, <code>TABLE ACCESS</code>), this column indicates whether or not the object is analyzed.</p>" ], [ "PARENT_ID", "NUMBER", "&nbsp;", "<p>ID of the next execution step that operates on the output of the current step</p>" ], [ "DEPTH", "NUMBER", "&nbsp;", "<p>Depth (or level) of the operation in the tree. It is not necessary to issue a <code>CONNECT BY</code> statement to get the level information, which is generally used to indent the rows from the <code>PLAN_TABLE</code> table. The root operation (statement) is level 0.</p>" ], [ "POSITION", "NUMBER", "&nbsp;", "<p>Order of processing for all operations that have the same <code>PARENT_ID</code></p>" ], [ "SEARCH_COLUMNS", "NUMBER", "&nbsp;", "<p>Number of index columns with start and stop keys (that is, the number of columns with matching predicates)</p>" ], [ "COST", "NUMBER", "&nbsp;", "<p>Cost of the operation as estimated by the optimizer's cost-based approach. For statements that use the rule-based approach, this column is null.</p>" ], [ "CARDINALITY", "NUMBER", "&nbsp;", "<p>Estimate, by the cost-based optimizer, of the number of rows produced by the operation</p>" ], [ "BYTES", "NUMBER", "&nbsp;", "<p>Estimate, by the cost-based optimizer, of the number of bytes produced by the operation</p>" ], [ "OTHER_TAG", "VARCHAR2(35)", "&nbsp;", "<p>Describes the contents of the <code>OTHER</code> column. See <code>EXPLAIN PLAN</code> for values.</p>" ], [ "PARTITION_START", "VARCHAR2(64)", "&nbsp;", "<p>Start partition of a range of accessed partitions</p>" ], [ "PARTITION_STOP", "VARCHAR2(64)", "&nbsp;", "<p>Stop partition of a range of accessed partitions</p>" ], [ "PARTITION_ID", "NUMBER", "&nbsp;", "<p>Step that computes the pair of values of the <code>PARTITION_START</code> and <code>PARTITION_STOP</code> columns</p>" ], [ "OTHER", "VARCHAR2(4000)", "&nbsp;", "<p>Other information specific to the execution step that users may find useful. See <code>EXPLAIN PLAN</code> for values.</p>" ], [ "DISTRIBUTION", "VARCHAR2(20)", "&nbsp;", "<p>Stores the method used to distribute rows from producer query servers to consumer query servers</p>" ], [ "CPU_COST", "NUMBER", "&nbsp;", "<p>CPU cost of the operation as estimated by the optimizer's cost-based approach. For statements that use the rule-based approach, this column is null.</p>" ], [ "IO_COST", "NUMBER", "&nbsp;", "<p>I/O cost of the operation as estimated by the optimizer's cost-based approach. For statements that use the rule-based approach, this column is null.</p>" ], [ "TEMP_SPACE", "NUMBER", "&nbsp;", "<p>Temporary space usage of the operation (sort or hash-join) as estimated by the optimizer's cost-based approach. For statements that use the rule-based approach, this column is null.</p>" ], [ "ACCESS_PREDICATES", "VARCHAR2(4000)", "&nbsp;", "<p>Predicates used to locate rows in an access structure. For example, start or stop predicates for an index range scan.</p>" ], [ "FILTER_PREDICATES", "VARCHAR2(4000)", "&nbsp;", "<p>Predicates used to filter rows before producing them</p>" ], [ "PROJECTION", "VARCHAR2(4000)", "&nbsp;", "<p>Expressions produced by the operation</p>" ], [ "TIME", "NUMBER", "&nbsp;", "<p>Elapsed time (in seconds) of the operation as estimated by the optimizer's cost-based approach. For statements that use the rule-based approach, this column is null.</p>" ], [ "QBLOCK_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the query block</p>" ], [ "REMARKS", "VARCHAR2(4000)", "&nbsp;", "<p>Remarks</p>" ], [ "TIMESTAMP", "DATE", "&nbsp;", "<p>Timestamp for when the plan was produced</p>" ], [ "OTHER_XML", "CLOB", "&nbsp;", "<p>Provides extra information specific to an execution step of the execution plan. The content of this column is structured using XML because it allows multiple pieces of information to be stored, including the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Name of the schema against which the query was parsed</p>\n</li>\n<li>\n<p>Release number of the Oracle Database that produced the explain plan</p>\n</li>\n<li>\n<p>Hash value associated with the execution plan</p>\n</li>\n<li>\n<p>Name (if any) of the outline or the SQL profile used to build the execution plan</p>\n</li>\n<li>\n<p>Indication of whether or not dynamic statistics were used to produce the plan</p>\n</li>\n<li>\n<p>The outline data, a set of optimizer hints that can be used to regenerate the same plan</p>\n</li>\n</ul>" ], [ "CON_DBID", "NUMBER", "&nbsp;", "<p>The database ID of the PDB for the sampled session</p>" ], [ "CON_ID", "NUMBER", "&nbsp;", "<p>The ID of the container that <code>CON_DBID</code> identifies. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]