[ [ "SIZE_FOR_ESTIMATE", "NUMBER", "<p>Cache size for simulation (in megabytes)</p>" ], [ "SIZE_FACTOR", "NUMBER", "<p>Size factor with respect to the current cache size</p>" ], [ "ESTD_SIZE_TYPE", "VARCHAR2(9)", "<p>Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>MINIMUM</code>: This cache size is required to have all dequeues in-memory (no uncached).</p>\n</li>\n<li>\n<p><code>CURRENT</code>: This is the current size of the message cache.</p>\n</li>\n<li>\n<p><code>MAXIMUM</code>: This cache size is required to have zero evictions.</p>\n</li>\n<li>\n<p><code>NULL</code>: This is the value in all other cases.</p>\n</li>\n</ul>" ], [ "ESTD_CACHED_SUBSHARDS", "NUMBER", "<p>Estimated number of cached subshards for this size</p>" ], [ "ESTD_UNCACHED_SUBSHARDS", "NUMBER", "<p>Estimated number of uncached subshards for this size</p>" ], [ "ESTD_EVICTIONS", "NUMBER", "<p>Estimated number of subshards evicted for this size</p>" ], [ "ESTD_EVICTION_RATE", "NUMBER", "<p>Estimated number of subshards getting evicted per minute</p>" ], [ "ESTD_FG_UNEVICTIONS", "NUMBER", "<p>Estimated number of subshards unevicted by foreground processes</p>" ], [ "ESTD_FG_UNEVICTION_RATE", "NUMBER", "<p>Estimated number of subshards getting unevicted by foreground processes</p>" ], [ "ESTD_BG_UNEVICTIONS", "NUMBER", "<p>Estimated number of subshards unevicted by background processes</p>" ], [ "ESTD_BG_UNEVICTION_RATE", "NUMBER", "<p>Estimated number of subshards getting unevicted by background processes</p>" ], [ "ESTD_BG_PROCESSES", "NUMBER", "<p>Estimated number of background processes required for this size</p>" ], [ "TOTAL_ENQUEUE_RATE", "NUMBER", "<p>Simulated number of messages being enqueued per second</p>" ], [ "TOTAL_DEQUEUE_RATE", "NUMBER", "<p>Simulated number of messages being dequeued per second</p>" ], [ "AVG_SUBSHARD_SIZE", "NUMBER", "<p>Simulated average number of messages per cached subshard</p>" ], [ "AVG_SUBSHARD_MEMORY", "NUMBER", "<p>Simulated average memory per cached subshard (in megabytes)</p>" ], [ "AVG_EVICTION_TIME", "NUMBER", "<p>Simulated average time to evict a cached subshard (in milliseconds)</p>" ], [ "AVG_UNEVICTION_TIME", "NUMBER", "<p>Simulated average time to unevict a cached subshard (in milliseconds)</p>" ], [ "FLAGS", "NUMBER", "<p>Reserved for internal use</p>" ], [ "SIMULATION_TIME", "NUMBER", "<p>Amount of time that was simulated for (in minutes)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]