[ [ "NUM_EVICTED", "NUMBER", "<p>Number of evicted subshards across all sharded queues</p>" ], [ "NUM_PREFETCHED", "NUMBER", "<p>Number of subshards pre-fetched by AQ background process</p>" ], [ "NUM_UNEVICTION", "NUMBER", "<p>Number of subshards un-evicted by foreground process (like dequeue process)</p>" ], [ "NUM_UNCACHED", "NUMBER", "<p>Number of subshards stored as uncached</p>" ], [ "NUM_TRACKED", "NUMBER", "<p>Number of subshards which are actively tracking dequeue rates</p>" ], [ "NUM_CACHED", "NUMBER", "<p>Number of subshards stored as cached</p>" ], [ "MAX_SUBSH_SIZE", "NUMBER", "<p>Maximum subshard size seen till now, in terms of number of messages per subshard</p>" ], [ "MIN_SUBSH_SIZE", "NUMBER", "<p>Minimum subshard size seen till now, in terms of number of messages per subshard</p>" ], [ "MEAN_SUBSH_SIZE", "NUMBER", "<p>Mean subshard size seen till now, in terms of number of messages per subshard</p>" ], [ "AVG_EVICTION_RATE", "NUMBER", "<p>Average number subshards evicted per second</p>" ], [ "AVG_LOAD_RATE", "NUMBER", "<p>Average number of subshards pre-fetched or un-evicted per second</p>" ], [ "AVG_EVICTION_TIME", "NUMBER", "<p>Average time taken to evict one subshard (in milliseconds)</p>" ], [ "AVG_LOAD_TIME", "NUMBER", "<p>Average time taken to un-evict one subshard (in milliseconds)</p>" ], [ "AVG_MISS_RATIO", "NUMBER", "<p>Average ratio of number of foreground un-evictions versus background pre-fetch</p>" ], [ "AVG_THRASH_RATIO", "NUMBER", "<p>Average ratio of number of subshard pre-fetched by background without dequeue attempt versus total number of subshards prefetched</p>" ], [ "MANDATORY_AFF_SWITCH_ATTEMPTS", "NUMBER", "<p>An affinity switch is a change in dequeue instance for a shard-subscriber pair. A mandatory affinity switch is when there are local enqueues in the queue at the instance but no local dequeues present, so the dequeue affinity is switched to another instance for that shard-subscriber pair. This column shows the number of times mandatory affinity switches were attempted across all instances. Populated at the smallest instance id only.</p>" ], [ "OPTIONAL_AFF_SWITCH_ATTEMPTS", "NUMBER", "<p>Optional affinity switches are affinity switches that are not mandatory. Optional affinity switches are done for global load balancing across the Oracle Real Application Clusters (Oracle RAC) database. This column shows the number of times optional affinity switches were attempted across all instances. Populated at the smallest instance id only.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]