[ [ "GROUP_NUMBER", "NUMBER", "<p>Disk group number (primary key). This is the foreign key to the <code>V$ASM_DISKGROUP</code> view.</p>" ], [ "OPERATION", "CHAR(5)", "<p>Type of the operation:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>REBAL</code> - Rebalance pending for this group. The disk group is rebalancing.</p>\n</li>\n<li>\n<p><code>REMIRROR</code> - Remirror is pending for this group.</p>\n</li>\n<li>\n<p><code>SCRUB</code> - Scrubbing is pending for this group.</p>\n</li>\n</ul>\n<p>Starting with Oracle Database 12<span class=\"italic\">c</span>, new queries should use the <code>PASS</code> column instead of this column.</p>" ], [ "PASS", "VARCHAR2(9)", "<p>Type of the operation:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>REBALANCE</code> - Rebalance pending for this group. The disk group is rebalancing.</p>\n</li>\n<li>\n<p><code>RESYNC</code> - Resync operation in progress to bring one or more Oracle ASM disks online</p>\n</li>\n<li>\n<p><code>COMPACT</code> - Oracle ASM is moving user data closer together, which improves performance by reducing seek distance</p>\n</li>\n<li>\n<p><code>RESILVER</code> - This value appears in Oracle Exadata environments when WriteBack FlashCache is enabled</p>\n</li>\n<li>\n<p><code>SCRUBBING</code> - The disk group is scrubbing.</p>\n</li>\n</ul>\n<p>Starting with Oracle Database 12<span class=\"italic\">c</span>, new queries should use this column instead of the <code>OPERATION</code> column.</p>" ], [ "STATE", "VARCHAR2(4)", "<p>State of the operation:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>WAIT</code> - No operations running for the group</p>\n</li>\n<li>\n<p><code>RUN</code> - Operation running for the group</p>\n</li>\n<li>\n<p><code>REAP</code> - Operation is being run down</p>\n</li>\n<li>\n<p><code>DONE</code> - Displayed for a pass that is complete</p>\n</li>\n<li>\n<p><code>ERRS</code> - Operation halted by errors</p>\n</li>\n</ul>" ], [ "POWER", "NUMBER", "<p>Power requested for the operation as specified by the ASM_POWER_LIMIT initialization parameter or command syntax. Or, power requested for the operation as specified by the power option of the scrubbing SQL syntax.</p>" ], [ "ACTUAL", "NUMBER", "<p>Power allocated to the operation</p>" ], [ "SOFAR", "NUMBER", "<p>Number of Allocation Units that are being moved per minute by the operation. Or, the number of Allocation Units that have been scrubbed so far.</p>" ], [ "EST_WORK", "NUMBER", "<p>Estimated number of Allocation Units that have to be moved by the operation. Or, the estimated number of Allocation Units that have to be scrubbed by the scrubbing operation.</p>" ], [ "EST_RATE", "NUMBER", "<p>Estimated number of Allocation Units that are being moved per minute by the operation</p>" ], [ "EST_MINUTES", "NUMBER", "<p>Estimated amount of time (in minutes) that the remainder of the operation is expected to take</p>" ], [ "ERROR_CODE", "VARCHAR2(44)", "<p>Oracle external error code; NULL if no error</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>\n<p>For this view, the value is always <code>0</code>.</p>" ] ]