[ [ "FS_NAME", "VARCHAR2(1024)", "<p>Mount point (primary key)</p>" ], [ "AVAILABLE_TIME", "DATE", "<p>Mount time or the time that the file system became available again; NULL if the file system is not available</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>File system block size (in kilobytes)</p>" ], [ "STATE", "VARCHAR2(13)", "<p>File system status::</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NOT AVAILABLE</code></p>\n</li>\n<li>\n<p><code>AVAILABLE</code></p>\n</li>\n<li>\n<p><code>OFFLINE</code> - Either the Oracle ASM instance is down, the disk group has been forced dismounted, or less commonly, a metadata I/O failure occurred or serious metadata corruption was detected. In the case of a metadata I/O failure, the file system is also marked as corrupt. An offline file system can only be unmounted; other attempts at access result in errors.</p>\n</li>\n</ul>" ], [ "CORRUPT", "VARCHAR2(5)", "<p>Indicates whether the file system needs the fixer (<code>fsck</code>, <code>acfschkdsk</code>) to be run (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "NUM_VOL", "NUMBER", "<p>Number of volumes in the file system</p>" ], [ "TOTAL_SIZE", "NUMBER", "<p>Total capacity of the file system (in megabytes)</p>" ], [ "TOTAL_FREE", "NUMBER", "<p>Total free space in the file system (in megabytes)</p>" ], [ "TOTAL_SNAP_SPACE_USAGE", "NUMBER", "<p>Total space used by snapshots (in megabytes)</p>" ], [ "REPLSTATE", "VARCHAR2(7)", "<p>Replication status:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NO REPL</code> - Replication is not initialized</p>\n</li>\n<li>\n<p><code>PRIMARY</code> - File system is initialized for replication as a primary</p>\n</li>\n<li>\n<p><code>STANDBY</code> - File system is initialized for replication as a standby</p>\n</li>\n</ul>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>\n<p>For this view, the value is always <code>0</code>.</p>" ] ]