[ [ "GROUP_NUMBER", "NUMBER", "<p>Cluster-wide number assigned to the disk group (primary key)</p>" ], [ "NAME", "VARCHAR2(30)", "<p>Name of the disk group</p>" ], [ "SECTOR_SIZE", "NUMBER", "<p>Physical block size (in bytes)</p>" ], [ "LOGICAL_SECTOR_SIZE</code><a id=\"fn_1\" href=\"#fn_1\" onclick='footdisplay(1,\"This column is available starting with Oracle Database 12c Release 2 (12.2.0.1). \")'><sup>Foot&nbsp;1</sup></a></p>\n</td>\n<td class=\"cellalignment3905\" headers=\"d1534652e215 d1534652e171\">\n<p><code>NUMBER</code></p>\n</td>\n<td class=\"cellalignment3908\" headers=\"d1534652e215 d1534652e174\">\n<p>This column represents the logical sector size value of the disk group in bytes. This is the smallest possible I/O that can be done in this disk group. Any I/O smaller than the logical sector size will cause an assert in the code.</p>\n<p>If the value of the <code>LOGICAL_SECTOR_SIZE</code> column is <code>512</code>, while the value in the <code>SECTOR_SIZE</code> column is <code>4096</code>, then the disk group supports 512 sector size emulation. This means that I/O operations can be both 512 or 4096 aligned. For example, this means that you can have redo log files with a file block size of 512 bytes in this disk group that can be both read and written to, as well as create new redo log files with a file block size of 4096 bytes.</p>\n</td>\n</tr>\n<tr>\n<td class=\"cellalignment3904\" id=\"d1534652e247\" headers=\"d1534652e168\">\n<p><code>BLOCK_SIZE", "NUMBER", "<p>Oracle ASM metadata block size (in bytes)</p>" ], [ "ALLOCATION_UNIT_SIZE", "NUMBER", "<p>Size of the allocation unit (in bytes)</p>" ], [ "STATE", "VARCHAR2(11)", "<p>State of the disk group relative to the instance:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CONNECTED</code> - Disk group is in use by the database instance</p>\n</li>\n<li>\n<p><code>BROKEN</code> - Database instance lost connectivity to the Oracle ASM instance that mounted the disk group</p>\n</li>\n<li>\n<p><code>UNKNOWN</code> - Oracle ASM instance has never attempted to mount the disk group</p>\n</li>\n<li>\n<p><code>DISMOUNTED</code> - Disk group was cleanly dismounted by the Oracle ASM instance following a successful mount</p>\n</li>\n<li>\n<p><code>MOUNTED</code> - Instance is successfully serving the disk group to its database clients</p>\n</li>\n<li>\n<p><code>QUIESCING</code> - CRSCTL utility attempted to dismount a disk group that contains the Oracle Cluster Registry (OCR). The disk group cannot be dismounted until Cluster Ready Services (CRS) exits, because the disk group contains the OCR.</p>\n</li>\n</ul>" ], [ "TYPE", "VARCHAR2(6)", "<p>Redundancy type for the disk group:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>EXTERN</code></p>\n</li>\n<li>\n<p><code>NORMAL</code></p>\n</li>\n<li>\n<p><code>HIGH</code></p>\n</li>\n</ul>" ], [ "TOTAL_MB", "NUMBER", "<p>Total capacity of the disk group (in megabytes)</p>" ], [ "FREE_MB", "NUMBER", "<p>Unused capacity of the disk group (in megabytes)</p>" ], [ "HOT_USED_MB", "NUMBER", "<p>Number of used megabytes in the hot region</p>" ], [ "COLD_USED_MB", "NUMBER", "<p>Number of used megabytes in the cold region</p>" ], [ "REQUIRED_MIRROR_FREE_MB", "NUMBER", "<p>Amount of space that is required to be available in a given disk group in order to restore redundancy after one or more disk failures. The amount of space displayed in this column takes mirroring effects into account.</p>" ], [ "USABLE_FILE_MB", "NUMBER", "<p>Amount of free space that can be safely utilized taking mirroring into account and yet be able to restore redundancy after a disk failure</p>" ], [ "OFFLINE_DISKS", "NUMBER", "<p>Number of disks in the disk group that are currently offline</p>" ], [ "COMPATIBILITY", "VARCHAR2(60)", "<p>Minimum software version required for an Oracle ASM instance to mount this disk group</p>" ], [ "DATABASE_COMPATIBILITY", "VARCHAR2(60)", "<p>Minimum software version required for a database instance to use files in this disk group</p>" ], [ "VOTING_FILES", "VARCHAR2(1)", "<p>Indicates whether the disk contains voting files (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>\n<p>For this view, the value is always <code>0</code>.</p>" ] ]