[ [ "SESSION_ID", "NUMBER", "<p>A unique numeric identifier for the session.</p>" ], [ "AGGREGATE_CACHE_HITS", "NUMBER", "<p>The number of times a dimension member is found in the aggregate cache (a hit).</p>\n<p>The number of hits for run-time aggregation can be increased by fetching data across the dense dimension</p>" ], [ "AGGREGATE_CACHE_MISSES", "NUMBER", "<p>The number of times a dimension member is not found in the aggregate cache and must be read from disk (a miss).</p>" ], [ "SESSION_CACHE_HITS", "NUMBER", "<p>The number of times the data is found in the session cache (a hit).</p>" ], [ "SESSION_CACHE_MISSES", "NUMBER", "<p>The number of times the data is not found in the session cache (a miss).</p>" ], [ "POOL_HITS", "NUMBER", "<p>The number of times the data is found in a page in the OLAP page pool (a hit).</p>" ], [ "POOL_MISSES", "NUMBER", "<p>The number of times the data is not found in the OLAP page pool (a miss).</p>" ], [ "POOL_NEW_PAGES", "NUMBER", "<p>The number of newly created pages in the OLAP page pool that have not yet been written to the workspace LOB.</p>" ], [ "POOL_RECLAIMED_PAGES", "NUMBER", "<p>The number of previously unused pages that have been recycled with new data.</p>" ], [ "CACHE_WRITES", "NUMBER", "<p>The number of times the data from the OLAP page pool has been written to the database cache.</p>" ], [ "POOL_SIZE", "NUMBER", "<p>The number of kilobytes in the OLAP page pool.</p>" ], [ "CURR_DML_COMMAND", "VARCHAR2(64)", "<p>The command currently being executed.</p>" ], [ "PREV_DML_COMMAND", "VARCHAR2(64)", "<p>The command most recently completed.</p>" ], [ "AGGR_FUNC_LOGICAL_NA", "NUMBER", "<p>The number of times the aggregation engine returns a logical NA because the AGGINDEX option is on and the composite tuple does not exist.</p>" ], [ "AGGR_FUNC_PRECOMPUTE", "NUMBER", "<p>The number of times the aggregation engine finds a value in a position that it was called to calculate.</p>" ], [ "AGGR_FUNC_CALCS", "NUMBER", "<p>The number of times the aggregation engine calculates a parent value based on the values of its children.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]