[ [ "RECID", "NUMBER", "<p>Backup data file record ID</p>" ], [ "STAMP", "NUMBER", "<p>Backup data file record stamp</p>" ], [ "SET_STAMP", "NUMBER", "<p>Backup set stamp</p>" ], [ "SET_COUNT", "NUMBER", "<p>Backup set count</p>" ], [ "FILE#", "NUMBER", "<p>Data file number; set to 0 for control file</p>" ], [ "CREATION_CHANGE#", "NUMBER", "<p>Creation system change number (SCN) of the data file</p>" ], [ "CREATION_TIME", "DATE", "<p>Creation timestamp of the data file</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p>Resetlogs system change number (SCN) of the data file when it was backed up</p>" ], [ "RESETLOGS_TIME", "DATE", "<p>Resetlogs timestamp of the data file when it was backed up</p>" ], [ "INCREMENTAL_LEVEL", "NUMBER", "<p>Normal full backups have a NULL value, level 0 incremental backups have a value of 0, and level 1 incremental backups have a value of 1</p>" ], [ "INCREMENTAL_CHANGE#", "NUMBER", "<p>All blocks changed after the incremental change number is included in this backup; set to 0 for a full backup</p>" ], [ "CHECKPOINT_CHANGE#", "NUMBER", "<p>All changes up to the checkpoint change number are included in this backup</p>" ], [ "CHECKPOINT_TIME", "DATE", "<p>Timestamp of the checkpoint</p>" ], [ "ABSOLUTE_FUZZY_CHANGE#", "NUMBER", "<p>Highest change number in this backup</p>" ], [ "MARKED_CORRUPT", "NUMBER", "<p>Number of blocks marked corrupt</p>" ], [ "MEDIA_CORRUPT", "NUMBER", "<p>Number of blocks media corrupt</p>" ], [ "LOGICALLY_CORRUPT", "NUMBER", "<p>Number of blocks logically corrupt</p>" ], [ "DATAFILE_BLOCKS", "NUMBER", "<p>Size of the data file in blocks at backup time. This value is also the number of blocks taken by the data file restarted from this backup.</p>" ], [ "BLOCKS", "NUMBER", "<p>Size of the backup data file (in blocks). Unused blocks are not copied to the backup.</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Block size</p>" ], [ "OLDEST_OFFLINE_RANGE", "NUMBER", "<p>RECID of the oldest offline range record in this backup control file. <code>0</code> for data file backups.</p>" ], [ "COMPLETION_TIME", "DATE", "<p>Time completed</p>" ], [ "CONTROLFILE_TYPE", "VARCHAR2(1)", "<p><code>B</code> - Normal copies</p>\n<p><code>S</code> - Standby copies</p>" ], [ "USED_CHANGE_TRACKING", "VARCHAR2(3)", "<p>Indicates whether change tracking data was used to accelerate this incremental backup (<code>YES</code>) or whether change tracking data was not used (<code>NO</code>)</p>" ], [ "BLOCKS_READ", "NUMBER", "<p>Number of blocks that were scanned while taking this backup. If this was an incremental backup, and change tracking was used to optimize the backup, then the value of this column will be smaller than <code>DATAFILE_BLOCKS</code>. Otherwise, the value of this column will be the same as <code>DATAFILE_BLOCKS</code>. Even when change tracking data is used, the value of this column may be larger than <code>BLOCKS</code>, because the data read by change tracking is further refined during the process of creating an incremental backup.</p>" ], [ "USED_OPTIMIZATION", "VARCHAR2(3)", "<p>Indicates whether backup optimization was applied (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "FOREIGN_DBID", "NUMBER", "<p>Foreign DBID of the database from which this data file was transported. The value is 0 if the file backed up is not a foreign database file.</p>" ], [ "PLUGGED_READONLY", "VARCHAR2(3)", "<p><code>YES</code> if this is a backup of a transported read-only foreign file; otherwise <code>NO</code>.</p>" ], [ "PLUGIN_CHANGE#", "NUMBER", "<p>SCN at which the foreign data file was transported into the database. The value is 0 if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_CHANGE#", "NUMBER", "<p>The SCN of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is 0 if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_TIME", "DATE", "<p>The time of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is 0 if this file is not a foreign database file.</p>" ], [ "SECTION_SIZE", "NUMBER", "<p>Specifies the number of blocks in each section of a multisection backup. Value is 0 for whole file backups.</p>" ], [ "UNDO_OPTIMIZED", "VARCHAR2(3)", "<p>Indicates whether undo blocks were ignored when creating the backup data file (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "BLOCKS_SKIPPED_IN_CELL", "NUMBER", "<p>Number of blocks that were not backed up because they were skipped by the Exadata cell</p>\n<p><span class=\"bold\">See Also:</span> Oracle Exadata Storage Server Software documentation for more information</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "BACKED_BY_PDB", "VARCHAR2(3)", "<p>Recovery Manager (RMAN) allows a PDB to be backed up in two ways. The value in this column indicates how the PDB backup was taken:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: The backup was taken when connected to the PDB</p>\n</li>\n<li>\n<p><code>NO</code>: The backup was taken when connected to the root container</p>\n</li>\n</ul>" ] ]