[ [ "RECID", "NUMBER", "<p>Nologged backup record ID</p>" ], [ "STAMP", "NUMBER", "<p>Nonlogged backup record stamp</p>" ], [ "SET_STAMP", "NUMBER", "<p>Backup set stamp</p>" ], [ "SET_COUNT", "NUMBER", "<p>Backup set count</p>" ], [ "PIECE#", "NUMBER", "<p>Backup piece that contains the range of nonlogged blocks</p>" ], [ "FILE#", "NUMBER", "<p>Absolute file number of the data file that contains this range of nonlogged blocks</p>" ], [ "BLOCK#", "NUMBER", "<p>Block number of the first nonlogged block in the range of nologged blocks</p>" ], [ "BLOCKS", "NUMBER", "<p>Number of nonlogged blocks found starting with <code>BLOCK#</code></p>" ], [ "NONLOGGED_CHANGE#", "NUMBER", "<p>The smallest SCN on which any block in this block range became nonlogged. NULL if unknown.</p>" ], [ "NONLOGGED_TIME", "VARCHAR2", "<p>The time that corresponds to <code>NONLOGGED_CHANGE#</code>. NULL if unknown.</p>" ], [ "RESETLOGS_CHANGE#", "VARCHAR2", "<p>The resetlogs SCN of the incarnation on which this block range was first marked as nonlogged. NULL if unknown.</p>" ], [ "RESETLOGS_TIME", "VARCHAR2", "<p>The resetlogs time of the incarnation on which this block range was first marked as nologged. NULL if unknown.</p>" ], [ "OBJECT#", "VARCHAR2", "<p>The object ID this range belongs to. If this field is NULL, the object number is unknown.</p>" ], [ "REASON", "CHAR(7)", "<p>The reason why this block range appears in this list. For Oracle Database 12<span class=\"italic\">c</span>, it is always <code>UNKNOWN</code>.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]