[ [ "RECID", "NUMBER", "<p>Backup set record ID</p>" ], [ "STAMP", "NUMBER", "<p>Backup set record stamp</p>" ], [ "SET_STAMP", "NUMBER", "<p>Backup set stamp. The backup set stamp and count uniquely identify the backup set.</p>\n<p>Primary key for the <code>V$BACKUP_SET</code> table, and the foreign key for the following tables: <code>V$BACKUP_PIECE</code>, <code>V$BACKUP_DATAFILE</code>, <code>V$BACKUP_REDOLOG</code>, <code>V$BACKUP_CORRUPTION</code>.</p>" ], [ "SET_COUNT", "NUMBER", "<p>Backup set count. The backup set count is incremented by one every time a new backup set is started (if the backup set is never completed the number is \"lost\"). If the control file is re-created then the count is reset to <code>1</code>. Therefore the count must be used with the stamp to uniquely identify a backup set.</p>\n<p>Primary key for the <code>V$BACKUP_SET</code> table, and the foreign key for the following tables: <code>V$BACKUP_PIECE</code>, <code>V$BACKUP_DATAFILE</code>, <code>V$BACKUP_REDOLOG</code>, <code>V$BACKUP_CORRUPTION</code></p>" ], [ "BACKUP_TYPE", "VARCHAR2(1)", "<p>Type of files that are in this backup. If the backup contains archived redo logs, the value is <code>L</code>. If this is a data file full backup, the value is <code>D</code>. If this is an incremental backup, the value is <code>I</code>.</p>" ], [ "CONTROLFILE_INCLUDED", "VARCHAR2(3)", "<p>Set to <code>YES</code> if there is a control file included in this backup set, otherwise set to <code>NO</code></p>" ], [ "INCREMENTAL_LEVEL", "NUMBER", "<p>Location where this backup set fits into the database's backup strategy. Set to NULL for full datafile, archivelog, controlfile, and spfile backups, set to 0 for incremental level 0 datafile backups, and set to 1 for incremental level 1 datafile backups.</p>" ], [ "PIECES", "NUMBER", "<p>Number of distinct backup pieces in the backup set</p>" ], [ "START_TIME", "DATE", "<p>Starting time</p>" ], [ "COMPLETION_TIME", "DATE", "<p>Time that this backup set completed</p>" ], [ "ELAPSED_SECONDS", "NUMBER", "<p>The number of elapsed seconds</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Block size of the backup set</p>" ], [ "INPUT_FILE_SCAN_ONLY", "VARCHAR2(3)", "<p><code>YES</code> indicates no actual backup is performed, but the data files are read. <code>NO</code> indicates a normal backup is performed.</p>" ], [ "KEEP", "VARCHAR2(3)", "<p>(<code>YES</code>/<code>NO</code>) Indicates whether or not this backup set has a retention policy that is different than the value for the configure retention policy</p>" ], [ "KEEP_UNTIL", "DATE", "<p>If <code>KEEP_UNTIL</code>_TIME is specified, this is the date after which the backup becomes obsolete. If this column is null, then the backup never expires.</p>" ], [ "KEEP_OPTIONS", "VARCHAR2(11)", "<p>Lists additional retention options for this backup set. Possible values are:</p>\n<p><code>LOGS</code> - The logs need to recover this backup are kept</p>\n<p><code>NOLOGS</code> - The logs needed to recover this backup will not be kept</p>\n<p><code>BACKUP_LOGS</code> - An archive log backup exists to support this backup set</p>" ], [ "MULTI_SECTION", "VARCHAR2(3)", "<p>Indicates whether or not this backup set is a multi-section backup. Valid values are <code>YES</code> and <code>NO</code>. A multi-section backup is a backup in which multiple backup pieces are produced independently in parallel by multiple channels.</p>" ], [ "FOR_XTTS", "VARCHAR2(3)", "<p>Indicates whether this is a cross platform backup set:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: This is a cross platform backup set.</p>\n</li>\n<li>\n<p><code>NO</code>: This is not a cross platform backup set.</p>\n</li>\n</ul>" ], [ "SAME_ENDIAN", "VARCHAR2(3)", "<p>If the value of <code>FOR_XTTS</code> is <code>YES</code>, then this column indicates whether the backup set has the same endianess as the current database (<code>YES</code>) or not (<code>NO</code>); otherwise <code>NULL</code>.</p>" ], [ "INC_DMPFILE", "VARCHAR2(3)", "<p>If the value of <code>FOR_XTTS</code> is <code>YES</code>, then this column indicates whether the backup set includes a Data Pump export file of the backed up data files (<code>YES</code>) or not (<code>NO</code>), otherwise <code>NULL</code>.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]