[ [ "RECID", "NUMBER", "<p>Copy corruption record ID</p>" ], [ "STAMP", "NUMBER", "<p>Copy corruption record stamp</p>" ], [ "COPY_RECID", "NUMBER", "<p>Data file copy record ID</p>" ], [ "COPY_STAMP", "NUMBER", "<p>Data file copy record stamp</p>" ], [ "FILE#", "NUMBER", "<p>Data file number</p>" ], [ "BLOCK#", "NUMBER", "<p>First block of the corrupted range</p>" ], [ "BLOCKS", "NUMBER", "<p>Number of contiguous blocks in the corrupted range</p>" ], [ "CORRUPTION_CHANGE#", "NUMBER", "<p>Change number at which the logical corruption was detected. Set to <code>0</code> to indicate media corruption.</p>" ], [ "MARKED_CORRUPT", "VARCHAR2(3)", "<p>(<code>YES</code> | <code>NO</code>) If set to <code>YES</code> the blocks were not marked corrupted in the data file, but were detected and marked as corrupted while making the data file copy</p>" ], [ "CORRUPTION_TYPE", "VARCHAR2(9)", "<p>Type of block corruption in the data file:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>ALL ZERO</code> - Block header on disk contained only zeros. The block may be valid if it was never filled and if it is in an Oracle7 file. The buffer will be reformatted to the Oracle8 standard for an empty block.</p>\n</li>\n<li>\n<p><code>FRACTURED</code> - Block header looks reasonable, but the front and back of the block are different versions.</p>\n</li>\n<li>\n<p><code>CHECKSUM</code> - optional check value shows that the block is not self-consistent. It is impossible to determine exactly why the check value fails, but it probably fails because sectors in the middle of the block are from different versions.</p>\n</li>\n<li>\n<p><code>CORRUPT</code> - Block is wrongly identified or is not a data block (for example, the data block address is missing)</p>\n</li>\n<li>\n<p><code>LOGICAL</code> - Block is logically corrupt</p>\n</li>\n<li>\n<p><code>NOLOGGING</code> - Block does not have redo log entries (for example, <code>NOLOGGING</code> operations on primary database can introduce this type of corruption on a physical standby)</p>\n</li>\n</ul>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]