[ [ "RECID", "NUMBER", "<p>Data file copy record ID</p>" ], [ "STAMP", "NUMBER", "<p>Data file copy record stamp</p>" ], [ "NAME", "VARCHAR2(513)", "<p>File name of the data file copy. The maximum length of the name is operating system dependent.</p>" ], [ "TAG", "VARCHAR2(32)", "<p>Data file copy tag</p>" ], [ "FILE#", "NUMBER", "<p>Absolute data file number</p>" ], [ "RFILE#", "NUMBER", "<p>Tablespace relative data file number</p>" ], [ "CREATION_CHANGE#", "NUMBER", "<p>Data file creation change#</p>" ], [ "CREATION_TIME", "DATE", "<p>Data file creation timestamp</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p>Resetlogs change number of the data file when the copy was made</p>" ], [ "RESETLOGS_TIME", "DATE", "<p>Resetlogs timestamp of the data file when the copy was made</p>" ], [ "INCREMENTAL_LEVEL", "NUMBER", "<p>Normal full backups have a NULL value, level 0 incremental backups have a value of 0, and level 1 incremental backups have a value of 1</p>" ], [ "CHECKPOINT_CHANGE#", "NUMBER", "<p>Checkpoint change number of the data file when the copy was made</p>" ], [ "CHECKPOINT_TIME", "DATE", "<p>Checkpoint timestamp of the data file when the copy was made</p>" ], [ "ABSOLUTE_FUZZY_CHANGE#", "NUMBER", "<p>Highest change seen when the data file was copied</p>" ], [ "RECOVERY_FUZZY_CHANGE#", "NUMBER", "<p>Highest change written to the file by media recovery</p>" ], [ "RECOVERY_FUZZY_TIME", "DATE", "<p>Timestamp of the highest change written to the file by media recovery</p>" ], [ "ONLINE_FUZZY", "VARCHAR2(3)", "<p>(<code>YES</code>|<code>NO</code>) If set to <code>YES</code>, this is a copy taken using an operating system utility after a crash or offline immediate (or an invalid copy taken while data file was online and the database open). Recovery will need to apply all redo up to the next crash recovery marker to make the file consistent.</p>" ], [ "BACKUP_FUZZY", "VARCHAR2(3)", "<p>(<code>YES</code>|<code>NO</code>) If set to <code>YES</code>, this is a copy taken using the <code>BEGIN BACKUP/END BACKUP</code> technique. Recovery will need to apply all redo up to the end backup marker to make this copy consistent.</p>" ], [ "MARKED_CORRUPT", "NUMBER", "<p>Number of blocks marked corrupt by this copy operation. That is, blocks that were not marked corrupted in the source data file, but were detected and marked as corrupted during the copy operation.</p>" ], [ "MEDIA_CORRUPT", "NUMBER", "<p>Total number of media corrupt blocks. For example, blocks with checksum errors are marked media corrupt.</p>" ], [ "LOGICALLY_CORRUPT", "NUMBER", "<p>Total number of logically corrupt blocks. For example, applying redo for unrecoverable operations will mark affected blocks logically corrupt.</p>" ], [ "BLOCKS", "NUMBER", "<p>Size of the data file copy in blocks (also the size of the data file when the copy was made)</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Block size of the data file</p>" ], [ "OLDEST_OFFLINE_RANGE", "NUMBER", "<p>RECID of the oldest offline range record in this control file copy; 0 for data file copies</p>" ], [ "DELETED", "VARCHAR2(3)", "<p>(<code>YES</code>|<code>NO</code>) If set to <code>YES</code> the data file copy has been deleted or overwritten</p>" ], [ "STATUS", "VARCHAR2(1)", "<p>Identifies the status of this data file copy. Possible values are:</p>\n<p><code>A</code> - Available</p>\n<p><code>D</code> - Deleted</p>\n<p><code>U</code> - Unavailable</p>\n<p><code>X</code> - Expired</p>" ], [ "COMPLETION_TIME", "DATE", "<p>Time when the copy was completed</p>" ], [ "CONTROLFILE_TYPE", "VARCHAR2(1)", "<p><code>B</code> indicates normal copies</p>\n<p><code>S</code> indicates standby copies</p>" ], [ "KEEP", "VARCHAR2(3)", "<p>(<code>YES</code>/<code>NO</code>) Indicates whether or not this backup set has a retention policy that is different than the value for the configure retention policy</p>" ], [ "KEEP_UNTIL", "DATE", "<p>If <code>KEEP_UNTIL</code> is specified, this is the date after which the backup becomes obsolete. If this column is null, then the backup never expires.</p>" ], [ "KEEP_OPTIONS", "VARCHAR2(11)", "<p>Lists additional retention options for this backup set. Possible values are:</p>\n<p><code>LOGS</code> - The logs need to recover this backup are kept</p>\n<p><code>NOLOGS</code> - The logs needed to recover this backup will not be kept</p>" ], [ "SCANNED", "VARCHAR2(3)", "<p>Indicates whether RMAN scanned the file (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "IS_RECOVERY_DEST_FILE", "VARCHAR2(3)", "<p>Indicates whether the file was created in the fast recovery area (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "RMAN_STATUS_RECID", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> record ID</p>" ], [ "RMAN_STATUS_STAMP", "NUMBER", "<p>Owning <code>V$RMAN_STATUS</code> record stamp</p>" ], [ "CONVERTED_FILE", "VARCHAR2(3)", "<p>(<code>YES</code>/<code>NO</code>) Indicates whether or not the data file copy was created using the RMAN <code>CONVERT</code> command</p>" ], [ "SAME_ENDIAN", "VARCHAR2(3)", "<p>If the value of the <code>CONVERTED_FILE</code> column is <code>YES</code>, then this column indicates whether the data file copy has the same endianness as the source data file (<code>YES</code>) or not (<code>NO</code>); otherwise NULL</p>" ], [ "FOREIGN_DBID", "NUMBER", "<p>Foreign DBID from which this data file came from. The value is 0 if this file is not a foreign database file.</p>" ], [ "PLUGGED_READONLY", "VARCHAR2(3)", "<p><code>YES</code> if this is a transported read-only foreign file; otherwise <code>NO</code>.</p>" ], [ "PLUGIN_CHANGE#", "NUMBER", "<p>SCN at which the foreign data file was transported into the database. The value is 0 if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_CHANGE#", "NUMBER", "<p>The SCN of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is 0 if this file is not a foreign database file.</p>" ], [ "PLUGIN_RESETLOGS_TIME", "DATE", "<p>The time of the <code>RESETLOGS</code> operation for the incarnation into which this foreign file was transported. The value is 0 if this file is not a foreign database file.</p>" ], [ "BACKED_BY_VSS", "VARCHAR2(3)", "<p>Whether or not the file has been backed up by Volume Shadow Copy Service (VSS). This column is reserved for internal use.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "BACKED_BY_PDB", "VARCHAR2(3)", "<p>Recovery Manager (RMAN) allows a PDB to be backed up in two ways. The value in this column indicates how the PDB backup was taken:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: The backup was taken when connected to the PDB</p>\n</li>\n<li>\n<p><code>NO</code>: The backup was taken when connected to the root container</p>\n</li>\n</ul>" ] ]