[ [ "SOURCE_DBID", "NUMBER", "<p>Database ID of the protected source database</p>" ], [ "SOURCE_DB_UNIQUE_NAME", "VARCHAR2(32)", "<p>DB unique name of the protected source database</p>" ], [ "NAME", "VARCHAR2(32)", "<p>Name of the metric:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>APPLY FINISH TIME</code> - An estimate of the time needed to apply all received, but unapplied redo from the primary database. If there are one or more redo gaps on the standby database, an estimate of the time needed to apply all received, but unapplied redo up to the end of the last archived redo log before the beginning of the earliest redo gap.</p>\n</li>\n<li>\n<p><code>APPLY LAG</code> - Apply lag is a measure of the degree to which the data in a standby database lags behind the data in the primary database, due to delays in propagating and applying redo to the standby database. This value is relevent only to the applying instance.</p>\n</li>\n<li>\n<p><code>TRANSPORT LAG</code> - Transport lag is a measure of the degree to which the transport of redo to the standby database lags behind the generation of redo on the primary database. If there are one or more redo gaps on the standby database, the transport lag is calculated as if no redo has been received after the beginning of the earliest redo gap.</p>\n</li>\n<li>\n<p><code>ESTIMATED STARTUP TIME</code> - An estimate of the time needed to start and open the database.</p>\n</li>\n</ul>" ], [ "VALUE", "VARCHAR2(64)", "<p>Value of the metric</p>" ], [ "UNIT", "VARCHAR2(30)", "<p>Unit of measurement</p>" ], [ "TIME_COMPUTED", "VARCHAR2(30)", "<p>Local time at the standby database when the metric was computed</p>" ], [ "DATUM_TIME", "VARCHAR2(30)", "<p>Local time at the standby database when the datum used to compute the metric was received</p>\n<p>The <code>APPLY LAG</code> and <code>TRANSPORT LAG</code> metrics are computed based on data that is periodically received from the primary database. An unchanging value in this column across multiple queries indicates that the standby database is not receiving data from the primary database.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]