[ [ "ID", "NUMBER", "<p>Buffer pool identifier (ranges from 1 to 8)</p>" ], [ "NAME", "VARCHAR2(20)", "<p>Buffer pool name</p>" ], [ "BLOCK_SIZE", "NUMBER", "<p>Block size in bytes for buffers in this pool. Possible values: the standard block size, the power of 2 nonstandard block sizes, <code>2048</code>, <code>4096</code>, <code>8192</code>, <code>16384</code>, <code>32768</code>.</p>" ], [ "ADVICE_STATUS", "VARCHAR2(3)", "<p>Status of the advisory. <code>ON</code> indicates it is currently running; <code>OFF</code> indicates it is disabled (in this case the estimates are historical and calculated when last enabled).</p>" ], [ "SIZE_FOR_ESTIMATE", "NUMBER", "<p>Cache size for prediction (in megabytes)</p>" ], [ "SIZE_FACTOR", "NUMBER", "<p>Size factor with respect to the current cache size</p>" ], [ "BUFFERS_FOR_ESTIMATE", "NUMBER", "<p>Cache size for prediction (in terms of buffers)</p>" ], [ "ESTD_PHYSICAL_READ_FACTOR", "NUMBER", "<p>Physical read factor for this cache size, which is the ratio of the number of estimated physical reads to the number of reads in the real cache. If there are no physical reads in the real cache, the value of this column is null.</p>" ], [ "ESTD_PHYSICAL_READS", "NUMBER", "<p>Estimated number of physical reads for this cache size</p>" ], [ "ESTD_PHYSICAL_READ_TIME", "NUMBER", "<p>Estimated disk read time (in seconds)</p>" ], [ "ESTD_PCT_OF_DB_TIME_FOR_READS", "NUMBER", "<p>Estimated disk time as a percentage of the total time</p>" ], [ "ESTD_CLUSTER_READS", "NUMBER", "<p>Estimated total number of blocks foreground processes read from the global cache (Oracle Real Application Clusters only)</p>" ], [ "ESTD_CLUSTER_READ_TIME", "NUMBER", "<p>Estimated total amount of time, in seconds, foreground processes read from global cache (Oracle Real Application Clusters only)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]