[ [ "TYPE", "VARCHAR2(64)", "<p>Indicates whether a row contains a <code>DEAD PROCESS</code> or <code>KILLED SESSION</code></p>" ], [ "PADDR", "RAW(8)", "<p>Process pointer. Can be joined with <code>V$PROCESS</code>. For a killed session, this is the owner of the session, which can be NULL.</p>" ], [ "SADDR", "RAW(8)", "<p>Session pointer. Can be joined with <code>V$SESSION</code>. For a dead process, this is the user session.</p>" ], [ "ROOT_ADDR", "RAW(8)", "<p>Pointer to the root of the tree</p>" ], [ "CLEANUP_OWNER", "VARCHAR2(64)", "<p>Indicates which process is responsible for cleanup of this tree:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CLEANUP PROCESS</code> - a cleanup process is responsible</p>\n</li>\n<li>\n<p><code>OWNER PROCESS</code> - the root owner is responsible</p>\n</li>\n</ul>" ], [ "STATE", "VARCHAR2(64)", "<p>Cleanup state:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CLEANUP PENDING</code> - Occurs for a dead process / killed session that can be cleaned up, but PMON has not yet made an attempt</p>\n</li>\n<li>\n<p><code>IN PROGRESS</code> - A cleanup attempt is currently in progress</p>\n</li>\n<li>\n<p><code>RESOURCES FREED</code> - Occurs for a dead process / killed session where all children have been freed, but the process / killed session itself is not yet freed</p>\n</li>\n<li>\n<p><code>PARTIAL CLEANUP</code> - Occurs if some of the children have been cleaned up</p>\n</li>\n</ul>" ], [ "DEAD_TIME", "NUMBER", "<p>Time since the process was marked dead or the session was marked killed (in seconds)</p>" ], [ "CLEANUP_ATTEMPTS", "NUMBER", "<p>Number of times PMON has attempted cleanup</p>" ], [ "LAST_ATTEMPT", "NUMBER", "<p>How long ago the last cleanup attempt occurred (in seconds)</p>" ], [ "CLEANUP_PROCESS", "RAW(8)", "<p>Process pointer for the cleanup process currently cleaning up this tree (can join with <code>V$CLEANUP_PROCESS</code>). It will be NULL if cleanup is not currently in progress or if the owner is responsible for cleanup.</p>" ], [ "CLEANUP_TIME", "NUMBER", "<p>Total amount of time PMON has spent on cleanup of the process/session (in seconds)</p>" ], [ "NUM_BLOCKED", "NUMBER", "<p>Number of sessions blocked on cleanup of this session</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]