[ [ "ADDR", "RAW(8)", "<p>For internal use only</p>" ], [ "INDX", "NUMBER", "<p>For internal use only</p>" ], [ "INST_ID", "NUMBER", "<p>For internal use only</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "ADR_PATH_IDX", "VARCHAR2(445)", "<p>For internal use only</p>" ], [ "ADR_HOME", "VARCHAR2(445)", "<p>Path to the current ADR home</p>" ], [ "PROBLEM_ID", "NUMBER", "<p>Displays the ID for the current problem</p>" ], [ "PROBLEM_KEY", "VARCHAR2(552)", "<p>Displays the problem key for the current problem</p>" ], [ "FIRST_INCIDENT", "NUMBER", "<p>Displays the first incident ID for the current problem</p>" ], [ "FIRSTINC_TIME", "TIMESTAMP(9) WITH TIME ZONE", "<p>Displays the timestamp when the first incident occurred for the current problem</p>" ], [ "LAST_INCIDENT", "NUMBER", "<p>Displays the last incident ID for the current problem</p>" ], [ "LASTINC_TIME", "TIMESTAMP(9) WITH TIME ZONE", "<p>Displays the timestamp when the last incident occurred for the current problem</p>" ], [ "IMPACT1", "NUMBER", "<p>Displays the first impact for the current problem</p>" ], [ "IMPACT2", "NUMBER", "<p>Displays the second impact for the current problem</p>" ], [ "IMPACT3", "NUMBER", "<p>Displays the third impact for the current problem</p>" ], [ "IMPACT4", "NUMBER", "<p>Displays the fourth impact for the current problem</p>" ], [ "SERVICE_REQUEST", "VARCHAR2(66)", "<p>Displays the service request number for the current problem, if a number has been entered in Support Workbench</p>" ], [ "BUG_NUMBER", "VARCHAR2(66)", "<p>Displays the bug number for the current problem, if a number has been entered in Support Workbench</p>" ], [ "CON_UID", "NUMBER", "<p>Displays the container unique ID to which the data pertains</p>" ] ]