[ [ "PNUM", "NUMBER", "<p>Oracle process number</p>" ], [ "SVRNAME", "VARCHAR2(255)", "<p>NFS server name</p>" ], [ "PATH", "VARCHAR2(255)", "<p>Network path to the NFS server specified by IP address or by name</p>" ], [ "LOCAL", "VARCHAR2(255)", "<p>Local path on the database host specified by IP address or by name</p>" ], [ "CH_ID", "NUMBER", "<p>Direct NFS channel identifier</p>" ], [ "SVR_ID", "NUMBER", "<p>Direct NFS server identifier</p>" ], [ "SENDS", "NUMBER", "<p>Send operations over the channel since the last select</p>" ], [ "RECVS", "NUMBER", "<p>Receive operations over the channel since the last select</p>" ], [ "PINGS", "NUMBER", "<p>Ping operations over the channel since the last select</p>" ], [ "SPRECO", "NUMBER", "<p>Reconnects for the channel on the same port since the last select, given that the reconnect occurred during the first series of reconnect attempts. If the first series of reconnect attempts fails and the reconnect process on that channel times out for 5 minutes, the next reconnect on that channel will not increment either the <code>SPRECO</code> or <code>DPRECO</code> columns, regardless of the port connected to.</p>" ], [ "DPRECO", "NUMBER", "<p>Reconnects for the channel on a different port since the last select, given that the reconnect occurred during the first series of reconnect attempts. If the first series of reconnect attempts fails and the reconnect process on that channel times out for 5 minutes, the next reconnect on that channel will not increment either the <code>SPRECO</code> or <code>DPRECO</code> columns, regardless of the port connected to.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "RDMA", "NUMBER", "<p>Indicates whether RDMA is enabled for the channel or not. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: RDMA is not enabled for the channel</p>\n</li>\n<li>\n<p><code>1</code>: RDMA is enabled for the channel</p>\n</li>\n</ul>" ], [ "RDMA_CREDITS", "NUMBER", "<p>The number of RDMA credits supported by the server</p>" ], [ "CLIENTPORT", "NUMBER", "<p>The client port to which the channel is bounded</p>" ], [ "ACTIVE_SPEED", "NUMBER", "<p>The active speed of the HCA card present (in Gb/second)</p>" ], [ "PEAK_FMR", "NUMBER", "<p>The size of fast memory registration (FMR) memory registered by the channel (in bytes)</p>" ], [ "CURRENT_FMR", "NUMBER", "<p>The current FMR memory registered (in bytes)</p>" ], [ "FMRREG_COUNT", "NUMBER", "<p>The number of FMR memory registration calls for the channel</p>" ] ]