[ [ "REPORT", "VARCHAR2(400)", "<p>Name of the EM Express report. All EM Express reports are XML reports with this format: %/orarep/<span class=\"italic\">component</span>/<span class=\"italic\">report</span></p>" ], [ "COUNT", "NUMBER", "<p>Number of requests captured by the EM Express servlet for this report since the last time the database instance was restarted</p>" ], [ "LOGIN_ELAPSED_TIME", "NUMBER", "<p>Accumulated elapsed time for logging into the database across all requests for this report since the last time the database instance was restarted</p>" ], [ "INITREQ_ELAPSED_TIME", "NUMBER", "<p>Accumulated elapsed time for initializing and preparing requests across all requests for this report since the last time the database instance was restarted</p>" ], [ "SQL_ELAPSED_TIME", "NUMBER", "<p>Accumulated elapsed time for all requests that ran SQL queries for this report since the last time the database instance was restarted</p>" ], [ "SEND_ELAPSED_TIME", "NUMBER", "<p>Accumulated elapsed time for streaming and sending the query result back to the client browser across all requests for this report since the last time the database instance was restarted</p>" ], [ "TOTAL_ELAPSED_TIME", "NUMBER", "<p>Accumulated total elapsed time across all requests for this report since the last time the database instance was restarted</p>" ], [ "LAST_REQ_TIME", "DATE", "<p>Timestamp of the last request for this report since the last time the database instance was restarted</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]