[ [ "WRL_TYPE", "VARCHAR2(20)", "<p>Type of the wallet resource locator (for example, <code>FILE</code>)</p>" ], [ "WRL_PARAMETER", "VARCHAR2(4000)", "<p>Parameter of the wallet resource locator (for example, absolute directory location of the wallet or keystore, if <code>WRL_TYPE</code> = <code>FILE</code>)</p>" ], [ "STATUS", "VARCHAR2(30)", "<p>Status of the wallet:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CLOSED</code></p>\n</li>\n<li>\n<p><code>NOT_AVAILABLE</code></p>\n</li>\n<li>\n<p><code>OPEN</code></p>\n</li>\n<li>\n<p><code>OPEN_NO_MASTER_KEY</code></p>\n</li>\n<li>\n<p><code>OPEN_UNKNOWN_MASTER_KEY_STATUS</code></p>\n</li>\n</ul>" ], [ "WALLET_TYPE", "VARCHAR2(20)", "<p>Displays the type of keystore being used, <code>HSM</code> or <code>SOFTWARE_KEYSTORE</code>.</p>\n<p>If the keystore was created with the mkstore utility, then the <code>WALLET_TYPE</code> is <code>UNKNOWN</code>.</p>" ], [ "WALLET_ORDER", "VARCHAR2(9)", "<p>If only a single wallet is configured, the value in this column is <code>SINGLE</code>.</p>\n<p>When more than one wallet is configured, the value in this column shows whether the wallet is primary (holds the current master key) or secondary (holds old keys). The lookup of the master key will happen in the primary keystore first, and then in the secondary keystore, if required.</p>\n<p>Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>PRIMARY</code></p>\n</li>\n<li>\n<p><code>SECONDARY</code></p>\n</li>\n</ul>\n<p>If there is only one type of keystore (Hardware Security Module or Software Keystore) being used, then <code>PRIMARY</code> will appear.</p>\n<p>If both types are used, then the value in this column shows the order in which each keystore will be looked up.</p>" ], [ "FULLY_BACKED_UP", "VARCHAR2(9)", "<p>Indicates whether all the keys in the keystore have been backed up</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]