[ [ "NAME", "VARCHAR2(513)", "<p>The fast-start failover observer name</p>" ], [ "REGISTERED", "VARCHAR2(4)", "<p>Indicates if this observer is registered (<code>YES</code>) or not (<code>NO</code>). Note that the observer is registered <span class=\"italic\">only</span> if <code>HOST</code> is not <code>NULL</code>.</p>" ], [ "HOST", "VARCHAR2(513)", "<p>The name of the host where this observer is running</p>" ], [ "ISMASTER", "VARCHAR2(4)", "<p>Indicates if this observer is the master observer (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "TIME_SELECTED", "TIMESTAMP(9)", "<p>Shows when this observer became master observer, if <code>ISMASTER</code> is <code>YES</code>; otherwise the following constant appears:</p>\n<p><code>1990&ndash;01&ndash;01 00:00:00.00</code></p>" ], [ "PINGING_PRIMARY", "VARCHAR2(4)", "<div class=\"p\">Possible values:\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: Observer is currently connected to the primary database</p>\n</li>\n<li>\n<p><code>NO</code>: Observer is not connected to the primary database</p>\n</li>\n</ul>\n</div>\n<p><span class=\"bold\">Note</span>: This field is consistent throughout an Oracle Real Application Clusters (Oracle RAC) environment; that is, if the observer is connected to any instance of the primary database in the Oracle RAC environment, all instances will show a value of <code>YES</code>.</p>" ], [ "PINGING_TARGET", "VARCHAR2(4)", "<div class=\"p\">Possible values:\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code>: Observer is currently connected to the target standby database</p>\n</li>\n<li>\n<p><code>NO</code>: Observer is not connected to the target standby database</p>\n</li>\n</ul>\n</div>\n<p><span class=\"bold\">Note</span>: This field is consistent throughout an Oracle Real Application Clusters (Oracle RAC) environment; that is, if the observer is connected to any instance of the target standby database in the Oracle RAC environment, all instances will show a value of <code>YES</code>.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]