[ [ "HANG_ID", "NUMBER", "<p>A number identifying the hang including this session. This column can be used to join <code>V$HANG_INFO</code> with <code>V$HANG_SESSION_INFO</code>.</p>" ], [ "INSTANCE", "NUMBER", "<p>Instance number of the instance on which this session resides</p>" ], [ "SID", "NUMBER", "<p>Oracle session ID of this session</p>" ], [ "SERIAL#", "NUMBER", "<p>Oracle session serial number of this session</p>" ], [ "OSPID", "VARCHAR2(24)", "<p>Operating system process ID of this session</p>" ], [ "FATAL_BACKGROUND", "VARCHAR2(1)", "<p><code>Y</code> - Session is a critical background process</p>\n<p><code>N</code> - Session is not a critical background process</p>" ], [ "ROOT", "VARCHAR2(1)", "<p><code>Y</code> - This session is the victim or final blocker of the hang</p>\n<p><code>N</code> - This session is not the victim or final blocker of the hang</p>" ], [ "PNAME", "VARCHAR2(5)", "<p>Name of the victim or final blocker process</p>" ], [ "WAIT_EVENT_TEXT", "VARCHAR2(64)", "<p>Resource or event for which this session is waiting; set to <code>not in a wait</code> if the session is not waiting on a resource</p>" ], [ "QOS_PC_RANK", "VARCHAR2(12)", "<p>Session's Oracle Database Quality of Service (QoS) Management Performance Class rank</p>\n<p>See <a class=\"olink APQOS109\" target=\"_blank\" href=\"../APQOS/intro-to-oracle-db-qos-management.htm#APQOS109\"><span><cite>Oracle Database Quality of Service Management User's Guide</cite></span></a> for more information about Oracle Database QoS Management.</p>" ], [ "QOS_PC_ITT", "NUMBER", "<p>Session's Oracle Database Quality of Service (QoS) Management Performance Class In-Trouble Threshold</p>" ], [ "QOS_PC_RTT", "NUMBER", "<p>Session's Oracle Database Quality of Service (QoS) Management Performance Class Root Termination allowed Threshold</p>" ], [ "QOS_PC_KEY", "NUMBER", "<p>Session's Oracle Database Quality of Service (QoS) Management Performance Class Key</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]