[ [ "INDEX_STATS_ENABLED", "NUMBER", "<p>Indicates whether the index usage statistics are enabled. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: Index statistics are disabled</p>\n</li>\n<li>\n<p><code>1</code>: Index statistics are enabled</p>\n</li>\n</ul>" ], [ "INDEX_STATS_COLLECTION_TYPE", "NUMBER", "<p>Indicates the type of collection used for the index usage statistics. Possible values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: Indicates the ALL collection type. With this type of collection, the statistics are collected for each execution that has index access. Selecting this statistics collection type may have some impact on performance.</p>\n</li>\n<li>\n<p><code>1</code>: Indicates the SAMPLED collection type. With this type of collection, the statistics are collected based on sampling (only a few of the executions are considered when collecting the statistics). This is the default statistics collection type.</p>\n<p>Index statistics collected with the SAMPLED collection type are less accurate than index statistics collected with the ALL collection type.</p>\n</li>\n</ul>" ], [ "ACTIVE_ELEM_COUNT", "NUMBER", "<p>The number of active indexes since the last flush</p>" ], [ "ALLOC_ELEM_COUNT", "NUMBER", "<p>The number of index entries allocated</p>" ], [ "MAX_ELEM_COUNT", "NUMBER", "<p>The maximum number of active indexes that can be tracked</p>" ], [ "FLUSH_COUNT", "NUMBER", "<p>Number of successful flushes since the database started</p>" ], [ "TOTAL_FLUSH_DURATION", "NUMBER", "<p>Cumulative elapsed time taken to complete the index usage statistics flush since the database start</p>" ], [ "LAST_FLUSH_TIME", "TIMESTAMP(3)", "<p>The time of the last flush</p>" ], [ "STATUS_MSG", "VARCHAR2(256)", "<p>Status messages, if any. Flush errors are reported here.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This row is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]