[ [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire multitenant container database (CDB). This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "TABLESPACE_NAME", "VARCHAR2(128)", "<p>IM FastStart tablespace name. When IM FastStart is not enabled, the value of <code>TABLESPACE_NAME</code> is <code>INVALID_TABLESPACE</code> and the value of <code>STATUS</code> is <code>DISABLE</code>.</p>" ], [ "STATUS", "VARCHAR2(10)", "<p>IM FastStart status. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>ENABLE</code>: An IM FastStart tablespace has been specified and the content of the IM column is being periodically checkpointed to disk.</p>\n</li>\n<li>\n<p><code>ENABLING</code>: An IM FastStart tablespace has been specified and the database is creating the IM FastStart area.</p>\n</li>\n<li>\n<p><code>DISABLE</code>: An IM FastStart tablespace has not been specified. This is the default.</p>\n</li>\n<li>\n<p><code>MIGRATING</code>: A user has requested the IM FastStart area be migrated from one tablespace to another.</p>\n</li>\n<li>\n<p><code>DISABLING</code>: A user has requested IM FastStart to be disabled.</p>\n</li>\n</ul>" ], [ "ALLOCATED_SIZE", "NUMBER", "<p>The allocated size of an IM FastStart tablespace in bytes</p>" ], [ "USED_SIZE", "NUMBER", "<p>The currently used size of an IM FastStart area (in bytes) within the tablespace.</p>" ], [ "LAST_CHECKPOINT_TIME", "TIMESTAMP(6)", "<p>The time when the last IMCU was checkpointed to the IM FastStart area</p>" ], [ "LAST_POPULATE_TIME", "TIMESTAMP(6)", "<p>The time of the last population from the IM FastStart area</p>" ], [ "NUM_DEFERRED_WRITES", "NUMBER", "<p>The number of pending deferred writes to the IM FastStart area</p>" ] ]