[ [ "ADDR", "RAW(4 | 8)", "<p>Address of the latch object</p>" ], [ "LATCH#", "NUMBER", "<p>Latch number of the parent latch</p>" ], [ "CHILD#", "NUMBER", "<p>Child latch number (unique only to each parent latch)</p>" ], [ "LEVEL#", "NUMBER", "<p>Latch level</p>" ], [ "NAME", "VARCHAR2(64)", "<p>Latch name</p>" ], [ "HASH", "NUMBER", "<p>Latch hash</p>" ], [ "GETS", "NUMBER", "<p>Number of times the latch was requested in willing-to-wait mode</p>" ], [ "MISSES", "NUMBER", "<p>Number of times the latch was requested in willing-to-wait mode and the requester had to wait</p>" ], [ "SLEEPS", "NUMBER", "<p>Number of times a willing-to-wait latch request resulted in a session sleeping while waiting for the latch</p>" ], [ "IMMEDIATE_GETS", "NUMBER", "<p>Number of times a latch was requested in no-wait mode</p>" ], [ "IMMEDIATE_MISSES", "NUMBER", "<p>Number of times a no-wait latch request did not succeed (that is, missed)</p>" ], [ "WAITERS_WOKEN", "NUMBER", "<p>This column has been deprecated and is present only for compatibility with previous releases of Oracle. No data is accumulated for this column; it will always have a value of zero.</p>" ], [ "WAITS_HOLDING_LATCH", "NUMBER", "<p>This column has been deprecated and is present only for compatibility with previous releases of Oracle. No data is accumulated for this column; it will always have a value of zero.</p>" ], [ "SPIN_GETS", "NUMBER", "<p>Willing-to-wait latch requests which missed the first try but succeeded while spinning</p>" ], [ "SLEEP[1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11]", "NUMBER", "<p>These columns have been deprecated and are present only for compatibility with previous releases of Oracle. No data is accumulated for these columns; they will always have a value of zero. As a substitute for these columns you can query the appropriate rows of the <code>V$EVENT_HISTOGRAM</code> view where the <code>EVENT</code> column has a value of <code>latch free</code> or <code>latch:%</code>.</p>" ], [ "WAIT_TIME", "NUMBER", "<p>Elapsed time spent waiting for the latch (in microseconds)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]