[ [ "PRIMARY_DBID", "NUMBER", "<p>Database ID (DBID) of the primary database</p>" ], [ "PRIMARY_CON_DBID", "NUMBER", "<p>This column indicates the DBID of the source database or source PDB corresponding to the database (or CDB) from which this column is queried.For a non-CDB and the root of a CDB, this column matches the <code>PRIMARY_DBID</code> column.For a maintained PDB, this column indicates the DBID for the corresponding PDB at the source.For a skipped PDB or a local PDB, this column would be <code>NULL</code>.</p>" ], [ "SESSION_ID", "NUMBER", "<p>LogMiner session ID allocated to SQL Apply.</p>" ], [ "REALTIME_APPLY", "VARCHAR2(64)", "<p><code>Y</code> indicates that SQL Apply is running in real-time apply mode. If a standby redo log is configured, SQL Apply applies changes as they are written to the standby redo log files. <code>N</code> indicates that SQL Apply applies changes as each archived redo log file is received.</p>" ], [ "STATE", "VARCHAR2(64)", "<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code>: LogMiner session has been created and coordinator has attached to it</p>\n</li>\n<li>\n<p><code>LOADING DICTIONARY</code>: SQL Apply is loading the LogMiner dictionary</p>\n</li>\n<li>\n<p><code>WAITING ON GAP</code>: SQL Apply is waiting for a log file to be sent from the primary database</p>\n</li>\n<li>\n<p><code>APPLYING</code>: SQL Apply is actively mining or applying transactions</p>\n</li>\n<li>\n<p><code>WAITING FOR DICTIONARY LOGS</code>: SQL Apply is waiting for the archived logs containing the LogMiner dictionary to be shipped from the primary database</p>\n</li>\n<li>\n<p><code>IDLE</code>: SQL Apply has applied all changes available at the logical standby, and is caught up with the primary database</p>\n</li>\n</ul>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]