[ [ "SESSION_ID", "NUMBER", "<p>Unique identifier for the LogMiner persistent sessions</p>" ], [ "NAME", "VARCHAR2(64)", "<p>Name of the LogMiner statistic, state, or status, including:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Bytes of Redo Processed - Cumulative count of bytes processed by SQL Apply</p>\n</li>\n<li>\n<p>Redo Records Processed - Count of redo records processed by SQL Apply</p>\n</li>\n<li>\n<p>Txns Delivered to Client - Count of SQL transactions processed by SQL Apply</p>\n</li>\n<li>\n<p>DML txns delivered - Count of DML transactions processed by SQL Apply</p>\n</li>\n<li>\n<p>DDL txns delivered - Count of DDL transactions processed by SQL Apply</p>\n</li>\n<li>\n<p>CTAS txns delivered - Count of <code>CREATE TABLE AS SELECT</code> (CTAS) transactions processed by SQL Apply</p>\n</li>\n<li>\n<p>Recursive txns delivered - Count of recursive transactions processed by SQL Apply</p>\n</li>\n<li>\n<p>Rolled back txns seen</p>\n</li>\n<li>\n<p>LCRs delivered to client - Number of logical change records (LCRs) processed by SQL Apply</p>\n</li>\n<li>\n<p>Bytes paged out - Cumulative count of bytes that have been paged out. LogMiner pages out memory from the LCR cache to accommodate certain ill-behaved workloads or under-configured systems. The ratio of bytes paged out to bytes of redo processed should be low. If this ratio is high (10% or higher), try increasing the <code>MAX_SGA</code> allocated to SQL Apply.</p>\n</li>\n<li>\n<p>Microsecs spent in pageout - Time spent by LogMiner paging out memory from the LCR cache</p>\n</li>\n<li>\n<p>Bytes checkpointed - Keeps track of the amount of bytes checkpointed. The mining engine takes periodic checkpoints, whereby it writes out logical change records (LCRs) pertaining to long-running transactions. The ratio of <code>Bytes Checkpointed</code> to <code>Bytes of Redo Processed</code> should be low. A high ratio (10% or higher) indicates an ill-behaved workload.</p>\n</li>\n<li>\n<p>Microsecs spent in checkpoint - Time spent by the mining engine taking checkpoints, whereby it writes out logical change records (LCRs) pertaining to long-running transactions.</p>\n</li>\n<li>\n<p>Bytes rolled back - Cumulative value of the number of bytes rolled back by LogMiner. There are times that LogMiner needs to backtrack and reprocess a section of the redo stream. In this case, it will roll back work it has already done. The ratio of <code>Bytes Rolled Back</code> to <code>Bytes of Redo Processed</code> should be low. If this ratio is high (10% or higher), reduce the number of <code>PREPARER</code> processes allocated to SQL Apply.</p>\n</li>\n<li>\n<p>Microsecs spent in rollback - Time spent rolling back transactions already applied to the logical standby database</p>\n</li>\n</ul>" ], [ "VALUE", "VARCHAR2(64)", "<p>The corresponding metric value</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]