[ [ "MTTR_TARGET_FOR_ESTIMATE", "NUMBER", "<p>MTTR setting being simulated. Equal to the current MTTR setting if this is the first row of the view.</p>" ], [ "ADVICE_STATUS", "VARCHAR2(5)", "<p>Current status of MTTR simulation:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>ON</code></p>\n</li>\n<li>\n<p><code>READY</code></p>\n</li>\n<li>\n<p><code>OFF</code></p>\n</li>\n</ul>" ], [ "DIRTY_LIMIT", "NUMBER", "<p>Dirty buffer limit derived from the MTTR being simulated</p>" ], [ "ESTD_CACHE_WRITES", "NUMBER", "<p>Estimated number of cache physical writes under this MTTR</p>" ], [ "ESTD_CACHE_WRITE_FACTOR", "NUMBER", "<p>Estimated cache physical write ratio under this MTTR. It is the ratio of the estimated number of cache writes to the number of cache writes under the current MTTR setting.</p>" ], [ "ESTD_TOTAL_WRITES", "NUMBER", "<p>Estimated total number of physical writes under this MTTR</p>" ], [ "ESTD_TOTAL_WRITE_FACTOR", "NUMBER", "<p>Estimated total physical write ratio under this MTTR. It is the ratio of the estimated total number of physical writes to the total number of physical writes under the current MTTR setting.</p>" ], [ "ESTD_TOTAL_IOS", "NUMBER", "<p>Estimated total number of I/Os under this MTTR</p>" ], [ "ESTD_TOTAL_IO_FACTOR", "NUMBER", "<p>Estimated total I/O ratio under this MTTR. It is the ratio of the estimated total number of I/Os to the total number of I/Os under the current MTTR setting.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]