[ [ "NUM", "NUMBER", "<p>Parameter number</p>" ], [ "NAME", "VARCHAR2(80)", "<p>Name of the parameter</p>" ], [ "TYPE", "NUMBER", "<p>Parameter type:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>1</code> - Boolean</p>\n</li>\n<li>\n<p><code>2</code> - String</p>\n</li>\n<li>\n<p><code>3</code> - Integer</p>\n</li>\n<li>\n<p><code>4</code> - Parameter file</p>\n</li>\n<li>\n<p><code>5</code> - Reserved</p>\n</li>\n<li>\n<p><code>6</code> - Big integer</p>\n</li>\n</ul>" ], [ "VALUE", "VARCHAR2(4000)", "<p>Parameter value for the session (if modified within the session); otherwise, the instance-wide parameter value</p>" ], [ "DISPLAY_VALUE", "VARCHAR2(4000)", "<p>Parameter value in a user-friendly format. For example, if the <code>VALUE</code> column shows the value <code>262144</code> for a big integer parameter, then the <code>DISPLAY_VALUE</code> column will show the value <code>256K</code>.</p>" ], [ "DEFAULT_VALUE", "VARCHAR2(255)", "<p>The default value for this parameter. This is the value of the parameter if a value is not explicitly specified for the parameter.</p>" ], [ "ISDEFAULT", "VARCHAR2(9)", "<p>Indicates whether the parameter is set to the default value (<code>TRUE</code>) or the parameter value was specified in the parameter file (<code>FALSE</code>).</p>\n<p>The database sets the value of the <code>ISDEFAULT</code> column to <code>TRUE</code> for parameters that are not specified in the init.ora or server parameter file (SPFILE).</p>" ], [ "ISSES_MODIFIABLE", "VARCHAR2(5)", "<p>Indicates whether the parameter can be changed with <code>ALTER SESSION</code> (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "ISSYS_MODIFIABLE", "VARCHAR2(9)", "<p>Indicates whether the parameter can be changed with <code>ALTER SYSTEM</code> and when the change takes effect:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>IMMEDIATE</code> - Parameter can be changed with <code>ALTER SYSTEM</code> regardless of the type of parameter file used to start the instance. The change takes effect immediately.</p>\n</li>\n<li>\n<p><code>DEFERRED</code> - Parameter can be changed with <code>ALTER SYSTEM</code> regardless of the type of parameter file used to start the instance. The change takes effect in subsequent sessions.</p>\n</li>\n<li>\n<p><code>FALSE</code> - Parameter cannot be changed with <code>ALTER SYSTEM</code> unless a server parameter file was used to start the instance. The change takes effect in subsequent instances.</p>\n</li>\n</ul>" ], [ "ISPDB_MODIFIABLE", "VARCHAR2(5)", "<p>Indicates whether the parameter can be modified inside a PDB (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "ISINSTANCE_MODIFIABLE", "VARCHAR2(5)", "<p>For parameters that can be changed with <code>ALTER SYSTEM</code>, indicates whether the value of the parameter can be different for every instance (<code>TRUE</code>) or whether the parameter must have the same value for all Real Application Clusters instances (<code>FALSE</code>). If the <code>ISSYS_MODIFIABLE</code> column is <code>FALSE</code>, then this column is always <code>FALSE</code>.</p>" ], [ "ISMODIFIED", "VARCHAR2(10)", "<p>Indicates whether the parameter has been modified after instance startup:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>MODIFIED</code> - Parameter has been modified with <code>ALTER SESSION</code></p>\n</li>\n<li>\n<p><code>SYSTEM_MOD</code> - Parameter has been modified with <code>ALTER SYSTEM</code> (which causes all the currently logged in sessions' values to be modified)</p>\n</li>\n<li>\n<p><code>FALSE</code> - Parameter has not been modified after instance startup</p>\n</li>\n</ul>" ], [ "ISADJUSTED", "VARCHAR2(5)", "<p>Indicates whether Oracle adjusted the input value to a more suitable value (for example, the parameter value should be prime, but the user input a non-prime number, so Oracle adjusted the value to the next prime number)</p>" ], [ "ISDEPRECATED", "VARCHAR2(5)", "<p>Indicates whether the parameter has been deprecated (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "ISBASIC", "VARCHAR2(5)", "<p>Indicates whether the parameter is a basic parameter (<code>TRUE</code>) or not (<code>FALSE</code>)</p>" ], [ "DESCRIPTION", "VARCHAR2(255)", "<p>Description of the parameter</p>" ], [ "UPDATE_COMMENT", "VARCHAR2(255)", "<p>Comments associated with the most recent update</p>" ], [ "HASH", "NUMBER", "<p>Hash value for the parameter name</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]