[ [ "STATISTIC", "VARCHAR2(30)", "<p>Name of the statistic:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Queries Parallelized</code> - Number of queries run in parallel</p>\n</li>\n<li>\n<p><code>DDL Parallelized</code> - Number of DDL operations run in parallel</p>\n</li>\n<li>\n<p><code>DML Parallelized</code> - Number of DML operations run in parallel</p>\n</li>\n<li>\n<p><code>DFO Trees</code> - Number of executed DFO trees</p>\n</li>\n<li>\n<p><code>DOP</code> - Degree of parallelism used for the last statement</p>\n</li>\n<li>\n<p><code>Server Threads</code> - Number of PX servers used</p>\n</li>\n<li>\n<p><code>Allocation Height</code> - Requested number of servers per instance</p>\n</li>\n<li>\n<p><code>Allocation Width</code> - Requested number of instances</p>\n</li>\n<li>\n<p><code>Local Msgs Sent</code> - Number of local (intra-instance) messages sent</p>\n</li>\n<li>\n<p><code>Distr Msgs Sent</code> - Number of remote (inter-instance) messages sent</p>\n</li>\n<li>\n<p><code>Local Msgs Recv'd</code> - Number of local (intra-instance) messages received</p>\n</li>\n<li>\n<p><code>Distr Msgs Recv'd</code> - Number of remote (inter-instance) messages received</p>\n</li>\n<li>\n<p><code>Slave Sets</code> - Total number of slave sets used for the last statement. For multiple parallelizers in the parallel plan, it is the cumulative count.</p>\n</li>\n</ul>" ], [ "LAST_QUERY", "NUMBER", "<p>Value of the statistic for the last operation</p>" ], [ "SESSION_TOTAL", "NUMBER", "<p>Value of the statistic for the entire session to this point in time.</p>\n<p>The value of the statistic for the entire session to this point in time is not maintained for the <code>DOP</code>, <code>Server Threads</code>, <code>Allocation Height</code>, <code>Allocation Width</code>, and <code>Slave Set</code> statistics.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]