[ [ "STATISTIC", "VARCHAR2(30)", "<p>Name of the statistic:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Servers Busy</code> - Number of currently busy servers on this instance</p>\n</li>\n<li>\n<p><code>Servers Idle</code> - Number of currently idle servers on this instance</p>\n</li>\n<li>\n<p><code>Servers Highwater</code> - Number of active servers on this instance that have partaken in &gt;= 1 operation so far</p>\n</li>\n<li>\n<p><code>Server Sessions</code> - Total number of operations executed in all servers on this instance</p>\n</li>\n<li>\n<p><code>Servers Started</code> - Total number of servers started on this instance</p>\n</li>\n<li>\n<p><code>Servers Shutdown</code> - Total number of servers shutdown on this instance</p>\n</li>\n<li>\n<p><code>Servers Cleaned Up</code> - Total number of servers on this instance cleaned up due to process death</p>\n</li>\n<li>\n<p><code>Queries Initiated</code> - Total number of parallel queries initiated on this instance</p>\n</li>\n<li>\n<p><code>DDL Initiated</code> - Total number of parallel DDL operations that were initiated</p>\n</li>\n<li>\n<p><code>DML Initiated</code> - Total number of parallel DML operations that were initiated</p>\n</li>\n<li>\n<p><code>DFO Trees</code> - Total number of DFO trees executed on this instance</p>\n</li>\n<li>\n<p><code>Local Msgs Sent</code> - Total number of local (intra-instance) messages sent on this instance</p>\n</li>\n<li>\n<p><code>Distr Msgs Sent</code> - Total number of remote (inter-instance) messages sent on this instance</p>\n</li>\n<li>\n<p><code>Local Msgs Recv'd</code> - Total number of remote (inter-instance) messages received on this instance</p>\n</li>\n<li>\n<p><code>Distr Msgs Recv'd</code> - Total number of remote (inter-instance) messages received on this instance</p>\n</li>\n</ul>" ], [ "VALUE", "NUMBER", "<p>Value of the statistic</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]