[ [ "ALGORITHM_ID", "NUMBER", "<p>Algorithm ID</p>" ], [ "ALGORITHM_NAME", "VARCHAR2(64)", "<p>Name of the algorithm (for example, <code>LOW</code>, <code>MEDIUM</code>, <code>DEFAULT</code>, or <code>HIGH</code>)</p>" ], [ "INITIAL_RELEASE", "VARCHAR2(18)", "<p>First Oracle Database release when this compression algorithm was available</p>" ], [ "TERMINAL_RELEASE", "VARCHAR2(18)", "<p>Last Oracle Database release that supported using this compression algorithm to create new backups. Existing backups can always be restored, even if they use a deprecated compression algorithm.</p>" ], [ "ALGORITHM_DESCRIPTION", "VARCHAR2(64)", "<p>Description of the algorithm</p>" ], [ "ALGORITHM_COMPATIBILITY", "VARCHAR2(18)", "<p>Required database compatibility level for the algorithm (for example, 11.2.0 for <code>DEFAULT</code>)</p>" ], [ "IS_VALID", "VARCHAR2(3)", "<p>Indicates whether the algorithm is valid with regard to the compatibility setting (<code>YES</code>) or not (<code>NO</code>). The value is <code>YES</code> if <code>ALGORITHM_COMPATIBILITY</code> &lt;= <code>DATABASE_COMPATIBILITY</code>.</p>" ], [ "REQUIRES_ACO", "VARCHAR2(3)", "<p>Indicates whether the algorithm requires the Advanced Compression Option (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "IS_DEFAULT", "VARCHAR2(3)", "<p>Indicates whether the algorithm is the default compression algorithm that RMAN uses to create compressed backup sets (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]