[ [ "SID", "NUMBER", "<p>Session identifier</p>" ], [ "CURRENT_CONSUMER_GROUP_ID", "NUMBER", "<p>Object ID of the consumer group in which the session currently belongs; NULL if the session has not yet logged in</p>" ], [ "CURRENT_CONSUMER_GROUP", "VARCHAR2(32)", "<p>The name of the consumer group in which the session currently belongs</p>" ], [ "ORIG_CONSUMER_GROUP_ID", "NUMBER", "<p>Object ID of the consumer group in which the session was placed by the consumer group mappings; NULL if the session has not yet logged in</p>\n<p>This group may not be the current group because the <code>SWITCH_GROUP</code> directive in the current plan may have changed the session's current group. This group may not equal the <code>MAPPED_CONSUMER_GROUP</code> because the <code>MAPPED_CONSUMER_GROUP</code> may not be part of the current plan.</p>" ], [ "MAPPING_ATTRIBUTE", "VARCHAR2(32)", "<p>Session attribute that was used to map the session into its original consumer group; NULL if no mapping was used</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"DBA_RSRC_GROUP_MAPPINGS.htm#GUID-E5F70323-3F17-4B98-BB9A-C934CA419245\">DBA_RSRC_GROUP_MAPPINGS</a>\"</span> for more details</p>" ], [ "MAPPED_CONSUMER_GROUP", "VARCHAR2(32)", "<p>Consumer group to which the session was originally mapped; NULL if no mapping was used</p>\n<p>This may not correspond to the original consumer group, because the mapped group may not be part of the current plan.</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"DBA_RSRC_GROUP_MAPPINGS.htm#GUID-E5F70323-3F17-4B98-BB9A-C934CA419245\">DBA_RSRC_GROUP_MAPPINGS</a>\"</span> for more details</p>" ], [ "STATE", "VARCHAR2(32)", "<p>Current state of the session:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NOT MANAGED</code> - Session has not logged in or the current Resource Manager plan does not require the session to be managed at this point in time</p>\n</li>\n<li>\n<p><code>RUNNING</code> - Session is currently running on the CPU</p>\n</li>\n<li>\n<p><code>WAITING FOR CPU</code> - Session is ready to run. It is waiting for a CPU quantum to run.</p>\n</li>\n<li>\n<p><code>QUEUED</code> - Session is queued because the active session limit was reached</p>\n</li>\n<li>\n<p><code>IDLE</code> - Session is idle</p>\n</li>\n<li>\n<p><code>IDLE BLKR</code> - Session is idle and blocking another session</p>\n</li>\n<li>\n<p><code>WAITING</code> - Session is currently in a wait</p>\n<p><span class=\"bold\">See Also:</span> <span class=\"q\">\"<a href=\"V-SESSION_WAIT.htm#GUID-4EDAB293-F3FC-40FE-BC75-4FEE6A4D7705\">V$SESSION_WAIT</a>\"</span> for the wait type</p>\n</li>\n<li>\n<p><code>WAITING_FOR_IO</code> - Session is waiting to submit an I/O request</p>\n</li>\n<li>\n<p><code>UNBOUND</code> - Session is not bound to any process</p>\n</li>\n<li>\n<p><code>EXITING</code> - Session is about to terminate</p>\n</li>\n</ul>" ], [ "ACTIVE", "VARCHAR2(5)", "<p>Indicates whether the session is currently active (<code>TRUE</code>) or not (<code>FALSE</code>). This includes when one of the following conditions is true:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Session is in the top call</p>\n</li>\n<li>\n<p>Session has a transaction in progress</p>\n</li>\n<li>\n<p>Session is using temporary space objects</p>\n</li>\n<li>\n<p>Session holds user enqueues</p>\n</li>\n</ul>" ], [ "CURRENT_IDLE_TIME", "NUMBER", "<p>Number of seconds the session has been idle (in states <code>IDLE</code> or <code>IDLE BLKR</code>) while in this consumer group; NULL if the current Resource Manager plan does not require updating this statistic. This value is reset to zero when the session becomes active.</p>" ], [ "CURRENT_CPU_WAIT_TIME", "NUMBER", "<p>Amount of time (in milliseconds) the session has waited for CPU because of resource management (in state <code>WAIT FOR CPU</code>) while in the current consumer group; NULL if the current Resource Manager plan does not require updating this statistic. This does not include waits due to latch or enqueue contention, I/O waits, and so on. If <code>SWITCH_TIME_IN_CALL</code> is used, then this will be reset at the end of every call.</p>" ], [ "CPU_WAIT_TIME", "NUMBER", "<p>Cumulative amount of time (in milliseconds) the session has waited for CPU (in its lifetime) because of resource management. This does not include waits due to latch or enqueue contention, I/O waits, and so on.</p>" ], [ "CURRENT_CPU_WAITS", "NUMBER", "<p>Number of times the session had to wait for CPU because of resource management while in this consumer group; NULL if the current Resource Manager plan does not require updating this statistic. This does not include waits due to latch or enqueue contention, I/O waits, and so on. If <code>SWITCH_TIME_IN_CALL</code> is used, then this will be reset at the end of every call.</p>" ], [ "CPU_WAITS", "NUMBER", "<p>Cumulative number of times the session had to wait for CPU (in its lifetime) because of resource management. This does not include waits due to latch or enqueue contention, I/O waits, and so on.</p>" ], [ "CURRENT_CONSUMED_CPU_TIME", "NUMBER", "<p>Amount of CPU time (in milliseconds) consumed by the session while in the current consumer group; NULL if the current Resource Manager plan does not require updating this statistic. If <code>SWITCH_TIME_IN_CALL</code> is used, then this will be reset at the end of every call.</p>" ], [ "CONSUMED_CPU_TIME", "NUMBER", "<p>Cumulative amount of CPU time consumed by the session (in its lifetime) (in milliseconds)</p>" ], [ "CURRENT_ACTIVE_TIME", "NUMBER", "<p>Amount of time (in milliseconds) the session has been active while in the current consumer group; NULL if the current Resource Manager plan does not require updating this statistic. Active time is time spent running and waiting while executing a call. It does not include the time a session waited for CPU resources. If <code>SWITCH_TIME_IN_CALL</code> is used, then this is reset at the end of every call.</p>" ], [ "ACTIVE_TIME", "NUMBER", "<p>Cumulative amount of active time (in milliseconds) consumed by the session (in its lifetime)</p>" ], [ "CURRENT_QUEUED_TIME", "NUMBER", "<p>Amount of time (in milliseconds) the current request from the session has been queued (in state <code>QUEUED</code>). If the session does not have a request currently queued up, then this number will be zero.</p>" ], [ "QUEUED_TIME", "NUMBER", "<p>Total amount of time (in milliseconds) the session has spent in the QUEUED state (in its lifetime)</p>" ], [ "CURRENT_YIELDS", "NUMBER", "<p>Number of times the session had to yield the CPU to other sessions (due to quantum expiration) while in the current consumer group; NULL if the current Resource Manager plan does not require updating this statistic. If <code>SWITCH_TIME_IN_CALL</code> is used, then this is reset at the end of every call.</p>" ], [ "YIELDS", "NUMBER", "<p>Cumulative number of times the session had to yield CPU to other sessions due to quantum expiration (in its lifetime)</p>" ], [ "CURRENT_UNDO_CONSUMPTION", "NUMBER", "<p>Current amount (in KB) of undo consumed by the session; NULL if the current Resource Manager plan does not have an <code>UNDO_POOL</code> directive</p>" ], [ "MAX_UNDO_CONSUMPTION", "NUMBER", "<p>Maximum amount of undo consumed (in KB) during the session's lifetime. This value may not be updated because the current Resource Manager plan may not have an <code>UNDO_POOL</code> directive.</p>" ], [ "SQL_CANCELED", "NUMBER", "<p>Number of times SQL queries running in the session were canceled due to exceeding the Resource Manager plan's <code>SWITCH_TIME</code> limit.</p>" ], [ "QUEUE_TIME_OUTS", "NUMBER", "<p>Number of times requests from the session timed out because they queued longer than the Resource Manager plan's limit</p>" ], [ "ESTIMATED_EXECUTION_LIMIT_HIT", "NUMBER", "<p>Number of times requests from the session were not run because the optimizer's estimated time to execute the query exceeded the <code>MAX_EST_EXEC_TIME</code> limit</p>" ], [ "CURRENT_IO_SERVICE_TIME", "NUMBER", "<p>Current I/O wait time of the session (in milliseconds) for the current SQL operation</p>" ], [ "IO_SERVICE_TIME", "NUMBER", "<p>Cumulative amount of I/O wait time by the session (in its lifetime) (in milliseconds)</p>" ], [ "CURRENT_IO_SERVICE_WAITS", "NUMBER", "<p>Current I/O waits by session for the current SQL operation</p>" ], [ "IO_SERVICE_WAITS", "NUMBER", "<p>Cumulative I/O waits by session (in its lifetime)</p>" ], [ "CURRENT_SMALL_READ_MEGABYTES", "NUMBER", "<p>Number of single block megabytes read by the session for the current SQL operation</p>" ], [ "SMALL_READ_MEGABYTES", "NUMBER", "<p>Total number of single block megabytes read by the session (in its lifetime)</p>" ], [ "CURRENT_LARGE_READ_MEGABYTES", "NUMBER", "<p>Number of multiblock megabytes read by the session for the current SQL operation</p>" ], [ "LARGE_READ_MEGABYTES", "NUMBER", "<p>Total number of multiblock megabytes read by the session (in its lifetime)</p>" ], [ "CURRENT_SMALL_WRITE_MEGABYTES", "NUMBER", "<p>Number of single block megabytes written by the session for the current SQL operation</p>" ], [ "SMALL_WRITE_MEGABYTES", "NUMBER", "<p>Total number of single block megabytes written by the session (in its lifetime)</p>" ], [ "CURRENT_LARGE_WRITE_MEGABYTES", "NUMBER", "<p>Number of multiblock megabytes written by the session for the current SQL operation</p>" ], [ "LARGE_WRITE_MEGABYTES", "NUMBER", "<p>Total number of multiblock megabytes written by the session (in its lifetime)</p>" ], [ "CURRENT_SMALL_READ_REQUESTS", "NUMBER", "<p>Number of single block read requests by the session for the current SQL operation</p>" ], [ "SMALL_READ_REQUESTS", "NUMBER", "<p>Total number of single block read requests by the session (in its lifetime)</p>" ], [ "CURRENT_SMALL_WRITE_REQUESTS", "NUMBER", "<p>Number of single block write requests by the session for the current SQL operation</p>" ], [ "SMALL_WRITE_REQUESTS", "NUMBER", "<p>Total number of single block write requests by the session (in its lifetime)</p>" ], [ "CURRENT_LARGE_READ_REQUESTS", "NUMBER", "<p>Number of multiblock read requests by the session for the current SQL operation</p>" ], [ "LARGE_READ_REQUESTS", "NUMBER", "<p>Total number of multiblock read requests by the session (in its lifetime)</p>" ], [ "CURRENT_LARGE_WRITE_REQUESTS", "NUMBER", "<p>Number of multiblock write requests by the session for the current SQL operation</p>" ], [ "LARGE_WRITE_REQUESTS", "NUMBER", "<p>Total number of multiblock write requests by the session (in its lifetime)</p>" ], [ "CURRENT_PQ_ACTIVE_TIME", "NUMBER", "<p>Amount of time that the current active parallel statement has been executing for the current SQL operation, not including the amount of time that the statement has been queued (in milliseconds). If the parallel statement is queued, then the value is 0.</p>" ], [ "PQ_ACTIVE_TIME", "NUMBER", "<p>Cumulative amount of time that parallel statements have been executed over the lifetime of the session (in milliseconds)</p>" ], [ "DOP", "NUMBER", "<p>Degree of parallelism for the active or queued parallel statement, if there are any in the session</p>" ], [ "PQ_SERVERS", "NUMBER", "<p>The number of active parallel servers if the session is active and running the parallel query. If the query is queued, the number of parallel servers that this query is trying to run with is shown.</p>" ], [ "ESTIMATED_EXECUTION_TIME", "NUMBER", "<p>Estimated execution time for the parallel statement, as estimated by the optimizer (in milliseconds). You can compare this value to <code>CURRENT_PQ_ACTIVE_TIME</code> to estimate how much longer the parallel statement will run.</p>" ], [ "CURRENT_PQ_QUEUED_TIME", "NUMBER", "<p>Amount of time that the current parallel statement in the session has been queued (in milliseconds) for the current SQL operation. If the session does not have a queued parallel statement, then the value is 0.</p>" ], [ "PQ_QUEUED_TIME", "NUMBER", "<p>Total amount of time that the session has spent in the <code>PQ_QUEUED</code> state in its lifetime (in milliseconds)</p>" ], [ "PQ_QUEUED", "NUMBER", "<p>Number of times that parallel statements in the session have been queued</p>" ], [ "PQ_QUEUE_TIME_OUTS", "NUMBER", "<p>Number of times that parallel statements in the session timed out because their queue time exceeded the Resource Manager plan's <code>PARALLEL_QUEUE_TIMEOUT</code> limit</p>" ], [ "PQ_ACTIVE", "VARCHAR2(5)", "<p>Indicates whether the session is actively running a parallel statement (<code>TRUE</code>) or not (<code>FALSE</code>).</p>" ], [ "PQ_STATUS", "VARCHAR2(44)", "<p>The status of the parallel statement running in this session:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Active</code>: The parallel statement is currently active and running</p>\n</li>\n<li>\n<p><code>Queued</code>: The parallel statement is queued and is not a possible candidate to be run next</p>\n</li>\n<li>\n<p><code>Queue head</code>: The parallel statement is queued due to the global systemwide limit and is the next parallel statement to be dequeued and run</p>\n</li>\n<li>\n<p><code>Queue head - waiting on CG limit</code>: The parallel statement is queued due to the consumer group limit and is the one to be run next from the session's consumer group</p>\n</li>\n<li>\n<p><code>Queue head - waiting on service availability</code>: The parallel statement is queued since there are not enough parallel servers available for the service this session is running on. This session is the one to be run next from the session's service</p>\n</li>\n<li>\n<p><code>Queue head - waiting on PDB limit</code>: The parallel statement is queued due to the PDB limit and is the one to be run next from the session's PDB</p>\n</li>\n<li>\n<p><code>NULL</code>: The session currently does not involve a parallel execution</p>\n</li>\n</ul>" ], [ "CURRENT_LOGICAL_IOS", "NUMBER", "<p>Number of logical I/O requests by the session for the current SQL operation</p>" ], [ "LOGICAL_IOS", "NUMBER", "<p>Total number of logical I/O requests in this session's lifetime</p>" ], [ "CURRENT_ELAPSED_TIME", "NUMBER", "<p>Elapsed time of the session's current SQL operation</p>" ], [ "ELAPSED_TIME", "NUMBER", "<p>Total elapsed time for all of this session's SQL operations in its lifetime</p>" ], [ "LAST_ACTION", "VARCHAR2(48)", "<p>The most recent action that was taken on this SQL operation by Resource Manager. Its value is one of the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CANCEL_SQL</code></p>\n</li>\n<li>\n<p><code>KILL_SESSION</code></p>\n</li>\n<li>\n<p><code>LOG_ONLY</code></p>\n</li>\n<li>\n<p><code>SWITCH TO &lt;CG NAME&gt;</code></p>\n</li>\n</ul>\n<p>For the last value, &lt;CG NAME&gt; is the name of the consumer group that the SQL operation was switched to. If the Resource Plan has since been changed then &lt;CG NAME&gt; is the ID of the consumer group.</p>" ], [ "LAST_ACTION_REASON", "VARCHAR2(30)", "<p>The reason for the most recent action that was taken on this SQL operation by Resource Manager. Its value is one of the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>SWITCH_CPU_TIME</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_REQS</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_MBS</code></p>\n</li>\n<li>\n<p><code>SWITCH_ELAPSED_TIME</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_LOGICAL</code></p>\n</li>\n</ul>" ], [ "LAST_ACTION_TIME", "DATE", "<p>The time of the most recent action that was taken on this SQL operation by Resource Manager</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]