[ [ "PINS", "NUMBER", "<p>Number of object pins or look-ups in the cache</p>" ], [ "HITS", "NUMBER", "<p>Number of object pins that found the object already in the cache</p>" ], [ "TRUE_HITS", "NUMBER", "<p>Number of object pins that found the object already in the cache and in the desired state (thus, not requiring refresh from the database)</p>" ], [ "HIT_RATIO", "NUMBER", "<p>Ratio of <code>HITS</code> / <code>PINS</code></p>" ], [ "TRUE_HIT_RATIO", "NUMBER", "<p>Ratio of <code>TRUE_HITS</code>/<code>PINS</code></p>" ], [ "OBJECT_REFRESHES", "NUMBER", "<p>Number of objects in the cache that were refreshed with a new value from the database</p>" ], [ "CACHE_REFRESHES", "NUMBER", "<p>Number of times the whole cache (all objects) were refreshed</p>" ], [ "OBJECT_FLUSHES", "NUMBER", "<p>Number of objects in the cache that were flushed to the database</p>" ], [ "CACHE_FLUSHES", "NUMBER", "<p>Number of times the whole cache (all objects) were flushed to the database</p>" ], [ "CACHE_SHRINKS", "NUMBER", "<p>Number of times the cache was shrunk to the optimal size</p>" ], [ "CACHED_OBJECTS", "NUMBER", "<p>Number of objects currently cached</p>" ], [ "PINNED_OBJECTS", "NUMBER", "<p>Number of objects currently pinned</p>" ], [ "CACHE_SIZE", "NUMBER", "<p>Current size of the cache (in bytes)</p>" ], [ "OPTIMAL_SIZE", "NUMBER", "<p>Optimal size of the cache (in bytes)</p>" ], [ "MAXIMUM_SIZE", "NUMBER", "<p>Maximum size of the cache (in bytes)</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]