[ [ "SQL_TEXT", "VARCHAR2(1000)", "<p>First thousand characters of the SQL text for the current cursor</p>" ], [ "SQL_FULLTEXT", "CLOB", "<p>All characters of the SQL text for the current cursor</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the parent cursor in the library cache</p>" ], [ "SHARABLE_MEM", "NUMBER", "<p>Amount of shared memory used by a cursor. If multiple child cursors exist, then the sum of all shared memory used by all child cursors.</p>" ], [ "PERSISTENT_MEM", "NUMBER", "<p>Fixed amount of memory used for the lifetime of an open cursor. If multiple child cursors exist, then the fixed sum of memory used for the lifetime of all the child cursors.</p>" ], [ "RUNTIME_MEM", "NUMBER", "<p>Fixed amount of memory required during execution of a cursor. If multiple child cursors exist, then the fixed sum of all memory required during execution of all the child cursors.</p>" ], [ "SORTS", "NUMBER", "<p>Sum of the number of sorts that were done for all the child cursors</p>" ], [ "VERSION_COUNT", "NUMBER", "<p>Number of child cursors that are present in the cache under this parent</p>" ], [ "LOADED_VERSIONS", "NUMBER", "<p>Number of child cursors that are present in the cache and have their context heap loaded</p>" ], [ "OPEN_VERSIONS", "NUMBER", "<p>Number of child cursors that are currently open under this current parent</p>" ], [ "USERS_OPENING", "NUMBER", "<p>Number of users that have any of the child cursors open</p>" ], [ "FETCHES", "NUMBER", "<p>Number of fetches associated with the SQL statement</p>" ], [ "EXECUTIONS", "NUMBER", "<p>Total number of executions, totalled over all the child cursors</p>" ], [ "PX_SERVERS_EXECUTIONS", "NUMBER", "<p>Total number of executions performed by parallel execution servers (<code>0</code> when the statement has never been executed in parallel)</p>" ], [ "END_OF_FETCH_COUNT", "NUMBER", "<p>Number of times this cursor was fully executed since the cursor was brought into the library cache. The value of this statistic is not incremented when the cursor is partially executed, either because it failed during the execution or because only the first few rows produced by this cursor are fetched before the cursor is closed or re-executed. By definition, the value of the <code>END_OF_FETCH_COUNT</code> column should be less or equal to the value of the <code>EXECUTIONS</code> column.</p>" ], [ "USERS_EXECUTING", "NUMBER", "<p>Total number of users executing the statement over all child cursors</p>" ], [ "LOADS", "NUMBER", "<p>Number of times the object was loaded or reloaded</p>" ], [ "FIRST_LOAD_TIME", "VARCHAR2(19)", "<p>Timestamp of the parent creation time</p>" ], [ "INVALIDATIONS", "NUMBER", "<p>Total number of invalidations over all the child cursors</p>" ], [ "PARSE_CALLS", "NUMBER", "<p>Sum of all parse calls to all the child cursors under this parent</p>" ], [ "DISK_READS", "NUMBER", "<p>Sum of the number of disk reads over all child cursors</p>" ], [ "DIRECT_WRITES", "NUMBER", "<p>Sum of the number of direct writes over all child cursors</p>" ], [ "DIRECT_READS", "NUMBER", "<p>Sum of the number of direct reads over all child cursors</p>" ], [ "BUFFER_GETS", "NUMBER", "<p>Sum of buffer gets over all child cursors</p>" ], [ "APPLICATION_WAIT_TIME", "NUMBER", "<p>Application wait time (in microseconds)</p>" ], [ "CONCURRENCY_WAIT_TIME", "NUMBER", "<p>Concurrency wait time (in microseconds)</p>" ], [ "CLUSTER_WAIT_TIME", "NUMBER", "<p>Cluster wait time (in microseconds)</p>" ], [ "USER_IO_WAIT_TIME", "NUMBER", "<p>User I/O Wait Time (in microseconds)</p>" ], [ "PLSQL_EXEC_TIME", "NUMBER", "<p>PL/SQL execution time (in microseconds)</p>" ], [ "JAVA_EXEC_TIME", "NUMBER", "<p>Java execution time (in microseconds)</p>" ], [ "ROWS_PROCESSED", "NUMBER", "<p>Total number of rows processed on behalf of this SQL statement</p>" ], [ "COMMAND_TYPE", "NUMBER", "<p>Oracle command type definition</p>" ], [ "OPTIMIZER_MODE", "VARCHAR2(10)", "<p>Mode under which the SQL statement was executed</p>" ], [ "OPTIMIZER_COST", "NUMBER", "<p>Cost of this query given by the optimizer</p>" ], [ "OPTIMIZER_ENV", "RAW(2000)", "<p>Optimizer environment</p>" ], [ "OPTIMIZER_ENV_HASH_VALUE", "NUMBER", "<p>Hash value for the optimizer environment</p>" ], [ "PARSING_USER_ID", "NUMBER", "<p>User ID of the user that has parsed the very first cursor under this parent</p>" ], [ "PARSING_SCHEMA_ID", "NUMBER", "<p>Schema ID that was used to parse this child cursor</p>" ], [ "PARSING_SCHEMA_NAME", "VARCHAR2(30)", "<p>Schema name that was used to parse this child cursor</p>" ], [ "KEPT_VERSIONS", "NUMBER", "<p>Number of child cursors that have been marked to be kept using the <code>DBMS_SHARED_POOL</code> package</p>" ], [ "ADDRESS", "RAW(4 | 8)", "<p>Address of the handle to the parent for this cursor</p>" ], [ "HASH_VALUE", "NUMBER", "<p>Hash value of the parent statement in the library cache</p>" ], [ "OLD_HASH_VALUE", "NUMBER", "<p>Old SQL hash value</p>" ], [ "PLAN_HASH_VALUE", "NUMBER", "<p>Numeric representation of the current SQL plan for this cursor. Comparing one <code>PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line).</p>" ], [ "FULL_PLAN_HASH_VALUE", "NUMBER", "<p>Numeric representation of the complete SQL plan for this cursor. Comparing one <code>FULL_PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line). Note that the <code>FULL_PLAN_HASH_VALUE</code> cannot be compared across databases releases. It is not backward compatible.</p>" ], [ "MODULE", "VARCHAR2(64)", "<p>Contains the name of the module that was executing when the SQL statement was first parsed as set by calling <code>DBMS_APPLICATION_INFO.SET_MODULE</code></p>" ], [ "MODULE_HASH", "NUMBER", "<p>Hash value of the module that is named in the <code>MODULE</code> column</p>" ], [ "ACTION", "VARCHAR2(64)", "<p>Contains the name of the action that was executing when the SQL statement was first parsed as set by calling <code>DBMS_APPLICATION_INFO.SET_ACTION</code></p>" ], [ "ACTION_HASH", "NUMBER", "<p>Hash value of the action that is named in the <code>ACTION</code> column</p>" ], [ "SERIALIZABLE_ABORTS", "NUMBER", "<p>Number of times the transaction failed to serialize, producing <code>ORA-08177</code> errors, totalled over all the child cursors</p>" ], [ "OUTLINE_CATEGORY", "VARCHAR2(64)", "<p>If an outline was applied during construction of the cursor, then this column displays the category of that outline. Otherwise the column is left blank.</p>" ], [ "CPU_TIME", "NUMBER", "<p>CPU time (in microseconds) used by this cursor for parsing, executing, and fetching</p>" ], [ "ELAPSED_TIME", "NUMBER", "<p>Elapsed time (in microseconds) used by this cursor for parsing, executing, and fetching. If the cursor uses parallel execution, then <code>ELAPSED_TIME</code> is the cumulative time for the query coordinator, plus all parallel query slave processes.</p>" ], [ "OUTLINE_SID", "VARCHAR2(40)", "<p>Outline session identifier</p>" ], [ "LAST_ACTIVE_CHILD_ADDRESS", "RAW(4 | 8)", "<p>Address (identifier) of the child cursor that was the last to be active in the group (that is, the child cursor on behalf of which statistics in <code>V$SQL</code> were updated)</p>" ], [ "REMOTE", "VARCHAR2(1)", "<p>Indicates whether the cursor is remote mapped (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "OBJECT_STATUS", "VARCHAR2(19)", "<p>Status of the cursor:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>VALID</code> - Valid, authorized without errors</p>\n</li>\n<li>\n<p><code>VALID_AUTH_ERROR</code> - Valid, authorized with authorization errors</p>\n</li>\n<li>\n<p><code>VALID_COMPILE_ERROR</code> - Valid, authorized with compilation errors</p>\n</li>\n<li>\n<p><code>VALID_UNAUTH</code> - Valid, unauthorized</p>\n</li>\n<li>\n<p><code>INVALID_UNAUTH</code> - Invalid, unauthorized</p>\n</li>\n<li>\n<p><code>INVALID</code> - Invalid, unauthorized but keep the timestamp</p>\n</li>\n</ul>" ], [ "LITERAL_HASH_VALUE", "NUMBER", "<p>Hash value of the literals which are replaced with system-generated bind variables and are to be matched, when <code>CURSOR_SHARING</code> is used. This is not the hash value for the SQL statement. If <code>CURSOR_SHARING</code> is not used, then the value is <code>0</code>.</p>" ], [ "LAST_LOAD_TIME", "DATE", "<p>Time at which the query plan was loaded into the library cache</p>" ], [ "IS_OBSOLETE", "VARCHAR2(1)", "<p>Indicates whether the cursor has become obsolete (<code>Y</code>) or not (<code>N</code>). This can happen if the number of child cursors is too large.</p>" ], [ "IS_BIND_SENSITIVE", "VARCHAR2(1)", "<p>Indicates whether the cursor is bind sensitive (<code>Y</code>) or not (<code>N</code>). A query is considered bind-sensitive if the optimizer peeked at one of its bind variable values when computing predicate selectivities and where a change in a bind variable value may cause the optimizer to generate a different plan.</p>" ], [ "IS_BIND_AWARE", "VARCHAR2(1)", "<p>Indicates whether the cursor is bind aware (<code>Y</code>) or not (<code>N</code>). A query is considered bind-aware if it has been marked to use extended cursor sharing. The query would already have been marked as bind-sensitive.</p>" ], [ "CHILD_LATCH", "NUMBER", "<p>Child latch number that is protecting the cursor. This column is obsolete and maintained for backward compatibility.</p>" ], [ "SQL_PROFILE", "VARCHAR2(64)", "<p>SQL profile used for this statement, if any</p>" ], [ "SQL_PATCH", "VARCHAR2(30)", "<p>SQL patch used for this statement, if any</p>" ], [ "SQL_PLAN_BASELINE", "VARCHAR2(30)", "<p>SQL plan baseline used for this statement, if any</p>" ], [ "PROGRAM_ID", "NUMBER", "<p>Program identifier</p>" ], [ "PROGRAM_LINE#", "NUMBER", "<p>Program line number</p>" ], [ "EXACT_MATCHING_SIGNATURE", "NUMBER", "<p>Signature used when the <code>CURSOR_SHARING</code> parameter is set to <code>EXACT</code></p>" ], [ "FORCE_MATCHING_SIGNATURE", "NUMBER", "<p>Signature used when the <code>CURSOR_SHARING</code> parameter is set to <code>FORCE</code></p>" ], [ "LAST_ACTIVE_TIME", "DATE", "<p>Time at which the query plan was last active</p>" ], [ "BIND_DATA", "RAW(2000)", "<p>Bind data</p>" ], [ "TYPECHECK_MEM", "NUMBER", "<p>Typecheck memory</p>" ], [ "IO_CELL_OFFLOAD_ELIGIBLE_BYTES", "NUMBER", "<p>Number of I/O bytes which can be filtered by the Exadata storage system</p>\n<p><span class=\"bold\">See Also:</span> Oracle Exadata Storage Server Software documentation for more information</p>" ], [ "IO_INTERCONNECT_BYTES", "NUMBER", "<p>Number of I/O bytes exchanged between Oracle Database and the storage system</p>" ], [ "PHYSICAL_READ_REQUESTS", "NUMBER", "<p>Number of physical read I/O requests issued by the monitored SQL</p>" ], [ "PHYSICAL_READ_BYTES", "NUMBER", "<p>Number of bytes read from disks by the monitored SQL</p>" ], [ "PHYSICAL_WRITE_REQUESTS", "NUMBER", "<p>Number of physical write I/O requests issued by the monitored SQL</p>" ], [ "PHYSICAL_WRITE_BYTES", "NUMBER", "<p>Number of bytes written to disks by the monitored SQL</p>" ], [ "OPTIMIZED_PHY_READ_REQUESTS", "NUMBER", "<p>Number of physical read I/O requests from Database Smart Flash Cache issued by the monitored SQL</p>" ], [ "LOCKED_TOTAL", "NUMBER", "<p>Total number of times the child cursor has been locked</p>" ], [ "PINNED_TOTAL", "NUMBER", "<p>Total number of times the child cursor has been pinned</p>" ], [ "IO_CELL_UNCOMPRESSED_BYTES", "NUMBER", "<p>Number of uncompressed bytes (that is, size after decompression) that are offloaded to the Exadata cells</p>\n<p><span class=\"bold\">See Also:</span> Oracle Exadata Storage Server Software documentation for more information</p>" ], [ "IO_CELL_OFFLOAD_RETURNED_BYTES", "NUMBER", "<p>Number of bytes that are returned by Exadata cell through the regular I/O path</p>\n<p><span class=\"bold\">See Also:</span> Oracle Exadata Storage Server Software documentation for more information</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "IS_REOPTIMIZABLE", "VARCHAR2(1)", "<p>This columns shows whether the next execution matching this child cursor will trigger a reoptimization. The values are:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Y</code>: If the next execution will trigger a reoptimization</p>\n</li>\n<li>\n<p><code>R</code>: If the child cursor contains reoptimization information, but will not trigger reoptimization because the cursor was compiled in reporting mode</p>\n</li>\n<li>\n<p><code>N</code>: If the child cursor has no reoptimization information</p>\n</li>\n</ul>" ], [ "IS_RESOLVED_ADAPTIVE_PLAN", "VARCHAR2(1)", "<p>This column shows whether all of the adaptive parts of a plan have been resolved to the final plan. Once the plan is resolved, the plan hash value and the plan displayed by <code>DBMS_XPLAN</code> will not change through the end of execution. The values for this column are:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NULL</code>: If the plan is not adaptive</p>\n</li>\n<li>\n<p><code>Y</code>: If the plan is fully resolved</p>\n</li>\n<li>\n<p><code>N</code>: If the plan is not yet fully resolved</p>\n</li>\n</ul>\n<p><span class=\"bold\">See Also:</span> <a class=\"olink ARPLS378\" target=\"_blank\" href=\"../ARPLS/DBMS_XPLAN.htm#ARPLS378\"><span class=\"italic\">Oracle Database PL/SQL Packages and Types Reference</span></a> for more information about the <code>DBMS_XPLAN</code> package</p>" ] ]