[ [ "SQL_HASH_VALUE", "NUMBER", "<p>Hash value of the SQL statement that is currently being executed</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the SQL statement that is currently being executed</p>" ], [ "SQL_EXEC_START", "DATE", "<p>Time when the execution of the SQL currently executed by this session started</p>" ], [ "SQL_EXEC_ID", "NUMBER", "<p>SQL execution identifier (see <code>V$SQL_MONITOR</code>)</p>" ], [ "WORKAREA_ADDRESS", "RAW(4 | 8)", "<p>Address of the work area handle. This is the primary key for the view.</p>" ], [ "OPERATION_TYPE", "VARCHAR2(40)", "<p>Type of operation using the work area. Can include values such as <code>SORT</code>, <code>HASH JOIN</code>, <code>GROUP BY</code>, <code>BUFFER</code>, <code>BITMAP MERGE</code>, and <code>BITMAP CONSTRUCTION</code>.</p>" ], [ "OPERATION_ID", "NUMBER", "<p>A unique number used to identify the operation in the execution plan. This identifier can be joined to <code>V$SQL_PLAN</code> to locate the operation that uses this work area.</p>" ], [ "POLICY", "VARCHAR2(6)", "<p>Sizing policy for this work area (<code>MANUAL</code> or <code>AUTO</code>)</p>" ], [ "SID", "NUMBER", "<p>Session identifier</p>" ], [ "QCINST_ID", "NUMBER", "<p>Query coordinator instance identifier. Along with <code>QCSID</code>, enables you to uniquely identify the query coordinator.</p>" ], [ "QCSID", "NUMBER", "<p>Query coordinator session identifier. This is the same as the SID if the work area is allocated by a serial cursor.</p>" ], [ "ACTIVE_TIME", "NUMBER", "<p>Average time this work area is active (in microseconds)</p>" ], [ "WORK_AREA_SIZE", "NUMBER", "<p>Maximum size (in bytes) of the work area as it is currently used by the operation</p>" ], [ "EXPECTED_SIZE", "NUMBER", "<p>Expected size (in bytes) for this work area. <code>EXPECTED_SIZE</code> is set on behalf of the operation by the memory manager. Memory can be over-allocated when <code>WORK_AREA_SIZE</code> has a higher value than <code>EXPECTED_SIZE</code>. This can occur when the operation using this work area takes a long time to resize it.</p>" ], [ "ACTUAL_MEM_USED", "NUMBER", "<p>Amount of PGA memory (in bytes) currently allocated on behalf of this work area. This value should range between <code>0</code> and <code>WORK_AREA_SIZE</code>.</p>" ], [ "MAX_MEM_USED", "NUMBER", "<p>Maximum memory amount (in bytes) used by this work area</p>" ], [ "NUMBER_PASSES", "NUMBER", "<p>Number of passes corresponding to this work area (<code>0</code> if running in <code>OPTIMAL</code> mode)</p>" ], [ "TEMPSEG_SIZE", "NUMBER", "<p>Size (in bytes) of the temporary segment used on behalf of this work area. This column is NULL if this work area has not (yet) spilled to disk.</p>" ], [ "TABLESPACE", "VARCHAR2(30)", "<p>Tablespace name for the temporary segment created on behalf of this work area. This column is NULL if this work area has not (yet) spilled to disk.</p>" ], [ "SEGRFNO#", "NUMBER", "<p>Relative file number within the tablespace for the temporary segment created on behalf of this work area. This column is NULL if this work area has not (yet) spilled to disk.</p>" ], [ "SEGBLK#", "NUMBER", "<p>Block number for the temporary segment created on behalf of this work area. This column is NULL if this work area has not (yet) spilled to disk.</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]