[ [ "KEY", "NUMBER", "<p>Artificial join key to efficiently join <code>V$SQL_MONITOR</code> with its corresponding plan level monitoring statistics stored in <code>V$SQL_PLAN_MONITOR</code></p>" ], [ "REPORT_ID", "NUMBER", "<p>Unique ID of the XML report stored in Automatic Workload Repository (AWR) for this monitored entity</p>" ], [ "STATUS", "VARCHAR2(19)", "<p>SQL execution status:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>QUEUED</code> - SQL statement is queued</p>\n</li>\n<li>\n<p><code>EXECUTING</code> - SQL statement is still executing</p>\n</li>\n<li>\n<p><code>DONE (ERROR)</code> - Execution terminated with an error</p>\n</li>\n<li>\n<p><code>DONE (FIRST N ROWS)</code> - Execution terminated by the application before all rows were fetched</p>\n</li>\n<li>\n<p><code>DONE (ALL ROWS)</code> - Execution terminated and all rows were fetched</p>\n</li>\n<li>\n<p><code>DONE</code> - Execution terminated (parallel execution)</p>\n</li>\n</ul>" ], [ "USER#", "NUMBER", "<p>User ID of the database user who issued the SQL being monitored</p>" ], [ "USERNAME", "VARCHAR2(30)", "<p>User name of the database user who issued the SQL being monitored</p>" ], [ "MODULE", "VARCHAR2(64)", "<p>Name of the executing module when sampled, as set by the <code>DBMS_APPLICATION_INFO.SET_MODULE</code> procedure</p>" ], [ "ACTION", "VARCHAR2(64)", "<p>Name of the executing action when sampled, as set by the <code>DBMS_APPLICATION_INFO.SET_ACTION</code> procedure</p>" ], [ "SERVICE_NAME", "VARCHAR2(64)", "<p>Service name of the user session</p>" ], [ "CLIENT_IDENTIFIER", "VARCHAR2(64)", "<p>Client identifier from the user session</p>" ], [ "CLIENT_INFO", "VARCHAR2(64)", "<p>Client information for the user session</p>" ], [ "PROGRAM", "VARCHAR2(48)", "<p>Name of the operating system program that issued the monitored SQL</p>" ], [ "PLSQL_ENTRY_OBJECT_ID", "NUMBER", "<p>Object ID of the top-most PL/SQL subprogram on the stack; NULL if there is no PL/SQL subprogram on the stack</p>" ], [ "PLSQL_ENTRY_SUBPROGRAM_ID", "NUMBER", "<p>Subprogram ID of the top-most PL/SQL subprogram on the stack; NULL if there is no PL/SQL subprogram on the stack</p>" ], [ "PLSQL_OBJECT_ID", "NUMBER", "<p>Object ID of the currently executing PL/SQL subprogram; NULL if executing SQL</p>" ], [ "PLSQL_SUBPROGRAM_ID", "NUMBER", "<p>Subprogram ID of the currently executing PL/SQL object; NULL if executing SQL</p>" ], [ "FIRST_REFRESH_TIME", "DATE", "<p>Time when monitoring of the SQL statement started, generally a few seconds after execution start time</p>" ], [ "LAST_REFRESH_TIME", "DATE", "<p>Time when statistics in <code>V$SQL_MONITOR</code> were last updated for the SQL statement. Statistics are generally refreshed every second when the statement executes.</p>" ], [ "REFRESH_COUNT", "NUMBER", "<p>Number of times <code>V$SQL_MONITOR</code> statistics have been refreshed (generally once every second when the SQL statement executes)</p>" ], [ "DBOP_EXEC_ID", "NUMBER", "<p>Database operation execution identifier for the current execution. If the type is SQL, the <code>DBOP_EXEC_ID</code> will be <code>NULL</code>.</p>" ], [ "DBOP_NAME", "VARCHAR2(30)", "<p>Database operation name. If the type is SQL, the <code>DBOP_NAME</code> will be <code>NULL</code>.</p>" ], [ "SID", "NUMBER", "<p>Session identifier executing (or having executed) the SQL statement being monitored</p>" ], [ "PROCESS_NAME", "VARCHAR2(5)", "<p>Process name identifier executing (or having executed)the statement; <code>ora</code> if the process is foreground, else the background process name (for example, <code>p001</code> for PX server p001)</p>" ], [ "SQL_ID", "VARCHAR2(13)", "<p>SQL identifier of the statement being monitored</p>" ], [ "SQL_TEXT", "VARCHAR2(2000)", "<p>Up to the first 2000 characters of the text of the SQL being monitored</p>" ], [ "IS_FULL_SQLTEXT", "VARCHAR2(1)", "<p>Indicates whether the <code>SQL_TEXT</code> column has the entire SQL text (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "SQL_EXEC_START", "DATE", "<p>Time when the execution started</p>" ], [ "SQL_EXEC_ID", "NUMBER", "<p>Execution identifier. Together, the three columns <code>SQL_ID</code>, <code>SQL_EXEC_START</code>, and <code>SQL_EXEC_ID</code> represent the execution key. The execution key is used to uniquely identify one execution of the SQL statement.</p>" ], [ "SQL_PLAN_HASH_VALUE", "NUMBER", "<p>SQL plan hash value</p>" ], [ "SQL_FULL_PLAN_HASH_VALUE", "NUMBER", "<p>Numeric representation of the complete SQL plan for this cursor. Comparing one <code>SQL_FULL_PLAN_HASH_VALUE</code> to another easily identifies whether or not two plans are the same (rather than comparing the two plans line by line). Note that the <code>SQL_FULL_PLAN_HASH_VALUE</code> cannot be compared across databases releases. It is not backward compatible.</p>" ], [ "EXACT_MATCHING_SIGNATURE", "NUMBER", "<p>Signature calculated on the normalized SQL text. The normalization includes the removal of white space and the uppercasing of all non-literal strings.</p>" ], [ "FORCE_MATCHING_SIGNATURE", "NUMBER", "<p>Same as <code>EXACT_MATCHING_SIGNATURE</code> but literals in the SQL text are replaced by binds</p>" ], [ "SQL_CHILD_ADDRESS", "RAW(4 | 8)", "<p>Address of the child cursor (can be used with <code>SQL_ID</code> to join with <code>V$SQL</code>)</p>" ], [ "SESSION_SERIAL#", "NUMBER", "<p>Session serial number executing the statement being monitored</p>" ], [ "PX_IS_CROSS_INSTANCE", "VARCHAR2(1)", "<p>Indicates whether the SQL statement ran parallel across multiple instances (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "PX_MAXDOP", "NUMBER", "<p>Maximum degree of parallelism for any plan operation executed on behalf of the monitored SQL</p>" ], [ "PX_MAXDOP_INSTANCES", "NUMBER", "<p>Number of database instances touched at the maximum degree of parallelism</p>" ], [ "PX_SERVERS_REQUESTED", "NUMBER", "<p>Total number of parallel execution servers requested to execute the monitored SQL</p>" ], [ "PX_SERVERS_ALLOCATED", "NUMBER", "<p>Actual number of parallel execution servers allocated to execute the query</p>" ], [ "PX_SERVER#", "NUMBER", "<p>Logical parallel execution server process number executing (or having executed) the statement being monitored; NULL if this monitoring entry is not associated with an execution server. This is a logical number within the parallel server set (see <code>SERVER#</code> in <code>V$PX_SESSION</code>).</p>" ], [ "PX_SERVER_GROUP", "NUMBER", "<p>Logical parallel execution server group number to which <code>PX_SERVER#</code> belongs (see <code>SERVER_GROUP</code> in <code>V$PX_SESSION</code>); NULL if this monitoring entry is not associated with a parallel execution server. This value is generally <code>1</code> unless the SQL statement has one or more parallel sub-queries.</p>" ], [ "PX_SERVER_SET", "NUMBER", "<p>Number (<code>1</code> or <code>2</code>) of the logical set of parallel execution servers to which <code>PX_SERVER#</code> belongs (see <code>SERVER_SET</code> in <code>V$PX_SESSION</code>); NULL if this monitoring entry is not associated with a parallel execution server</p>" ], [ "PX_QCINST_ID", "NUMBER", "<p>Instance identifier where the parallel execution coordinator runs; NULL if <code>PX_SERVER#</code> is NULL</p>" ], [ "PX_QCSID", "NUMBER", "<p>Session identifier for the parallel execution coordinator; NULL if <code>PX_SERVER#</code> is NULL</p>" ], [ "ERROR_NUMBER", "VARCHAR2(40)", "<p>Error number encountered in case a SQL fails to execute successfully (for example, 932 in case of ORA-00932)</p>" ], [ "ERROR_FACILITY", "VARCHAR2(4)", "<p>Error facility in case a SQL fails to execute successfully (for example, ORA in case of ORA-00932)</p>" ], [ "ERROR_MESSAGE", "VARCHAR2(256)", "<p>Detailed error message displayed corresponding to the error number and error facility when a SQL fails to execute successfully</p>" ], [ "BINDS_XML", "CLOB", "<p>Information about bind variables used with the SQL, such as name, position, value, data type, and so on (stored in XML format)</p>" ], [ "OTHER_XML", "CLOB", "<p>Additional information about SQL execution stored in XML format</p>" ], [ "ELAPSED_TIME", "NUMBER", "<p>Elapsed time (in microseconds); updated as the statement executes</p>" ], [ "QUEUING_TIME", "NUMBER", "<p>Duration of time (in microseconds) spent by SQL in the statement queue</p>" ], [ "CPU_TIME", "NUMBER", "<p>CPU time (in microseconds); updated as the statement executes</p>" ], [ "FETCHES", "NUMBER", "<p>Number of fetches associated with the SQL statement; updated as the statement executes</p>" ], [ "BUFFER_GETS", "NUMBER", "<p>Number of buffer get operations; updated as the statement executes</p>" ], [ "DISK_READS", "NUMBER", "<p>Number of disk reads; updated as the statement executes</p>" ], [ "DIRECT_WRITES", "NUMBER", "<p>Number of direct writes; updated as the statement executes</p>" ], [ "IO_INTERCONNECT_BYTES", "NUMBER", "<p>Number of I/O bytes exchanged between Oracle Database and the storage system</p>" ], [ "PHYSICAL_READ_REQUESTS", "NUMBER", "<p>Number of physical read I/O requests issued by the monitored SQL</p>" ], [ "PHYSICAL_READ_BYTES", "NUMBER", "<p>Number of bytes read from disks by the monitored SQL</p>" ], [ "PHYSICAL_WRITE_REQUESTS", "NUMBER", "<p>Number of physical write I/O requests issued by the monitored SQL</p>" ], [ "PHYSICAL_WRITE_BYTES", "NUMBER", "<p>Number of bytes written to disks by the monitored SQL</p>" ], [ "APPLICATION_WAIT_TIME", "NUMBER", "<p>Application wait time (in microseconds); updated as the statement executes</p>" ], [ "CONCURRENCY_WAIT_TIME", "NUMBER", "<p>Concurrency wait time (in microseconds); updated as the statement executes</p>" ], [ "CLUSTER_WAIT_TIME", "NUMBER", "<p>Cluster wait time (in microseconds); updated as the statement executes</p>" ], [ "USER_IO_WAIT_TIME", "NUMBER", "<p>User I/O Wait Time (in microseconds); updated as the statement executes</p>" ], [ "PLSQL_EXEC_TIME", "NUMBER", "<p>PL/SQL execution time (in microseconds); updated as the statement executes</p>" ], [ "JAVA_EXEC_TIME", "NUMBER", "<p>Java execution time (in microseconds); updated as the statement executes</p>" ], [ "RM_LAST_ACTION", "VARCHAR2(48)", "<p>The most recent action that was taken on this SQL operation by Resource Manager. Its value is one of the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>CANCEL_SQL</code></p>\n</li>\n<li>\n<p><code>KILL_SESSION</code></p>\n</li>\n<li>\n<p><code>LOG_ONLY</code></p>\n</li>\n<li>\n<p><code>SWITCH TO &lt;CG NAME&gt;</code></p>\n</li>\n</ul>\n<p>For the last value, &lt;CG NAME&gt; is the name of the consumer group that the SQL operation was switched to. If the Resource Plan has since been changed then &lt;CG NAME&gt; is the ID of the consumer group.</p>" ], [ "RM_LAST_ACTION_REASON", "VARCHAR2(30)", "<p>The reason for the most recent action that was taken on this SQL operation by Resource Manager. Its value is one of the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>SWITCH_CPU_TIME</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_REQS</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_MBS</code></p>\n</li>\n<li>\n<p><code>SWITCH_ELAPSED_TIME</code></p>\n</li>\n<li>\n<p><code>SWITCH_IO_LOGICAL</code></p>\n</li>\n</ul>" ], [ "RM_LAST_ACTION_TIME", "DATE", "<p>The time of the most recent action that was taken on this SQL operation by Resource Manager</p>" ], [ "RM_CONSUMER_GROUP", "VARCHAR2(30)", "<p>The current consumer group for this SQL operation</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ], [ "CON_NAME", "VARCHAR2(30)", "<p>Container name of the object. The value of this column is NULL in non-CDBs.</p>" ], [ "ECID", "VARCHAR2(64)", "<p>Execution context identifier (sent by Application Server)</p>" ], [ "IS_ADAPTIVE_PLAN", "VARCHAR2(1)", "<p>Indicates whether the statistics are from an adaptive plan (Y) or not (N).</p>" ], [ "IS_FINAL_PLAN", "VARCHAR2(1)", "<p>Indicates whether the statistics are from the final plan (Y) or not (N).</p>" ] ]