[ [ "SID", "NUMBER", "<p>Session ID of the reader's session</p>" ], [ "SERIAL#", "NUMBER", "<p>Serial number of the reader's session</p>" ], [ "APPLY#", "NUMBER", "<p>Apply process number. An apply process is an Oracle background process, prefixed by <code>ap</code>.</p>" ], [ "APPLY_NAME", "VARCHAR2(128)", "<p>Name of the apply process</p>" ], [ "STATE", "VARCHAR2(36)", "<p>State of the reader:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code> - Starting up</p>\n</li>\n<li>\n<p><code>IDLE</code> - Performing no work</p>\n</li>\n<li>\n<p><code>DEQUEUE MESSAGES</code> - Dequeuing messages from the queue</p>\n</li>\n<li>\n<p><code>SCHEDULE MESSAGES</code> - Computing dependencies between messages and assembling messages into transactions</p>\n</li>\n<li>\n<p><code>SPILLING</code> - Spilling unapplied messages from memory to hard disk</p>\n</li>\n<li>\n<p><code>PAUSED - WAITING FOR DDL TO COMPLETE</code> - Waiting for a data definition language (DDL) logical change record (LCR) to be applied</p>\n</li>\n</ul>" ], [ "TOTAL_MESSAGES_DEQUEUED", "NUMBER", "<p>Total number of messages dequeued since the apply process was last started</p>" ], [ "TOTAL_MESSAGES_SPILLED", "NUMBER", "<p>Number of messages spilled by the reader since the apply process was last started</p>" ], [ "DEQUEUE_TIME", "DATE", "<p>Time when the last message was received</p>" ], [ "DEQUEUED_MESSAGE_NUMBER", "NUMBER", "<p>Number of the last message received</p>" ], [ "DEQUEUED_MESSAGE_CREATE_TIME", "DATE", "<p>For captured messages, creation time at the source database of the last message received. For user-enqueued messages, time when the message was enqueued into the queue at the local database.</p>" ], [ "SGA_USED", "NUMBER", "<p>Amount (in bytes) of SGA memory used by the apply process since it was last started</p>" ], [ "ELAPSED_DEQUEUE_TIME", "NUMBER", "<p>Time elapsed (in hundredths of a second) dequeuing messages since the apply process was last started</p>" ], [ "ELAPSED_SCHEDULE_TIME", "NUMBER", "<p>Time elapsed (in hundredths of a second) scheduling messages since the apply process was last started. Scheduling includes computing dependencies between messages and assembling messages into transactions.</p>" ], [ "ELAPSED_SPILL_TIME", "NUMBER", "<p>Elapsed time (in hundredths of a second) spent spilling messages since the apply process was last started</p>" ], [ "LAST_BROWSE_NUM", "NUMBER", "<p>Reserved for internal use</p>" ], [ "OLDEST_SCN_NUM", "NUMBER", "<p>Oldest SCN</p>" ], [ "LAST_BROWSE_SEQ", "NUMBER", "<p>Reserved for internal use</p>" ], [ "LAST_DEQ_SEQ", "NUMBER", "<p>Last dequeue sequence number</p>" ], [ "OLDEST_XIDUSN", "NUMBER", "<p>Transaction ID undo segment number of the oldest transaction that either has been applied or is being applied</p>" ], [ "OLDEST_XIDSLT", "NUMBER", "<p>Transaction ID slot number of the oldest transaction that either has been applied or is being applied</p>" ], [ "OLDEST_XIDSQN", "NUMBER", "<p>Transaction ID sequence number of the oldest transaction that either has been applied or is being applied</p>" ], [ "SPILL_LWM_SCN", "NUMBER", "<p>Spill low-watermark SCN</p>" ], [ "PROXY_SID", "NUMBER", "<p>When the apply process uses combined capture and apply, the session ID of the propagation receiver that is responsible for direct communication between capture and apply. If the apply process does not use combined capture and apply, then this column is <code>0</code>.</p>" ], [ "PROXY_SERIAL", "NUMBER", "<p>When the apply process uses combined capture and apply, the serial number of the propagation receiver that is responsible for direct communication between capture and apply. If the apply process does not use combined capture and apply, then this column is <code>0</code>.</p>" ], [ "PROXY_SPID", "VARCHAR2(12)", "<p>When the apply process uses combined capture and apply, the process identification number of the propagation receiver that is responsible for direct communication between capture and apply. If the apply process does not use combined capture and apply, then this column is <code>0</code>.</p>" ], [ "CAPTURE_BYTES_RECEIVED", "NUMBER", "<p>When the apply process uses combined capture and apply, the number of bytes received by the apply process from the capture process since the apply process last started. If the apply process does not use combined capture and apply, then this column is not populated.</p>" ], [ "DEQUEUED_POSITION", "RAW(64)", "<p>Dequeued position. This column is populated only for an apply process that is functioning as an XStream inbound server.</p>" ], [ "LAST_BROWSE_POSITION", "RAW(64)", "<p>Reserved for internal use</p>" ], [ "OLDEST_POSITION", "RAW(64)", "<p>The earliest position of the transactions currently being dequeued and applied. This column is populated only for an apply process that is functioning as an XStream inbound server.</p>" ], [ "SPILL_LWM_POSITION", "RAW(64)", "<p>Spill low-watermark position. This column is populated only for an apply process that is functioning as an XStream inbound server.</p>" ], [ "OLDEST_TRANSACTION_ID", "VARCHAR2(128)", "<p>Oldest transaction ID</p>" ], [ "TOTAL_LCRS_WITH_DEP", "NUMBER", "<p>Total number of LCRs with row-level dependencies since the apply process last started</p>" ], [ "TOTAL_LCRS_WITH_WMDEP", "NUMBER", "<p>Total number of LCRs with watermark dependencies since the apply process last started.</p>\n<p>A watermark dependency occurs when an apply process must wait until the apply process's low watermark reaches a particular threshold.</p>" ], [ "TOTAL_IN_MEMORY_LCRS", "NUMBER", "<p>Total number of LCRs currently in memory</p>" ], [ "SGA_ALLOCATED", "NUMBER", "<p>The total amount of shared memory (in bytes) allocated from the Streams pool for the apply process since the apply process last started</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]