[ [ "SID", "NUMBER", "<p>Session ID of the coordinator's session</p>" ], [ "SERIAL#", "NUMBER", "<p>Serial number of the coordinator's session</p>" ], [ "STATE", "VARCHAR2(21)", "<p>State of the coordinator:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>INITIALIZING</code> - Starting up</p>\n</li>\n<li>\n<p><code>IDLE</code> - Performing no work</p>\n</li>\n<li>\n<p><code>APPLYING</code> - Passing transactions to apply servers</p>\n</li>\n<li>\n<p><code>SHUTTING DOWN CLEANLY</code> - Stopping without an error</p>\n</li>\n<li>\n<p><code>ABORTING</code> - Stopping because of an apply error</p>\n</li>\n</ul>" ], [ "APPLY#", "NUMBER", "<p>Apply process number. An apply process coordinator is an Oracle background process, prefixed by <code>ap</code>.</p>" ], [ "APPLY_NAME", "VARCHAR2(128)", "<p>Name of the apply process</p>" ], [ "TOTAL_APPLIED", "NUMBER", "<p>Total number of transactions applied by the apply process since the apply process was last started</p>" ], [ "TOTAL_WAIT_DEPS", "NUMBER", "<p>Number of times since the apply process was last started that an apply server waited to apply a logical change record (LCR) in a transaction until another apply server applied a transaction because of a dependency between the transactions</p>" ], [ "TOTAL_WAIT_COMMITS", "NUMBER", "<p>Number of times since the apply process was last started that an apply server waited to commit a transaction until another apply server committed a transaction to serialize commits</p>" ], [ "TOTAL_ADMIN", "NUMBER", "<p>Number of administrative jobs issued since the apply process was last started</p>" ], [ "TOTAL_ASSIGNED", "NUMBER", "<p>Number of transactions assigned to apply servers since the apply process was last started</p>" ], [ "TOTAL_RECEIVED", "NUMBER", "<p>Total number of transactions received by the coordinator process since the apply process was last started</p>" ], [ "TOTAL_IGNORED", "NUMBER", "<p>Number of transactions which were received by the coordinator but were ignored because they had been previously applied</p>" ], [ "TOTAL_ROLLBACKS", "NUMBER", "<p>Number of transactions which were rolled back due to unexpected contention</p>" ], [ "TOTAL_ERRORS", "NUMBER", "<p>Number of transactions applied by the apply process that resulted in an apply error since the apply process was last started</p>" ], [ "UNASSIGNED_COMPLETE_TXNS", "NUMBER", "<p>Total number of complete transactions that the coordinator has not assigned to any apply servers</p>" ], [ "AUTO_TXN_BUFFER_SIZE", "NUMBER", "<p>Current value of transaction buffer size. Transaction buffer size refers to the number of transactions that the apply reader can assemble ahead of apply servers. The apply process periodically adjusts the transaction buffer size.</p>" ], [ "LWM_TIME", "DATE", "<p>Time when the message with the lowest message number was recorded. The creation time of the message with the lowest message number was also recorded at this time.</p>" ], [ "LWM_MESSAGE_NUMBER", "NUMBER", "<p>Number of the message corresponding to the low watermark. That is, messages with a commit message number less than or equal to this message number have definitely been applied, but some messages with a higher commit message number also may have been applied.</p>" ], [ "LWM_MESSAGE_CREATE_TIME", "DATE", "<p>For captured messages, creation time at the source database of the message corresponding to the low watermark. For user-enqueued messages, time when the message corresponding to the low watermark was enqueued into the queue at the local database.</p>" ], [ "HWM_TIME", "DATE", "<p>Time when the message with the highest message number was recorded. The creation time of the message with the highest message number was also recorded at this time.</p>" ], [ "HWM_MESSAGE_NUMBER", "NUMBER", "<p>Number of the message corresponding to the high watermark. That is, no messages with a commit message number greater than this message number have been applied.</p>" ], [ "HWM_MESSAGE_CREATE_TIME", "DATE", "<p>For captured messages, creation time at the source database of the message corresponding to the high watermark. For user-enqueued messages, time when the message corresponding to the high watermark was enqueued into the queue at the local database.</p>" ], [ "STARTUP_TIME", "DATE", "<p>Time when the apply process was last started</p>" ], [ "ELAPSED_SCHEDULE_TIME", "NUMBER", "<p>Time elapsed (in hundredths of a second) scheduling messages since the apply process was last started</p>" ], [ "ELAPSED_IDLE_TIME", "NUMBER", "<p>Elapsed idle time</p>" ], [ "LWM_POSITION", "RAW(64)", "<p>Position of the low-watermark LCR</p>" ], [ "HWM_POSITION", "RAW(64)", "<p>Position of the high-watermark LCR</p>" ], [ "PROCESSED_MESSAGE_NUMBER", "NUMBER", "<p>Message number currently processed by the apply coordinator</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]