[ [ "EVENT", "VARCHAR2(64)", "<p>Name of the wait event</p>" ], [ "TOTAL_WAITS", "NUMBER", "<p>Total number of waits for the event</p>" ], [ "TOTAL_TIMEOUTS", "NUMBER", "<p>Total number of timeouts for the event</p>" ], [ "TIME_WAITED", "NUMBER", "<p>Total amount of time waited for the event (in hundredths of a second)</p>" ], [ "AVERAGE_WAIT", "NUMBER", "<p>Average amount of time waited for the event (in hundredths of a second)</p>" ], [ "TIME_WAITED_MICRO", "NUMBER", "<p>Total amount of time waited for the event (in microseconds)</p>" ], [ "TOTAL_WAITS_FG", "NUMBER", "<p>Total number of waits for the event, from foreground sessions</p>" ], [ "TOTAL_TIMEOUTS_FG", "NUMBER", "<p>Total number of timeouts for the event, from foreground sessions</p>" ], [ "TIME_WAITED_FG", "NUMBER", "<p>Amount of time waited for the event (in hundredths of a second), from foreground sessions</p>" ], [ "AVERAGE_WAIT_FG", "NUMBER", "<p>Average amount of time waited for the event (in hundredths of a second), from foreground sessions</p>" ], [ "TIME_WAITED_MICRO_FG", "NUMBER", "<p>Amount of time waited for the event (in microseconds), from foreground sessions</p>" ], [ "EVENT_ID", "NUMBER", "<p>Identifier of the wait event</p>" ], [ "WAIT_CLASS_ID", "NUMBER", "<p>Identifier of the class of the wait event</p>" ], [ "WAIT_CLASS#", "NUMBER", "<p>Number of the class of the wait event</p>" ], [ "WAIT_CLASS", "VARCHAR2(64)", "<p>Name of the class of the wait event</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]