[ [ "BEGIN_TIME", "DATE", "<p>Identifies the beginning of the time interval</p>" ], [ "END_TIME", "DATE", "<p>Identifies the end of the time interval</p>" ], [ "UNDOTSN", "NUMBER", "<p>Represents the last active undo tablespace in the duration of time. The tablespace ID of the active undo tablespace is returned in this column. If more than one undo tablespace was active in that period, the active undo tablespace that was active at the end of the period is reported.</p>" ], [ "TXNCOUNT", "NUMBER", "<p>Total number of transaction that have bound to the temp undo segment contained in above tablespace within the interval period</p>" ], [ "MAXCONCURRENCY", "NUMBER", "<p>Highest number of transactions executed concurrently which modified temporary objects within the interval period</p>" ], [ "MAXQUERYLEN", "NUMBER", "<p>Reserved for future use</p>" ], [ "MAXQUERYID", "VARCHAR2(13)", "<p>Reserved for future use</p>" ], [ "UNDOBLKCNT", "NUMBER", "<p>Total number of temporary undo blocks consumed</p>" ], [ "EXTCNT", "NUMBER", "<p>Total number of extents consumed</p>" ], [ "USCOUNT", "NUMBER", "<p>Temp undo segments created in this period</p>" ], [ "SSOLDERRCNT", "NUMBER", "<p>Identifies the number of times the error <code>ORA-01555</code> occurred. You can use this statistic to decide whether or not the <code>UNDO_RETENTION</code> initialization parameter is set properly given the size of the undo tablespace. Increasing the value of <code>UNDO_RETENTION</code> can reduce the occurrence of this error.</p>" ], [ "NOSPACEERRCNT", "NUMBER", "<p>Total number of times the error 'no space left for temporary undo' was raised</p>" ], [ "CON_ID", "NUMBER", "<p>The ID of the container to which the data pertains. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]