[ [ "SNAP_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Unique snapshot ID</p>" ], [ "DBID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Database ID for the snapshot</p>" ], [ "INSTANCE_NUMBER", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Instance number for the snapshot</p>" ], [ "RECOVERY_ESTIMATED_IOS", "NUMBER", "&nbsp;", "<p>Number of dirty buffers in the buffer cache.</p>" ], [ "ACTUAL_REDO_BLKS", "NUMBER", "&nbsp;", "<p>Current actual number of redo blocks required for recovery</p>" ], [ "TARGET_REDO_BLKS", "NUMBER", "&nbsp;", "<p>Current target number of redo blocks that must be processed for recovery. This value is the minimum value of the following 3 columns, and identifies which of the 3 user-defined limits determines checkpointing.</p>" ], [ "LOG_FILE_SIZE_REDO_BLKS", "NUMBER", "&nbsp;", "<p>Maximum number of redo blocks required to guarantee that a log switch does not occur before the checkpoint completes</p>" ], [ "LOG_CHKPT_TIMEOUT_REDO_BLKS", "NUMBER", "&nbsp;", "<p>Number of redo blocks that need to be processed during recovery to satisfy the <code>LOG_CHECKPOINT_TIMEOUT</code> parameter. The value displayed is not meaningful unless <code>LOG_CHECKPOINT_TIMEOUT</code> has been set.</p>" ], [ "LOG_CHKPT_INTERVAL_REDO_BLKS", "NUMBER", "&nbsp;", "<p>Number of redo blocks that need to be processed during recovery to satisfy the <code>LOG_CHECKPOINT_INTERVAL</code> parameter. The value displayed is not meaningful unless <code>LOG_CHECKPOINT_INTERVAL</code> has been set.</p>" ], [ "FAST_START_IO_TARGET_REDO_BLKS", "NUMBER", "&nbsp;", "<p>This column is obsolete and maintained for backward compatibility. The value of this column is always null.</p>" ], [ "TARGET_MTTR", "NUMBER", "&nbsp;", "<p>Effective MTTR (mean time to recover) target value in seconds. The <code>TARGET_MTTR</code> value is calculated based on the value of the <code>FAST_START_MTTR_TARGET</code> parameter (the <code>TARGET_MTTR</code> value is used internally), and is usually an approximation of the parameter's value. However, if the <code>FAST_START_MTTR_TARGET</code> parameter value is very small (for example, one second), or very large (for example, 3600 seconds), then the calculation will produce a target value dictated by system limitations.</p>\n<p>In such cases, the <code>TARGET_MTTR</code> value will be the shortest calculated time, or the longest calculated time that recovery is expected to take. If <code>FAST_START_MTTR_TARGET</code> is not specified, then the value of this field is the current estimated MTTR.</p>" ], [ "ESTIMATED_MTTR", "NUMBER", "&nbsp;", "<p>Current estimated mean time to recover (MTTR) based on the number of dirty buffers and log blocks (<code>0</code> if <code>FAST_START_MTTR_TARGET</code> is not specified). This value tells you how long you can expect recovery to take based on the work the system is doing right now.</p>" ], [ "CKPT_BLOCK_WRITES", "NUMBER", "&nbsp;", "<p>Number of blocks written by checkpoint writes</p>" ], [ "OPTIMAL_LOGFILE_SIZE", "NUMBER", "&nbsp;", "<p>Redo log file size (in megabytes) that is considered optimal based on the current setting of <code>FAST_START_MTTR_TARGET</code>. It is recommended that all online redo logs be configured to be at least this value.</p>" ], [ "ESTD_CLUSTER_AVAILABLE_TIME", "NUMBER", "&nbsp;", "<p>Estimated time (in seconds) that the cluster would become partially available should the instance fail. This column is only meaningful in an Oracle Real Application Clusters (Oracle RAC) environment. In a non-Oracle RAC environment, the value of this column is null.</p>" ], [ "WRITES_MTTR", "NUMBER", "&nbsp;", "<p>Number of writes driven by the <code>FAST_START_MTTR_TARGET</code> parameter</p>" ], [ "WRITES_LOGFILE_SIZE", "NUMBER", "&nbsp;", "<p>Number of writes driven by the smallest redo log file size</p>" ], [ "WRITES_LOG_CHECKPOINT_SETTINGS", "NUMBER", "&nbsp;", "<p>Number of writes driven by the <code>LOG_CHECKPOINT_INTERVAL</code> parameter or the <code>LOG_CHECKPOINT_TIMEOUT</code> parameter</p>" ], [ "WRITES_OTHER_SETTINGS", "NUMBER", "&nbsp;", "<p>Number of writes driven by other reasons (such as the deprecated <code>FAST_START_IO_TARGET</code> parameter)</p>" ], [ "WRITES_AUTOTUNE", "NUMBER", "&nbsp;", "<p>Number of writes due to auto-tune checkpointing</p>" ], [ "WRITES_FULL_THREAD_CKPT", "NUMBER", "&nbsp;", "<p>Number of writes due to full thread checkpoints</p>" ], [ "CON_DBID", "NUMBER", "&nbsp;", "<p>The database ID of the PDB for the sampled session</p>" ], [ "CON_ID", "NUMBER", "&nbsp;", "<p>The ID of the container that <code>CON_DBID</code> identifies. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]