[ [ "STREAM_SEQUENCE#", "NUMBER", "&nbsp;", "<p>Lists the sequence numbers for all log streams created or applied on the local system.</p>\n<p><span class=\"bold\">Note</span>: A value of 0 indicates an unknown sequence order; this is reserved for future log streams.</p>" ], [ "STATUS", "VARCHAR2(16)", "&nbsp;", "<p>Description of the log stream processing:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>Past</code> - The log stream has already been processed</p>\n</li>\n<li>\n<p><code>Immediate Past</code> - This is the most recently processed log stream; its status is transitioning from <code>Current</code> to <code>Past</code></p>\n</li>\n<li>\n<p><code>Current</code> - The log stream is currently being processed</p>\n</li>\n<li>\n<p><code>Immediate Future</code> - This is the next log stream to be processed; its status is transitioning from <code>Future</code> to <code>Current</code></p>\n</li>\n<li>\n<p><code>Future</code> - The log stream will be processed</p>\n</li>\n</ul>" ], [ "SOURCE", "VARCHAR2(5)", "&nbsp;", "<p>Describes how the log stream was started:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>RFS</code> - The RFS process created the log stream</p>\n</li>\n<li>\n<p><code>User</code> - A user registered the initial log file for the log stream</p>\n</li>\n<li>\n<p><code>Synch</code> - A user issued the <code>ALTER DATABASE START LOGICAL STANDBY APPLY NEW PRIMARY DDL</code> statement</p>\n</li>\n<li>\n<p><code>Redo</code> - The log stream information was recorded in the redo log</p>\n</li>\n</ul>" ], [ "DBID", "NUMBER", "&nbsp;", "<p>Database identifier of the primary database that created the log stream</p>" ], [ "FIRST_CHANGE#", "NUMBER", "&nbsp;", "<p>Lowest system change number (SCN) in the current log file</p>" ], [ "LAST_CHANGE#", "NUMBER", "&nbsp;", "<p>Highest system change number (SCN) in the current log file</p>" ], [ "FIRST_TIME", "DATE", "&nbsp;", "<p>Time of the first SCN entry (<code>FIRST_CHANGE#</code>) in the current log file</p>" ], [ "LAST_TIME", "DATE", "&nbsp;", "<p>Time of the last SCN entry (<code>LAST_CHANGE#</code>) in the current log file</p>" ], [ "DGNAME", "VARCHAR2(255)", "&nbsp;", "<p>Unique database name (<code>DB_UNIQUE_NAME</code>) of the primary database that produced the log stream. See <code>V$DATAGUARD_CONFIG</code> to display all database <code>DB_UNIQUE_NAME</code> values defined in the Data Guard configuration.</p>" ], [ "MERGE_CHANGE#", "NUMBER", "&nbsp;", "<p>SCN that should be used to flashback a failed primary (that created the log stream) or to flashback a bystander logical standby database following a failover, in the context of the associated redo log stream. It is the SCN up to which redo for the associated log stream can be merged safely in all databases using local copies of archived logs received from the primary database. In order to apply changes beyond this following a failover, you will need to fetch and mine the redo logs from the failover target.</p>" ], [ "PROCESSED_CHANGE#", "NUMBER", "&nbsp;", "<p>Strict upper bound on the SCN up to which SQL Apply has applied redo records before it switched to a new log stream (either because it was activated and became the primary database, or in the case of a bystander logical standby database where it switched to a new log stream to accommodate a new primary database).</p>" ] ]