[ [ "NAME", "VARCHAR2(64)", "&nbsp;", "<p>Name of the parameter:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>MAX_SGA</code> - System global area (SGA) allocated for the log apply services cache (in megabytes)</p>\n</li>\n<li>\n<p><code>MAX_SERVERS</code> - Number of processes used by SQL Apply services</p>\n</li>\n<li>\n<p><code>PREPARE_SERVERS</code> - Controls the number of parallel execution servers used to prepare changes</p>\n</li>\n<li>\n<p><code>APPLY_SERVERS</code> - Controls the number of parallel execution servers used to apply changes</p>\n</li>\n<li>\n<p><code>MAX_EVENTS_RECORDED</code> - Number of events stored in the <code>DBA_LOGSTDBY_EVENTS</code> view</p>\n</li>\n<li>\n<p><code>RECORD_SKIP_ERRORS</code> - Indicates records that are skipped</p>\n</li>\n<li>\n<p><code>RECORD_SKIP_DDL</code> - Indicates skipped DDL statements</p>\n</li>\n<li>\n<p><code>RECORD_APPLIED_DDL</code> - Indicates applied DDL statements</p>\n</li>\n<li>\n<p><code>RECORD_UNSUPPORTED_OPERATIONS</code> - Shows whether SQL Apply will capture information about transactions that did unsupported operations at the primary database in the <code>DBA_LOGSTDBY_EVENTS</code> view</p>\n</li>\n<li>\n<p><code>EVENT_LOG_DEST</code> - Indicates where SQL Apply records the occurrence of an interesting event</p>\n</li>\n<li>\n<p><code>LOG_AUTO_DELETE</code> - Shows whether SQL Apply will automatically delete remote archived logs received from the primary database, once the contents of the logs are applied at the logical standby database.</p>\n</li>\n<li>\n<p><code>LOG_AUTO_DEL_RETENTION_TARGET</code> - How many minutes a remote archived log received from the primary database will be retained at the logical standby database, once the contents of the log are applied by SQL Apply.</p>\n</li>\n<li>\n<p><code>PRESERVE_COMMIT_ORDER</code> - Shows whether transactions are committed at the logical standby database in the same order that they were committed at the primary database</p>\n</li>\n</ul>" ], [ "VALUE", "VARCHAR2(2000)", "&nbsp;", "<p>Value of the parameter</p>" ], [ "UNIT", "VARCHAR2(64)", "&nbsp;", "<p>Unit of the value, if applicable</p>" ], [ "SETTING", "VARCHAR2(64)", "&nbsp;", "<p>Possible values are as follows:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>SYSTEM</code> - Parameter value was not explicitly set by the user. However, the user can change it with an appropriate call to the <code>APPLY_SET</code> procedure.</p>\n</li>\n<li>\n<p><code>USER</code> - Parameter value was explicitly set by the user</p>\n</li>\n</ul>" ], [ "DYNAMIC", "VARCHAR2(64)", "&nbsp;", "<p><code>YES</code> if the parameter can be set dynamically (that is, without having to stop SQL Apply)</p>\n<p><code>NO</code> if setting the parameter requires that SQL Apply be stopped</p>" ] ]