[ [ "STORE", "VARCHAR2(256)", "&nbsp;", "<p>Name of store</p>" ], [ "MOUNT", "VARCHAR2(256)", "&nbsp;", "<p>Location at which instance of store is mounted</p>" ], [ "PATHNAME", "VARCHAR2(1024)", "&nbsp;", "<p>Name of path to item</p>" ], [ "PATHTYPE", "VARCHAR2(32)", "&nbsp;", "<p>Type of path item (see <code>DBMS_DBFS_CONTENT</code> Constants - Path Name Types)</p>" ], [ "FILEDATA", "BLOB", "&nbsp;", "<p>BLOB locator that can be used to access data in the path item</p>" ], [ "STD_ACCESS_TIME", "TIMESTAMP(6)", "&nbsp;", "<p>Time of last access of a path name's contents</p>" ], [ "STD_ACL", "VARCHAR2(1024)", "&nbsp;", "<p>Access Control List (in standard ACL syntax)</p>" ], [ "STD_CHANGE_TIME", "TIMESTAMP(6)", "&nbsp;", "<p>Time of last change to the path name</p>" ], [ "STD_CHILDREN", "NUMBER", "&nbsp;", "<p>Number of child directories/folders a directory/folder path has (this property should be available in providers that support the <code>FEATURE_FOLDERS</code> feature)</p>" ], [ "STD_CONTENT_TYPE", "VARCHAR2(1024)", "&nbsp;", "<p>One or more client-supplied mime-types (in standard RFC syntax) describing the path name which is typically of <code>TYPE_FILE</code>. The content type is not necessarily interpreted by the store.</p>" ], [ "STD_CREATION_TIME", "TIMESTAMP(6)", "&nbsp;", "<p>Time at which the item was created. Once set, this value remains the same for the lifetime of the path name.</p>" ], [ "STD_DELETED", "NUMBER", "&nbsp;", "<p>Set to a nonzero number if the path name has been soft-deleted but not yet purged (see <code>DBMS_DBFS_CONTENT</code> Constants - Store Features)</p>" ], [ "STD_GUID", "NUMBER", "&nbsp;", "<p>Store-specific unique identifier for a path name. Clients must not depend on the GUID being unique across different stores, but a given (store-name, store-specific-path name) has a stable and unique GUID for its lifetime.</p>" ], [ "STD_MODIFICATION_TIME", "TIMESTAMP(6)", "&nbsp;", "<p>Time of last change to the data associated with a path name. Changes to the content of a <code>TYPE_FILE</code> or <code>TYPE_REFERENCE</code> path, the referent of the <code>TYPE_LINK</code> path, and addition or deletion of immediate children in a <code>TYPE_DIRECTORY</code> path, all constitute data changes.</p>" ], [ "STD_OWNER", "VARCHAR2(32)", "&nbsp;", "<p>Client-supplied (or implicit) owner name for the path name</p>" ], [ "STD_PARENT_GUID", "NUMBER", "&nbsp;", "<p>Store-specific unique identifier for the parent of a path name. Clients must not depend on the GUID being unique across different stores, but a given (store-name, store-specific-path name) has a stable and unique GUID for its lifetime.</p>\n<p>The GUID of the parent of this path name (that is that std_parent_guid(pathname) == std_guid(parent(pathname))).</p>" ], [ "STD_REFERENT", "VARCHAR2(1024)", "&nbsp;", "<p>Content of the symbolic link of a <code>TYPE_LINK</code> path, otherwise NULL. The <code>STD_REFERENT</code> can be an arbitrary string and must not necessarily be interpreted as path name by clients (or such interpretation should be done with great care).</p>" ], [ "OPT_HASH_TYPE", "VARCHAR2(32)", "&nbsp;", "<p>Type of hash provided in the <code>OPT_HASH_VALUE</code> property (see <code>DBMS_CRYPTO</code> for possible options)</p>" ], [ "OPT_HASH_VALUE", "VARCHAR2(128)", "&nbsp;", "<p>Hash value of type <code>OPT_HASH_TYPE</code> describing the content of the path name</p>" ], [ "OPT_LOCK_COUNT", "NUMBER", "&nbsp;", "<p>Number of compatible locks placed on a path name. If different principals are allowed to place compatible (read) locks on a path, the <code>OPT_LOCKER</code> must specify all lockers with repeats so that lock counts can be correctly maintained.</p>" ], [ "OPT_LOCK_DATA", "VARCHAR2(128)", "&nbsp;", "<p>Client-supplied user-data associated with a user-lock, uninterpreted by the store</p>" ], [ "OPT_LOCKER", "VARCHAR2(128)", "&nbsp;", "<p>One or more implicit or client-specified principals that applied a user-lock on a path name</p>" ], [ "OPT_LOCK_STATUS", "NUMBER", "&nbsp;", "<p>One of the (<code>LOCK_READ_ONLY</code>, <code>LOCK_WRITE_ONLY</code>, <code>LOCK_READ_WRITE</code>) values describing the type of lock currently applied on a path name</p>" ], [ "OPT_VERSION", "NUMBER", "&nbsp;", "<p>Sequence number for linear versioning of a path name</p>" ], [ "OPT_VERSION_PATH", "VARCHAR2(1024)", "&nbsp;", "<p>Version path name for hierarchical versioning of a path name</p>" ], [ "OPT_CONTENT_ID", "RAW(128)", "&nbsp;", "<p>A provider-generated store-specific unique contentID in the form of a string for a file element (that may optionally not be associated with a path (see <code>FEATURE_CONTENT_ID</code> and <code>FEATURE_LAZY_PATH</code> in <code>DBMS_DBFS_CONTENT</code> Constants - Store Features)</p>" ] ]