[ [ "THREAD#", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Thread ID of the archive log. The THREAD number is <code>1</code> for a single instance. For Real Application Clusters, this column will contain different numbers.</p>" ], [ "RESETLOGS_CHANGE#", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Start SCN of the branch</p>" ], [ "RESETLOGS_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Resetlogs identifier (a numeric form of the timestamp of the branch)</p>" ], [ "SEQUENCE#", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Sequence number of the archive log file</p>" ], [ "FIRST_CHANGE#", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>System change number (SCN) of the current archive log</p>" ], [ "NEXT_CHANGE#", "NUMBER", "&nbsp;", "<p>SCN of the next archive log</p>" ], [ "FIRST_TIME", "DATE", "&nbsp;", "<p>Date of the current archive log</p>" ], [ "NEXT_TIME", "DATE", "&nbsp;", "<p>Date of the next archive log</p>" ], [ "FILE_NAME", "VARCHAR2(513)", "&nbsp;", "<p>Name of the archive log</p>" ], [ "TIMESTAMP", "DATE", "&nbsp;", "<p>Time when the archive log was registered</p>" ], [ "DICT_BEGIN", "VARCHAR2(3)", "&nbsp;", "<p>Indicates whether the beginning of the dictionary build is in this archive log (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "DICT_END", "VARCHAR2(3)", "&nbsp;", "<p>Indicates whether the end of the dictionary build is in this archive log (<code>YES</code>) or not (<code>NO</code>)</p>" ], [ "APPLIED", "VARCHAR2(8)", "&nbsp;", "<p>Indicates primarily whether a given foreign archived log has been applied fully by SQL Apply:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>YES</code> - SQL Apply has fully applied the foreign archived log and no longer needs it</p>\n</li>\n<li>\n<p><code>CURRENT</code> - SQL Apply is currently applying changes contained in the foreign archived log</p>\n</li>\n<li>\n<p><code>NO</code> - SQL Apply has not started applying any changes contained in the foreign archived log</p>\n</li>\n<li>\n<p><code>FETCHING</code> - SQL Apply encountered a corruption while reading redo records from this foreign archived log, and is currently using the automatic gap resolution to refetch a new copy of the log from the primary database</p>\n</li>\n<li>\n<p><code>CORRUPT</code> - SQL Apply encountered a corruption while reading redo records from this foreign archived log, and refetching a new copy of the archived log did not resolve the problem. SQL Apply will not refetch a new copy of this archived log automatically, and will require user intervention to manually register a new copy of the foreign archived log.</p>\n</li>\n</ul>" ], [ "BLOCKS", "NUMBER", "&nbsp;", "<p>Number of blocks in the log</p>" ], [ "BLOCK_SIZE", "NUMBER", "&nbsp;", "<p>Size of each block in the log</p>" ] ]