[ [ "OWNER", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Schema in which the materialized view was created</p>" ], [ "MVIEW_NAME", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Name of the materialized view</p>" ], [ "CONTAINER_NAME", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Name of the container in which the materialized view's data is held. Normally this is the same as <code>MVIEW_NAME</code>. For materialized views created before Oracle8<span class=\"italic\">i</span>, Oracle Database attaches the 6-byte prefix <code>SNAP$_</code>. If <code>MVIEW_NAME</code> has more than 19 bytes, then Oracle Database truncates the name to 19 bytes and may add a 4-byte sequence number as a suffix to produce a nonambiguous <code>CONTAINER_NAME</code>.</p>" ], [ "QUERY", "LONG", "&nbsp;", "<p>Query that defines the materialized view</p>" ], [ "QUERY_LEN", "NUMBER(38)", "&nbsp;", "<p>Length (in bytes) of the defining query</p>" ], [ "UPDATABLE", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view is updatable (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UPDATE_LOG", "VARCHAR2(128)", "&nbsp;", "<p>For updatable materialized views, the filename of the update log</p>" ], [ "MASTER_ROLLBACK_SEG", "VARCHAR2(128)", "&nbsp;", "<p>Rollback segment for the master site or the master materialized view site</p>" ], [ "MASTER_LINK", "VARCHAR2(128)", "&nbsp;", "<p>Database link for the master site or the master materialized view site</p>" ], [ "REWRITE_ENABLED", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether rewrite is enabled (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "REWRITE_CAPABILITY", "VARCHAR2(9)", "&nbsp;", "<p>Indicates whether the materialized view is eligible for rewrite, and if so, what rules must be followed:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NONE</code> - Materialized view cannot be used for rewrite, because rewrite is disallowed or prevented</p>\n</li>\n<li>\n<p><code>TEXTMATCH</code> - Defining query of the materialized view contained restrictions on the use of query rewrite</p>\n</li>\n<li>\n<p><code>GENERAL</code> - Defining query of the materialized view contained no restrictions on the use of query rewrite, so Oracle Database can apply any rewrite rule that is supported</p>\n</li>\n</ul>" ], [ "REFRESH_MODE", "VARCHAR2(6)", "&nbsp;", "<p>Refresh mode of the materialized view:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>DEMAND</code> - Oracle Database refreshes this materialized view whenever an appropriate refresh procedure is called</p>\n</li>\n<li>\n<p><code>COMMIT</code> - Oracle Database refreshes this materialized view when a transaction on one of the materialized view's masters commits</p>\n</li>\n<li>\n<p><code>NEVER</code> - Oracle Database never refreshes this materialized view</p>\n</li>\n</ul>" ], [ "REFRESH_METHOD", "VARCHAR2(8)", "&nbsp;", "<p>Default method used to refresh the materialized view (can be overridden through the API):</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>COMPLETE</code> - Materialized view is completely refreshed from the masters</p>\n</li>\n<li>\n<p><code>FORCE</code> - Oracle Database performs a fast refresh if possible, otherwise a complete refresh</p>\n</li>\n<li>\n<p><code>FAST</code> - Oracle Database performs an incremental refresh applying changes that correspond to changes in the masters since the last refresh</p>\n</li>\n<li>\n<p><code>NEVER</code> - User specified that Oracle Database should not refresh this materialized view</p>\n</li>\n</ul>" ], [ "BUILD_MODE", "VARCHAR2(9)", "&nbsp;", "<p>Indicates how the materialized view was populated during creation:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>IMMEDIATE</code> - Populated from the masters during creation</p>\n</li>\n<li>\n<p><code>DEFERRED</code> - Not populated during creation. Must be explicitly populated later by the user.</p>\n</li>\n<li>\n<p><code>PREBUILT</code> - Populated with an existing table during creation. The relationship of the contents of this prebuilt table to the materialized view's masters is unknown to Oracle Database.</p>\n</li>\n</ul>" ], [ "FAST_REFRESHABLE", "VARCHAR2(18)", "&nbsp;", "<p>Indicates whether the materialized view is eligible for incremental (fast) refresh. Oracle Database calculates this value statically, based on the materialized view definition query:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NO</code> - Materialized view is not fast refreshable, and hence is complex</p>\n</li>\n<li>\n<p><code>DML</code> - Fast refresh is supported only for DML operations</p>\n</li>\n<li>\n<p><code>DIRLOAD_DML</code> - Fast refresh is supported for both direct loads and DML operations</p>\n</li>\n<li>\n<p><code>DIRLOAD_LIMITEDDML</code> - Fast refresh is supported for direct loads and a subset of DML operations</p>\n</li>\n</ul>" ], [ "LAST_REFRESH_TYPE", "VARCHAR2(8)", "&nbsp;", "<p>Method used for the most recent refresh:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>COMPLETE</code> - Most recent refresh was complete</p>\n</li>\n<li>\n<p><code>FAST</code> - Most recent refresh was fast (incremental)</p>\n</li>\n<li>\n<p><code>NA</code> - Materialized view has not yet been refreshed (for example, if it was created <code>DEFERRED</code>)</p>\n</li>\n</ul>" ], [ "LAST_REFRESH_DATE", "DATE", "&nbsp;", "<p>Date on which the materialized view was most recently refreshed (blank if not yet populated)</p>" ], [ "LAST_REFRESH_END_TIME", "DATE", "&nbsp;", "<p>End time of the most recent refresh on the materialized view (blank if not yet populated)</p>" ], [ "STALENESS", "VARCHAR2(19)", "&nbsp;", "<p>Relationship between the contents of the materialized view and the contents of the materialized view's masters:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>FRESH</code> - Materialized view is a read-consistent view of the current state of its masters</p>\n</li>\n<li>\n<p><code>STALE</code> - Materialized view is out of date because one or more of its masters has changed. If the materialized view was <code>FRESH</code> before it became <code>STALE</code>, then it is a read-consistent view of a former state of its masters.</p>\n</li>\n<li>\n<p><code>NEEDS_COMPILE</code> - Some object upon which the materialized view depends has changed. An <code>ALTER MATERIALIZED VIEW...COMPILE</code> statement is required to validate this materialized view and compute the staleness of the contents.</p>\n</li>\n<li>\n<p><code>UNUSABLE</code> - Materialized view is not a read-consistent view of its masters from any point in time</p>\n</li>\n<li>\n<p><code>UNKNOWN</code> - Oracle Database does not know whether the materialized view is in a read-consistent view of its masters from any point in time (this is the case for materialized views created on prebuilt tables)</p>\n</li>\n<li>\n<p><code>UNDEFINED</code> - Materialized view has remote masters. The concept of staleness is not defined for such materialized views.</p>\n</li>\n</ul>" ], [ "AFTER_FAST_REFRESH", "VARCHAR2(19)", "&nbsp;", "<p>Specifies the staleness value that will occur if a fast refresh is applied to this materialized view. Its values are the same as for the <code>STALENESS</code> column, plus the value <code>NA</code>, which is used when fast refresh is not applicable to this materialized view.</p>" ], [ "UNKNOWN_PREBUILT", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view is prebuilt (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UNKNOWN_PLSQL_FUNC", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view contains PL/SQL functions (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UNKNOWN_EXTERNAL_TABLE", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view contains external tables (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UNKNOWN_CONSIDER_FRESH", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view is considered fresh (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UNKNOWN_IMPORT", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view is imported (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "UNKNOWN_TRUSTED_FD", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view uses trusted constraints for refresh (<code>Y</code>) or not (<code>N</code>)</p>" ], [ "COMPILE_STATE", "VARCHAR2(19)", "&nbsp;", "<p>Validity of the materialized view with respect to the objects upon which it depends:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>VALID</code> - Materialized view has been validated without error, and no object upon which it depends has changed since the last validation</p>\n</li>\n<li>\n<p><code>NEEDS_COMPILE</code> - Some object upon which the materialized view depends has changed. An <code>ALTER MATERIALIZED VIEW...COMPILE</code> statement is required to validate this materialized view.</p>\n</li>\n<li>\n<p><code>ERROR</code> - Materialized view has been validated with one or more errors</p>\n</li>\n</ul>" ], [ "USE_NO_INDEX", "VARCHAR2(1)", "&nbsp;", "<p>Indicates whether the materialized view was created using the <code>USING NO INDEX</code> clause (<code>Y</code>) or the materialized view was created with the default index (<code>N</code>). The <code>USING NO INDEX</code> clause suppresses the creation of the default index.</p>" ], [ "STALE_SINCE", "DATE", "&nbsp;", "<p>Time from when the materialized view became stale</p>" ], [ "NUM_PCT_TABLES", "NUMBER", "&nbsp;", "<p>Number of PCT detail tables</p>" ], [ "NUM_FRESH_PCT_REGIONS", "NUMBER", "&nbsp;", "<p>Number of fresh PCT partition regions</p>" ], [ "NUM_STALE_PCT_REGIONS", "NUMBER", "&nbsp;", "<p>Number of stale PCT partition regions</p>" ], [ "SEGMENT_CREATED", "VARCHAR2(3)", "&nbsp;", "<p>Indicates whether the materialized view was created using the SEGMENT CREATION DEFERRED clause. The value is YES if the segment for the materialized view is created and NO if it is not.</p>" ], [ "EVALUATION_EDITION", "VARCHAR2(128)", "&nbsp;", "<p>Name of the edition in which editioned objects referenced in an expression column are resolved</p>" ], [ "UNUSABLE_BEFORE", "VARCHAR2(128)", "&nbsp;", "<p>Name of the oldest edition in which the stored results of the materialized view's subquery may be used for query rewrite. In editions before the specified edition, the stored results of the materialized view's data are considered unusable. This value is NULL if no such edition is specified.</p>" ], [ "UNUSABLE_BEGINNING", "VARCHAR2(128)", "&nbsp;", "<p>Name of the oldest edition in which the stored results of the materialized view's subquery may <span class=\"italic\">not</span> be used for query rewrite. The data is unusable for query rewrite in the specified edition and in any descendants of this edition. This value is NULL if no such edition is specified.</p>" ] ]