[ [ "APPLY_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the apply process at the local database which processed the transaction</p>" ], [ "QUEUE_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the queue at the local database from which the transaction was dequeued</p>" ], [ "QUEUE_OWNER", "VARCHAR2(128)", "&nbsp;", "<p>Owner of the queue at the local database from which the transaction was dequeued</p>" ], [ "LOCAL_TRANSACTION_ID", "VARCHAR2(22)", "&nbsp;", "<p>Local transaction ID for the error transaction</p>" ], [ "SOURCE_DATABASE", "VARCHAR2(128)", "&nbsp;", "<p>Database where the transaction originated</p>" ], [ "SOURCE_TRANSACTION_ID", "VARCHAR2(128)", "&nbsp;", "<p>Original transaction ID at the source database</p>" ], [ "SOURCE_COMMIT_SCN", "NUMBER", "&nbsp;", "<p>Original commit system change number (SCN) for the transaction at the source database</p>" ], [ "MESSAGE_NUMBER", "NUMBER", "&nbsp;", "<p>Identifier for the message in the transaction that raised an error</p>" ], [ "ERROR_NUMBER", "NUMBER", "&nbsp;", "<p>Error number of the error raised by the transaction</p>" ], [ "ERROR_MESSAGE", "VARCHAR2(4000)", "&nbsp;", "<p>Error message of the error raised by the transaction</p>" ], [ "RECIPIENT_ID", "NUMBER", "&nbsp;", "<p>User ID of the original user that applied the transaction</p>" ], [ "RECIPIENT_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the original user that applied the transaction</p>" ], [ "MESSAGE_COUNT", "NUMBER", "&nbsp;", "<p>Total number of messages inside the error transaction</p>" ], [ "ERROR_CREATION_TIME", "DATE", "&nbsp;", "<p>Time that the error was created</p>" ], [ "SOURCE_COMMIT_POSITION", "RAW(64)", "&nbsp;", "<p>Original commit position for the transaction</p>" ], [ "ERROR_TYPE", "VARCHAR2(11)", "&nbsp;", "<p>NULL if the apply process can access all of the LCRs in the error transaction. When the <code>ERROR_TYPE</code> is NULL, manage the error transactions using the instructions in <a class=\"olink STRMS112\" target=\"_blank\" href=\"../STRMS/managing-oracle-streams-information-consumption.htm#STRMS112\"><span class=\"italic\">Oracle Streams Concepts and Administration</span></a>.</p>\n<p><code>EAGER</code> <code>ERROR</code> if the apply process cannot access all of the LCRs in the error transaction. This error type typically means that the apply process was applying LCRs in a large transaction. When the <code>ERROR_TYPE</code> is <code>EAGER</code> <code>ERROR</code>, manage the error transaction using the instructions in <a class=\"olink XSTRM72565\" target=\"_blank\" href=\"../XSTRM/managing-xstream-in.htm#XSTRM72565\"><span class=\"italic\">Oracle Database XStream Guide</span></a>.</p>\n<p><code>RECORD LCR</code> indicates that a single LCR has been recorded as requested by user-specified error handling configuration</p>\n<p><code>RECORD TXN NO LCRS</code> indicates that the identified transaction encountered an error and only the transaction ID is recorded as requested by user-specified error handling configuration</p>\n<p><code>RECORD TXN WITH LCRS</code> indicates that the identified transaction encountered and error. The entire transaction is recorded as requested by user-specified error handling configuration.</p>\n<p><code>UNHANDLED ERRORS NO LCR</code> indicates that the identified transaction encountered an error and there was no error handling specified for this handler. No LCRs are recorded for this transaction.</p>\n<p><code>DISCARDED</code> is used to mark recorded and discarded LCRs.</p>" ], [ "SOURCE_ROOT_NAME", "VARCHAR2(128)", "&nbsp;", "<p>The global name of the source root database</p>" ], [ "ERROR_POSITION", "RAW(64)", "&nbsp;", "<p>LCR position at which the error occurred</p>" ] ]