[ [ "SNAP_ID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Unique snapshot ID</p>" ], [ "DBID", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Database ID for the snapshot</p>" ], [ "INSTANCE_NUMBER", "NUMBER", "<p><code>NOT NULL</code></p>", "<p>Instance number for the snapshot</p>" ], [ "APPLY_NAME", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Name of the apply process</p>" ], [ "STARTUP_TIME", "DATE", "<p><code>NOT NULL</code></p>", "<p>Time that the apply process was last started</p>" ], [ "READER_TOTAL_MESSAGES_DEQUEUED", "NUMBER", "&nbsp;", "<p>Total number of messages dequeued since the apply process was last started</p>" ], [ "READER_LAG", "NUMBER", "&nbsp;", "<p>For captured messages, the delay (in seconds) between the creation of the last message and it being received by the apply process. For user enqueued messages, the delay between the message being enqueued in the local database and being received by the apply process.</p>" ], [ "COORD_TOTAL_RECEIVED", "NUMBER", "&nbsp;", "<p>Total number of transactions received by the coordinator process since the apply process was last started</p>" ], [ "COORD_TOTAL_APPLIED", "NUMBER", "&nbsp;", "<p>Total number of transactions applied by the apply process since the apply process was last started</p>" ], [ "COORD_TOTAL_ROLLBACKS", "NUMBER", "&nbsp;", "<p>Number of transactions which were rolled back due to unexpected contention</p>" ], [ "COORD_TOTAL_WAIT_DEPS", "NUMBER", "&nbsp;", "<p>Number of times since the apply process was last started that an apply server waited to apply a logical change record (LCR) in a transaction until another apply server applied a transaction because of a dependency between the transactions</p>" ], [ "COORD_TOTAL_WAIT_CMTS", "NUMBER", "&nbsp;", "<p>Number of times since the apply process was last started that an apply server waited to commit a transaction until another apply server committed a transaction to serialize commits</p>" ], [ "COORD_LWM_LAG", "NUMBER", "&nbsp;", "<p>For captured messages, the delay (in seconds) between the creation of the message corresponding to the low watermark and it being applied by the apply process. For user enqueued messages, the delay between the message being enqueued in the local database and being applied by the apply process.</p>" ], [ "SERVER_TOTAL_MESSAGES_APPLIED", "NUMBER", "&nbsp;", "<p>Total number of messages applied by all the apply servers since the apply process was last started</p>" ], [ "SERVER_ELAPSED_DEQUEUE_TIME", "NUMBER", "&nbsp;", "<p>Time elapsed (in hundredths of a second) dequeuing messages by all the apply servers since the apply process was last started</p>" ], [ "SERVER_ELAPSED_APPLY_TIME", "NUMBER", "&nbsp;", "<p>Time elapsed (in hundredths of a second) applying messages by all the apply servers since the apply process was last started</p>" ], [ "CON_DBID", "NUMBER", "&nbsp;", "<p>The database ID of the PDB for the sampled session</p>" ], [ "CON_ID", "NUMBER", "&nbsp;", "<p>The ID of the container that <code>CON_DBID</code> identifies. Possible values include:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>0</code>: This value is used for rows containing data that pertain to the entire CDB. This value is also used for rows in non-CDBs.</p>\n</li>\n<li>\n<p><code>1</code>: This value is used for rows containing data that pertain to only the root</p>\n</li>\n<li>\n<p><span class=\"italic\">n</span>: Where <span class=\"italic\">n</span> is the applicable container ID for the rows containing data</p>\n</li>\n</ul>" ] ]