[ [ "NAME", "VARCHAR2(128)", "<p><code>NOT NULL</code></p>", "<p>Name of the model</p>" ], [ "FUNCTION_NAME", "VARCHAR2(30)", "&nbsp;", "<p>Model function:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>association</code> - Association is a descriptive mining function. An association model identifies relationships and the probability of their occurrence within a data set.</p>\n</li>\n<li>\n<p><code>attribute_importance</code> - Attribute Importance is a predictive mining function. An attribute importance model identifies the relative importance of an attribute in predicting a given outcome.</p>\n</li>\n<li>\n<p><code>classification</code> - Classification is a predictive mining function. A classification model uses historical data to predict new discrete or categorical data.</p>\n<p>The <code>classification</code> function can also be used for anomaly detection. In this case, the SVM algorithm with a null target is used (One-Class SVM).</p>\n</li>\n<li>\n<p><code>clustering</code> - Clustering is a descriptive mining function. A clustering model identifies natural groupings within a data set.</p>\n</li>\n<li>\n<p><code>feature_extraction</code> - Feature Extraction is a descriptive mining function. A feature extraction model creates an optimized data set on which to base a model.</p>\n</li>\n<li>\n<p><code>regression</code> - Regression is a predictive mining function. A regression model uses historical data to predict new continuous, numeric data.</p>\n</li>\n</ul>" ], [ "ALGORITHM_NAME", "VARCHAR2(30)", "&nbsp;", "<p>Algorithm used by the model:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>algo_name</code> - Setting that specifies the algorithm used by the model.</p>\n</li>\n<li>\n<p><code>asso_max_rule_length</code> - Setting that specifies the maximum length of a rule used by an association model.</p>\n</li>\n<li>\n<p><code>asso_min_confidence</code> - Setting that specifies the minimum confidence for an association model.</p>\n</li>\n<li>\n<p><code>asso_min_support</code> - Setting that specifies the minimum support for an association model.</p>\n</li>\n<li>\n<p><code>clas_cost_table_name</code> - Setting that specifies the name of the cost matrix table for a classification model.</p>\n</li>\n<li>\n<p><code>clas_priors_table_name</code> - Setting that specifies the name of the prior probability table for NB and ABN models. Decision Tree is the only classification algorithm that does not use priors.</p>\n<p>For SVM classification models, this setting specifies the name of a table of weights.</p>\n</li>\n<li>\n<p><code>clus_num_clusters</code> - Setting that specifies the number of clusters for a clustering model.</p>\n</li>\n<li>\n<p><code>feat_num_features</code> - Setting that specifies the number of features for a feature selection model.</p>\n</li>\n</ul>" ], [ "CREATION_DATE", "DATE", "<p><code>NOT NULL</code></p>", "<p>Date on which the model was created</p>" ], [ "BUILD_DURATION", "NUMBER", "&nbsp;", "<p>Duration of the model build process</p>" ], [ "TARGET_ATTRIBUTE", "VARCHAR2(128)", "&nbsp;", "<p>Attribute designated as the target of a classification model</p>" ], [ "MODEL_SIZE", "NUMBER", "&nbsp;", "<p>Size of the model (in megabytes)</p>" ] ]