[ [ "STATEMENT_ID", "VARCHAR2(30)", "&nbsp;", "<p>Value of the optional <code>STATEMENT_ID</code> parameter specified in the <code>EXPLAIN PLAN</code> statement</p>" ], [ "PLAN_ID", "NUMBER", "&nbsp;", "<p>Unique identifier of a plan in the database</p>" ], [ "TIMESTAMP", "DATE", "&nbsp;", "<p>Date and time when the <code>EXPLAIN PLAN</code> statement was generated</p>" ], [ "REMARKS", "VARCHAR2(4000)", "&nbsp;", "<p>Any comment (of up to 4000 bytes) you want to associate with each step of the explained plan. This column is used to indicate whether an outline or SQL Profile was used for the query.</p>\n<p>If you need to add or change a remark on any row of the <code>PLAN_TABLE</code>, then use the <code>UPDATE</code> statement to modify the rows of the <code>PLAN_TABLE</code>.</p>" ], [ "OPERATION", "VARCHAR2(30)", "&nbsp;", "<p>Name of the internal operation performed in this step. In the first row generated for a statement, the column contains one of the following values:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>DELETE STATEMENT</code></p>\n</li>\n<li>\n<p><code>INSERT STATEMENT</code></p>\n</li>\n<li>\n<p><code>SELECT STATEMENT</code></p>\n</li>\n<li>\n<p><code>UPDATE STATEMENT</code></p>\n</li>\n</ul>" ], [ "OPTIONS", "VARCHAR2(255)", "&nbsp;", "<p>A variation on the operation described in the <code>OPERATION</code> column</p>" ], [ "OBJECT_NODE", "VARCHAR2(128)", "&nbsp;", "<p>Name of the database link used to reference the object (a table name or view name). For local queries using parallel execution, this column describes the order in which output from operations is consumed.</p>" ], [ "OBJECT_OWNER", "VARCHAR2(128)", "&nbsp;", "<p>Owner of the table or index</p>" ], [ "OBJECT_NAME", "VARCHAR2(128)", "&nbsp;", "<p>Name of the table or index</p>" ], [ "OBJECT_ALIAS", "VARCHAR2(261)", "&nbsp;", "<p>Unique alias of a table or view in a SQL statement. For indexes, it is the object alias of the underlying table.</p>" ], [ "OBJECT_INSTANCE", "NUMBER(38)", "&nbsp;", "<p>Number corresponding to the ordinal position of the object as it appears in the original statement. The numbering proceeds from left to right, outer to inner with respect to the original statement text. View expansion results in unpredictable numbers.</p>" ], [ "OBJECT_TYPE", "VARCHAR2(30)", "&nbsp;", "<p>Modifier that provides descriptive information about the object; for example, <code>NON-UNIQUE</code> for indexes</p>" ], [ "OPTIMIZER", "VARCHAR2(255)", "&nbsp;", "<p>Current mode of the optimizer</p>" ], [ "SEARCH_COLUMNS", "NUMBER", "&nbsp;", "<p>Not currently used</p>" ], [ "ID", "NUMBER(38)", "&nbsp;", "<p>A number assigned to each step in the execution plan</p>" ], [ "PARENT_ID", "NUMBER(38)", "&nbsp;", "<p>ID of the next execution step that operates on the output of the <code>ID</code> step</p>" ], [ "DEPTH", "NUMBER(38)", "&nbsp;", "<p>Depth of the operation in the row source tree that the plan represents. The value can be used for indenting the rows in a plan table report.</p>" ], [ "POSITION", "NUMBER(38)", "&nbsp;", "<p>For the first row of output, this indicates the optimizer's estimated cost of executing the statement. For the other rows, it indicates the position relative to the other children of the same parent.</p>" ], [ "COST", "NUMBER(38)", "&nbsp;", "<p>Cost of the operation as estimated by the optimizer's query approach. Cost is not determined for table access operations. The value of this column does not have any particular unit of measurement; it is merely a weighted value used to compare costs of execution plans. The value of this column is a function of the <code>CPU_COST</code> and <code>IO_COST</code> columns.</p>" ], [ "CARDINALITY", "NUMBER(38)", "&nbsp;", "<p>Estimate by the query optimization approach of the number of rows accessed by the operation</p>" ], [ "BYTES", "NUMBER(38)", "&nbsp;", "<p>Estimate by the query optimization approach of the number of bytes accessed by the operation</p>" ], [ "OTHER_TAG", "VARCHAR2(255)", "&nbsp;", "<p>Describes the contents of the <code>OTHER</code> column:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>SERIAL</code> - Serial execution. Currently, SQL is not loaded in the <code>OTHER</code> column for this case.</p>\n</li>\n<li>\n<p><code>SERIAL_FROM_REMOTE</code> - Serial execution at a remote site.</p>\n</li>\n<li>\n<p><code>PARALLEL_FROM_SERIAL</code> - Serial execution. Output of step is partitioned or broadcast to parallel execution servers.</p>\n</li>\n<li>\n<p><code>PARALLEL_TO_SERIAL</code> - Parallel execution. Output of step is returned to serial query coordinator (QC) process.</p>\n</li>\n<li>\n<p><code>PARALLEL_TO_PARALLEL</code> - Parallel execution. Output of step is repartitioned to second set of parallel execution servers.</p>\n</li>\n<li>\n<p><code>PARALLEL_COMBINED_WITH_PARENT</code> - Parallel execution; Output of step goes to next step in same parallel process. No interprocess communication to parent.</p>\n</li>\n<li>\n<p><code>PARALLEL_COMBINED_WITH_CHILD</code> - Parallel execution. Input of step comes from prior step in same parallel process. No interprocess communication from child.</p>\n</li>\n</ul>" ], [ "PARTITION_START", "VARCHAR2(255)", "&nbsp;", "<p>Start partition of a range of accessed partitions:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><span class=\"italic\"><code>number</code></span> - Start partition has been identified by the SQL compiler, and its partition number is given by <span class=\"italic\"><code>number</code></span></p>\n</li>\n<li>\n<p><code>KEY</code> - Start partition will be identified at run time from partitioning key values</p>\n</li>\n<li>\n<p><code>ROW REMOVE_LOCATION</code> - Start partition (same as the stop partition) will be computed at run time from the location of each record being retrieved. The record location is obtained by a user or from a global index.</p>\n</li>\n<li>\n<p><code>INVALID</code> - Range of accessed partitions is empty</p>\n</li>\n</ul>" ], [ "PARTITION_STOP", "VARCHAR2(255)", "&nbsp;", "<p>Stop partition of a range of accessed partitions:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><span class=\"italic\"><code>number</code></span> - Stop partition has been identified by the SQL compiler, and its partition number is given by <span class=\"italic\"><code>number</code></span></p>\n</li>\n<li>\n<p><code>KEY</code> - Stop partition will be identified at run time from partitioning key values</p>\n</li>\n<li>\n<p><code>ROW REMOVE_LOCATION</code> - Stop partition (same as the start partition) will be computed at run time from the location of each record being retrieved. The record location is obtained by a user or from a global index.</p>\n</li>\n<li>\n<p><code>INVALID</code> - Range of accessed partitions is empty</p>\n</li>\n</ul>" ], [ "PARTITION_ID", "NUMBER(38)", "&nbsp;", "<p>Step that has computed the pair of values of the <code>PARTITION_START</code> and <code>PARTITION_STOP</code> columns</p>" ], [ "OTHER", "LONG", "&nbsp;", "<p>Other information that is specific to the execution step that a user might find useful (see the <code>OTHER_TAG</code> column)</p>" ], [ "OTHER_XML", "CLOB", "&nbsp;", "<p>Provides extra information specific to an execution step of the execution plan. The content of this column is structured using XML since multiple pieces of information can be stored there. This includes:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Name of the schema against which the query was parsed</p>\n</li>\n<li>\n<p>Release number of the Oracle Database that produced the explain plan</p>\n</li>\n<li>\n<p>Hash value associated with the execution plan</p>\n</li>\n<li>\n<p>Name (if any) of the outline or the SQL profile used to build the execution plan</p>\n</li>\n<li>\n<p>Indication of whether or not dynamic statistics were used to produce the plan</p>\n</li>\n<li>\n<p>The outline data, a set of optimizer hints that can be used to regenerate the same plan</p>\n</li>\n</ul>" ], [ "DISTRIBUTION", "VARCHAR2(30)", "&nbsp;", "<p>Method used to distribute rows from producer query servers to consumer query servers</p>\n<p><span class=\"bold\">See Also:</span> <a class=\"olink DWHSG001\" target=\"_blank\" href=\"http://www.oracle.com/pls/topic/lookup?ctx=E66230-01&amp;id=DWHSG001\"><span class=\"italic\">Oracle Database Data Warehousing Guide</span></a> for more information about consumer and producer query servers</p>" ], [ "CPU_COST", "NUMBER(38)", "&nbsp;", "<p>CPU cost of the operation as estimated by the query optimizer's approach. The value of this column is proportional to the number of machine cycles required for the operation. For statements that use the rule-based approach, this column is NULL.</p>" ], [ "IO_COST", "NUMBER(38)", "&nbsp;", "<p>I/O cost of the operation as estimated by the query optimizer's approach. The value of this column is proportional to the number of data blocks read by the operation. For statements that use the rule-based approach, this column is NULL.</p>" ], [ "TEMP_SPACE", "NUMBER(38)", "&nbsp;", "<p>Temporary space (in bytes) used by the operation as estimated by the query optimizer's approach. For statements that use the rule-based approach, or for operations that do not use any temporary space, this column is NULL.</p>" ], [ "ACCESS_PREDICATES", "VARCHAR2(4000)", "&nbsp;", "<p>Predicates used to locate rows in an access structure. For example, start or stop predicates for an index range scan.</p>" ], [ "FILTER_PREDICATES", "VARCHAR2(4000)", "&nbsp;", "<p>Predicates used to filter rows before producing them</p>" ], [ "PROJECTION", "VARCHAR2(4000)", "&nbsp;", "<p>Expressions produced by the operation</p>" ], [ "TIME", "NUMBER(38)", "&nbsp;", "<p>Elapsed time (in seconds) of the operation as estimated by query optimization. For statements that use the rule-based approach, this column is NULL.</p>" ], [ "QBLOCK_NAME", "VARCHAR2(30)", "&nbsp;", "<p>Name of the query block (either system-generated or defined by the user with the <code>QB_NAME</code> hint)</p>" ] ]